<template>
  <div>
    <div class="position-relative">
      <section class="section-shaped my-0">
        <div class="shape shape-style-1 shape-default">
          <span></span>
          <span></span>
          <span></span>
          <span></span>
          <span></span>
          <span></span>
          <span></span>
          <span></span>
          <span></span>
        </div>

        <div class="container shape-container d-flex">
          <div class="col px-0"></div>
        </div>
      </section>

      <section class="section section-shaped my-0 overflow-hidden">
        <div class="container pt-lg pb-80">
          <div class="row justify-content-center">
            <div class="fontx col-lg-10">
              <!-- -------------------------------- -->
              <h4>• การควบคุมรักษาความปลอดภัยทางข้อมูล ( Information Security Control)</h4>
              <p
                class="rem2"
              >การควบคุม คือ การสร้างระบบหรือมาตรการป้องกันความผิดพลาดที่อาจจะเกิดขึ้นกับข้อมูลสารสนเทศและระบบคอมพิวเตอร์จากภัยคุกคามทางคอมพิวเตอร์ การควบคุมการรักษาความปลอดภัยทางข้อมูลสามารถ ทำได้ดังนี้</p>
              <br />
              <h5>1. การควบคุมรักษาความปลอดภัยโดยตัวซอฟต์แวร์ (Software Control)</h5>
              <p
                class="rem2"
              >เป็นการป้องกันการลักลอบขโมยซอฟต์แวร์ การเข้าไปใช้ซอฟต์แวร์ในระบบโดยไม่ได้รับอนุญาต และการควบคุมความถูกต้องของการทำงานของซอฟต์แวร์ต่างๆ โดยมีระดับวิธีการ 3 ระดับ คือ</p>
              <p
                class="rem5"
              >1.1 การควบคุมจากระบบภายในของซอฟต์แวร์ (Internal Program Control) คือ การที่โปรแกรมนั้นได้มีการควบคุมสิทธิการเข้าถึง และสิทธิในการใช้ข้อมูลภายในระบบ ซึ่งถูกจัดเก็บไว้ในระบบฐานข้อมูลภายในระบบเอง</p>
              <p
                class="rem5"
              >1.2 การควบคุมความปลอดภัยโดยระบบปฏิบัติการ (Operating System Control) คือ การควบคุมสิทธิการเข้าถึงและการใช้ข้อมูลในส่วนต่างๆ ภายในระบบคอมพิวเตอร์ของผู้ใช้คนหนึ่ง และจำแนกแตกต่างจากผู้ใช้คนอื่น ๆ</p>
              <p
                class="rem5"
              >1.3 การควบคุมและการออกแบบโปรแกรม (Development Control) คือ การควบคุมตั้งแต่การออกแบบ การทดสอบก่อนการใช้งานจริงเพื่อให้ความมั่นใจว่าระบบที่พัฒนานั้นเป็นไปตามความต้องการของผู้ใช้ และเป็นการประเมินคุณภาพของระบบที่ทำการพัฒนา</p>
              <br />
              <h5>2. การควบคุมความปลอดภัยของระบบฮาร์ดแวร์ (Hardware Control)</h5>
              <p
                class="rem2"
              >เป็นการเลือกใช้เทคโนโลยีทางด้านฮาร์ดแวร์ที่สามารถควบคุมการเข้าถึงและป้องกันการทำงานผิดพลาดด้วยอุปกรณ์ภายในตัวเอง รวมทั้งมีระบบสำรองข้อมูลอย่างสม่ำเสมอเพื่อให้ระบบสามารถทำงานได้ตามปกติได้หากเกิดความผิดพลาดขึ้น โดยไม่เก็บข้อมูลไว้ที่เดียว ควรสำรองไว้ในอุปกรณ์อื่น เช่น แผ่นซีดี แผ่นวีดีโอ External Hard disk</p>
              <br />
              <h5>3. การใช้นโยบายในการควบคุม (Policies Control)</h5>
              <p
                class="rem2"
              >การประกาศใช้นโยบาย การตั้งกฎ ระเบียบ ในด้านการรักษาความปลอดภัยของระบบสารสนเทศโดยมีผลบังคับใช้ทั้งองค์กรเพื่อควบคุมการใช้งานของคนในองค์กร การละเมิดในระบบรักษาความปลอดภัยนั้นส่วนมากจะมีคนในองค์กรมีส่วนเกี่ยวข้องโดยเสมอดังนั้นจึงขาดไม่ได้ที่จะต้องมีมาตรการทางด้านระเบียบกฎเกณฑ์มารองรับหรือควบคุมการใช้งาน (Authentication) ของบุคลากรภายในองค์กร ตลอดไปถึงการออกกฎหมายด้านการรักษาความปลอดภัยของประเทศ เพื่อป้องกันอาชญากรรมคอมพิวเตอร์ที่จะเกิดขึ้นในสังคมปัจจุบัน เช่น การบังคับให้มีการเปลี่ยนรหัสการเข้าใช้ (Password) ระบบสารสนเทศชองหน่วยงานทุกๆ เดือน หรือ สัปดาห์ เพื่อป้องกันการขโมยรหัส การกำหนดให้มีการบันทึกการใช้งาน (Log) ของระบบสารสนเทศเพื่อใช้ในการตรวจสอบ (Audit) และหาผู้ละเมิดมาลงโทษ</p>
              <br />
              <h5>4. การควบคุมความปลอดภัยทางกายภาพ (Physical Control)</h5>
              <p
                class="rem2"
              >เป็นการกำหนดมาตรการรักษาความปลอดภัยทั่วไปให้กับบุคคล สถานที่ และอุปกรณ์ ตลอดจนสื่อต่าง ๆ ที่บันทึกข้อมูลข่าวสาร เพื่อป้องกันไม่ให้ผู้บุกรุกเข้าถึงแหล่งข้อมูลได้ทางกายภาพ โดยหน่วยงานหรือองค์กรอาจกำหนดให้มีมาตรการการเข้าถึงศูนย์คอมพิวเตอร์และเครื่องคอมพิวเตอร์ที่สำคัญได้เฉพาะเจ้าหน้าที่ที่เกี่ยวข้องเท่านั้นเพื่อป้องกันขโมยฮาร์ดแวร์ หรือการเข้าไปใช้ห้องคอมพิวเตอร์โดยไม่ได้รับอนุญาต โดยการกำหนดสิทธิในการเข้าใช้ห้องเก็บข้อมูลหรือห้องคอมพิวเตอร์ การใช้อุปกรณ์ทางชีวภาพ (biometric device) ในการตรวจสอบลักษณะส่วนบุคคลก่อนเข้าใช้เช่น ตรวจสอบเสียง ลายนิ้วมือ ม่านตา รูปหน้า เป็นต้น การติดตั้งระบบรักษาความปลอดภัยด้วยระบบการรูดบัตรผ่านประตูควบคุมการเข้าออกห้องควบคุมคอมพิวเตอร์ การติดตั้งสัญญาณกันขโมยและกล้องวงจรปิดไว้ภายในห้องคอมพิวเตอร์ การใช้กุญแจล๊อกเครื่องคอมพิวเตอร์ หรือการใช้อุปกรณ์สำรองไฟ UPS เพื่อสามารถจัดเก็บสำรองข้อมูลได้ทันท่วงทีกรณีที่เกิดเหตุการณ์ไฟตก หรือไฟดับ</p>
              <br />
              <div class="text-center font-italic col">
                <img src="/img/lesson8/4.png" width="60%" />
                <p>
                  <br />รูปภาพ แสดงรูปแบบของอาชญากรรมคอมพิวเตอร์
                </p>
              </div>
              <br />
              <h5>5. การควบคุมความปลอดภัยของข้อมูล (Data Security Control)</h5>
              <p
                class="rem2"
              >ข้อมูลเป็นสินทรัพย์สำคัญทางธุรกิจที่ต้องดูแลบำรุงรักษาและป้องกันอย่างดี การควบคุมรักษาความปลอดภัยของข้อมูลสารสนเทศ ได้แก่การควบคุมไม่ให้ผู้ไม่มีอำนาจหน้าที่เข้ามาดูข้อมูลของบริษัท และการป้องกันการลักลอบนำข้อมูลออกไปจากบริษัท โดยให้มีการบริหารจัดการให้ระบบข้อมูลมีลักษณะคงความเป็น C I A คือ</p>
              <p
                class="rem5"
              >1. การรักษาความลับ (Confidential) เป็นการดำเนินการควบคุมการเข้าถึงเรียกดูข้อมูลเพื่อให้สาระของข้อมูลข่าวสารได้ถูกเปิดเผยต่อบุคคล หรือ กระบวนการที่ได้รับอนุญาตเท่านั้น การป้องกันข้อมูลเป็นความลับต้องไม่เปิดเผยกับผู้ไม่มีสิทธิ มาตรการนี้จะทำได้โดยวิธีการเข้ารหัส (Cryptography) การใส่รหัส (Encryption) ให้กับข้อมูลที่ส่งผ่านทางระบบเครือข่ายเพื่อป้องกันการลักลอบขโมยข้อมูล หรือกำหนดสิทธิให้ผู้ใช้งานแต่ละคนสามารถใช้งานได้ตามสิทธิที่กำหนดเท่านั้น</p>
              <p
                class="rem5"
              >2. การคงสภาพ (Integrity) เป็นการควบคุมความถูกต้องครบถ้วนสมบูรณ์ของข้อมูล และวิธีการประมวลผล ต้องมีการควบคุมความผิดพลาด และเป็นการยืนยันว่าข้อมูลที่ต้องการรักษาไม่ถูกเปลี่ยนแปลงไปจากของเดิมโดยผู้ที่ไม่ได้รับอนุญาต เนื่องจากในบางกรณีผู้บุกรุกไม่มีความประสงค์ที่จะรู้สาระของข้อมูลข่าวสาร แต่ต้องการทำให้ข่าวสารนั้นผิดไปจากสาระเดิม เป็นต้น</p>
              <p
                class="rem5"
              >3. ความพร้อมในการใช้งาน (Availability) เป็นการควบคุมให้บุคคลผู้มีสิทธิ์เท่านั้นเข้าถึงข้อมูลได้ทุกเมื่อที่ต้องการ ต้องมีการควบคุมไม่ให้ระบบล้มเหลว มีสมรรถภาพทำงานต่อเนื่อง ไม่ให้ผู้ไม่มีสิทธิ์มาทำให้ระบบหยุดการทำงาน เป็นการรักษาความพร้อมในการใช้งานของข้อมูลเช่น ข้อมูลบัญชีเงินฝากของลูกค้าธนาคาร หรือข้อมูลสำคัญต่าง ๆ ที่ต้องพร้อมใช้งานในเวลาที่ต้องการ ซึ่งในบางครั้งเป็นข้อมูลที่สามารถเปิดเผยให้สาธารณชนรับทราบได้ เพื่อประโยชน์ในการประชาสัมพันธ์ หรือการเผยแพร่ในวงกว้าง เช่น ข้อมูลการท่องเที่ยว การแบ่งปันข้อมูล หรือ การติดต่อแบบโซเชียลเนตเวิรค์ (Social Network) เป็นต้น</p>
              <br />
              <h5>6. การควบคุมรักษาความปลอดภัยของระบบเครือข่าย (Network Security)</h5>
              <p
                class="rem2"
              >การรักษาความปลอดภัยของระบบเครือข่ายจะเกี่ยวข้องกับการควบคุมการเข้าใช้ข้อมูลต่างๆ (Access Control) ที่มีอยู่บนระบบเครือข่าย การรักษาความปลอดภัยของเครื่องเซิร์ฟเวอร์ การรักษาความปลอดภัยของการส่งข้อมูลผ่านเครือข่ายอินเตอร์เน็ต เช่น การใข้ระบบลายเซ็นดิจิตอล (Digital Signature) การเข้ารหัสเพื่อป้องกันการแก้ไขขัอมูลระหว่างทางการส่งข้อมูล การสร้างความน่าเชื่อถือของข้อมูลระหว่างจัดส่งด้วยใบรับรองดิจิตอล (Digital Certificate) รวมถึงการป้องกันการแพร่กระจายของไวรัสคอมพิวเตอร์ และสิ่งแปลกปลอมต่างๆ ที่เข้ามาทำลายระบบหรือเจาะระบบเพื่อต้องการขโมยข้อมูล เช่น สแปมเมล์ (spam mail) โฆษณา เป็นต้น การจัดการด้านความปลอดภัยของระบบเครือข่าย สามารถใช้ระบบ Firewall ที่เป็นฮาร์ดแวร์และซอฟต์แวร์ซึ่งเป็นเทคโนโลยีที่ทำการป้องกันผู้บุกรุกเข้า-ออกระบบ ซึ่งทำหน้าที่เปรียบเสมือนยามประตูค่อยตรวจสอบการเข้าออกระบบ รวมถึงการติดตั้งโปรแกรมป้องกันและกำจัดไวรัส (Anti-Virus) ที่มีการอัพเดตข้อมูลอย่างสม่ำเสมอ นอกจากนี้ยังใช้วิธีการใช้ iCloud การสำรองข้อมูลที่สำคัญเก็บเอาไว้ เพื่อใช้ในกรณีที่ข้อมูลเกิดความเสียหาย</p>
              <br />
              <div class="text-center font-italic col">
                <img src="/img/lesson8/5.png" width="60%" />
                <p>
                  <br />รูปภาพ แสดงการรักษาความปลอดภัยของระบบเครือข่าย
                </p>
              </div>
              <br />
              <h5>มารยาทในการใช้อินเทอร์เน็ต</h5>
              <p class="rem2">1. ไม่ใช้อินเทอร์เน็ตเพื่อการทำร้ายหรือรบกวนผู้อื่น</p>
              <p class="rem2">2. ไม่ใช้อินเทอร์เน็ตเพื่อการทำผิดกฎหมายหรือผิดศีลธรรม</p>
              <p class="rem2">3. ไม่เจาะระบบเครือข่ายอินเทอร์เน็ตของตนเองและผู้อื่น</p>
              <p
                class="rem2"
              >4. ไม่ใช้บัญชีอินเทอร์เน็ตของผู้อื่นและไม่ใช้เครือข่ายที่ไม่ได้รับอนุญาติ</p>
              <p
                class="rem2"
              >5. การติดต่อสื่อสารกับผู้อื่นบนเครือข่ายอินเทอร์เน็ต ต้องให้เกียรติซึ่งกันและกัน</p>
              <p
                class="rem2"
              >6. ต้องคำนึงถึงสิ่งที่เกิดขึ้นกับสังคมที่เกิดจากการกระทำของตน เช่น การโพสต์ การแชร์ข่าวสารปลอม</p>
              <br />
              <h5>หลักการป้องกันตนเองก่อนเข้าไปในโลกไซเบอร์</h5>
              <p class="rem2">
                1. การป้องกันข้อมูลส่วนตัว โดยการตั้งรหัสเข้าข้อมูลที่คาดเดายาก และใช้รหัสที่ต่างกัน ในแต่ละบริการหรือ
                บัญชีการเปลี่ยนรหัสผ่านบ่อยๆ หรือ การใช้ระบบสแกนลายนิ้วมือ ระบบตรวจสอบใบหน้า ก่อนเข้าสู่แอพ
                พลิเคชันออนไลน์
              </p>
              <p class="rem2">
                2. อย่าเข้าชมเว็บไซต์ที่คลิกเข้าไปจากอีเมล์ ข้อความหรือจากโซเชียล เน็ตเวิร์ก ต่างๆ ข้อความจากห้องแชท
                แบนเนอร์โฆษณาที่เป็นเว็บไซต์ที่น่าสงสัย ลิงค์ต่าง ๆ ที่ส่งมาจากคนที่คุณไม่รู้จัก
              </p>
              <p class="rem2">3. ระวังการสื่อสารปลอม ในการหลอกให้ส่งข้อมูลส่วนตัว</p>
              <p class="rem2">
                4. การตั้งค่าโปรแกรมค้นหาและกำจัดไวรัสคอมพิวเตอร์ เพิ่มความปลอดภัยเมื่อทำธุรกรรมทางธนาคาร และ
                หมั่นติดตามข่าวสารความเคลื่อนไหวของไวรัสอย่างสม่ำเสมอ
              </p>
              <p class="rem2">
                5. หลีกเลี่ยงการใช้คอมพิวเตอร์สาธารณะและสัญญาณไวไฟสาธารณะ เครื่องคอมพิวเตอร์สาธารณะอาจจะมี
                สปายแวร์อยู่จำนวนมาก ในสัญญาณไวไฟสาธารณะอาจมีความเสี่ยงในการถูกดักจับข้อมูลจากผู้ให้บริการ
                เครือข่ายหรือจากอาชญากรไซเบอร์ และอาจถูกโจมตีด้วยไวรัสเครือข่าย
              </p>
              <p
                class="rem2"
              >6. ก่อนเข้าเว็บไซต์ต้องตรวจสอบ URL ทุกครั้งควรเลือกเว็บไซต์ที่ปลอดภัยโดยสังเกตการใช้โปรโตคอลที่ขึ้นต้นด้วย 'https'</p>
              <p class="rem2">
                7. ถ้าเป็นไปได้อย่าใช้แอพพลิเคชันที่มีโฆษณาให้เรากดเปิดบราวเซอร์ โดยมากมักจะมาพร้อมกับแอพพลิเคชัน
                ฟรีซึ่งอาจจะแสดงลิงค์พาเราไปยังไซต์อันตรายได้
              </p>
              <p
                class="rem2"
              >8. หลีกเลี่ยงการเปิดเผยข้อมูลส่วนตัวบนพื้นที่สาธารณะ หากจำเป็นต้องโพส อย่าลืมมาลบทิ้งหลังจากเสร็จธุระ</p>
              <br />
              <h4>• กฎหมายเทคโนโลยีสารสนเทศของไทย</h4>
              <p
                class="rem2"
              >จากการใช้คอมพิวเตอร์ในทางที่ผิดกฎหมายและก่อให้เกิดความเสียหายต่อสังคม จึงจำเป็นต้องมีกฎหมายเทคโนโลยีสารสนเทศ สำหรับการใช้งานร่วมกันในสังคม ในแต่ละประเทศจึงได้มีการกำหนดระเบียบ กฎเกณฑ์ รวมถึงกฎหมายที่ใช้เป็นแนวทางในการปฏิบัติเพื่อให้เกิดคุณธรรมและจริยธรรมในการใช้เทคโนโลยีสารสนเทศหลายประเทศ เช่น สิงคโปร์ อินเดีย เกาหลีใต้ สหรัฐอเมริกา ฯลฯ ล้วนมีกฎหมายเทคโนโลยีสารสนเทศของตน แล้ว สำหรับประเทศไทย คณะรัฐมนตรีอนุมัติเมื่อวันที่ 15 ธันวาคม 2541 ให้กระทรวงวิทยาศาสตร์และเทคโนโลยี โดยศูนย์เทคโนโลยีอิเล็กทรอนิกส์และคอมพิวเตอร์แห่งชาติเป็นผู้ร่าง มีการกำหนดกฎหมายที่จะร่างทั้งสิ้นหกฉบับ</p>
              <p
                class="rem5"
              >1. กฎหมายธุรกรรมอิเล็กทรอนิกส์ เน้นในเรื่องข้อความที่จัดทำขึ้นเป็นรูปข้อมูลอิเล็กทรอนิกส์จะไม่ถูกปฏิเสธความมีผลทางกฎหมาย ถ้าข้อมูล ได้จัดทำขึ้นเป็นข้อมูลอิเล็กทรอนิกส์ โดยสามารถที่จะเข้าถึงเพื่อนำข้อความออกมาใช้ในภายหลังได้ ให้ถือว่า ข้อความนั้นได้ทำเป็นหนังสือ หรือมีหลักฐานเป็นหนังสือแล้ว (มาตรา 6 และมาตรา 7) โดยมีการพิสูจน์หลักฐานที่เป็น ข้อมูลอิเล็กทรอนิกส์และชั่งน้ำหนักพยานหลักฐาน (มาตรา 10) ข้อมูลเหล่านี้สามารถส่งและรับผ่านเครือข่ายเพื่อ รองรับวิทยาการสมัยใหม่</p>
              <p
                class="rem5"
              >2. กฎหมายลายมือชื่ออิเล็กทรอนิกส์ เน้นในเรื่องการใช้ลายมือชื่อดิจิตอล (digital signature) เพื่อยืนยันเอกสารหรือหลักฐาน และองค์กรที่ทำ หน้าที่ออกใบรับรองลายมือชื่อ การประกอบการรับรองลายมือชื่ออนุญาต ตลอดจนการกำกับการประกอบการรับรอง เพื่อให้ระบบลายมือชื่อดิจิตอลเป็นส่วนหนึ่งเสมือนการลงลายมือชื่อในเอกสาร</p>
              <p
                class="rem5"
              >3. กฎหมายอาชญากรรมทางคอมพิวเตอร์ เป็นกฎหมายที่เข้ามากำกับดูแลความสงบสุขของการใช้เทคโนโลยีสารสนเทศ เน้นในเรื่องสิทธิการใช้ การ ละเมิดสิทธิ์ โดยเฉพาะผู้บุกรุกหรือ hacker ที่ถือว่าเป็นการกระทำ การบุกรุก และเป็นอาชญากรรมทางคอมพิวเตอร์</p>
              <p
                class="rem5"
              >4. กฎหมายคุ้มครองข้อมูลส่วนบุคคล เนื่องจากข้อมูลในรูปดิจิตอลสามารถเผยแพร่และกระจายได้รวดเร็ว การส่งต่อ การกระจายข่าวสารอาจกระทบ ถึงสิทธิส่วนบุคคล กฎหมายจึงคุ้มครองข้อมูลส่วนบุคคล</p>
              <p
                class="rem5"
              >5. กฎหมายว่าด้วยการโอนเงินทางอิเล็กทรอนิกส์ เนื่องจากกิจการทางด้านการเงินและการโอนเงินทางอิเล็กทรอนิกส์ในรูปแบบที่เป็นทั้ง eCash eMoney หรือ การใช้เครดิตแลกเปลี่ยนกันจะมีบทบาท มีการใช้ตั๋วสัญญาใช้เงินแบบอิเล็กทรอนิกส์ ใช้รูปแบบเอกสารการเงิน อิเล็กทรอนิกส์ต่าง ๆ</p>
              <p
                class="rem5"
              >6. กฎหมายลำดับรองรัฐธรรมนูญมาตรา 78 ในมาตรา 78 แห่งรัฐธรรมนูญราชอาณาจักรไทยปัจจุบัน เน้นให้รัฐต้องกระจายอำนาจให้ท้องถิ่นพึ่งตนเองและ ตัดสินใจในกิจการท้องถิ่นได้เอง พัฒนาเศรษฐกิจท้องถิ่นและระบบสาธารณูปโภค และสาธารณูปการ ตลอดทั้ง โครงสร้างพื้นฐานสารสนเทศ ในท้องถิ่นให้ทั่วถึงและเท่าเทียมกันทั้งประเทศ</p>

              <br />
              <h4>• พ.ร.บ การรักษาความมั่นคงไซเบอร์</h4>
              <p
                class="rem2"
              >ในปัจจุบันการให้บริการหรือการประยุกต์ใช้เครือข่ายคอมพิวเตอร์ อินเทอร์เน็ต โครงข่ายโทรคมนาคม หรือการให้บริการโดยปกติของดาวเทียมมีความเสี่ยงจากภัยคุกคามทางไซเบอร์ซึ่งอาจกระทบต่อความมั่นคงของรัฐและความสงบเรียบร้อย ภายในประเทศ ดังนั้นเพื่อให้สามารถป้องกันหรือรับมือกับภัยคุกคามทางไซเบอร์ได้อย่างทันท่วงทีทั้งหน่วยงานของรัฐและหน่วยงานเอกชนจะต้องมีการป้องกัน รับมือ และลดความเสี่ยงจากภัยคุกคามทางไซเบอร์ไม่ให้เกิดผลกระทบต่อความมั่นคงในด้านต่างๆ หรือบริการที่สำคัญของประเทศ ไม่ว่าในสถานการณ์ทั่วไปหรือสถานการณ์อันเป็นภัยต่อความมั่นคงอย่างร้ายแรงก็ตาม ด้วยเหตุผลดังกล่าวสำนักงานพัฒนาธุรกรรมทางอิเล็กทรอนิกส์ สพธอ.( Electronic Transactions Development Agency , ETDA) กระทรวงดิจิทัลเพื่อเศรษฐกิจและสังคม (Ministry of Digital Economy and Society, DES) จึงได้มีกำหนดมาตราการแนวทางป้องกันการรับมือภัยคุกคามทางไซเบอร์และยกระดับการรักษาความมั่นคงปลอดภัย ด้วยใช้พ.ร.บ. การรักษาความมั่นคงปลอดภัยไซเบอร์ พ.ศ 2562 และมีผลบังคับใช้แล้ว ตั้งแต่วันที่ 28 พฤษภาคม พ.ศ. 2562 สามารถคลิกดาวน์โหลดและอ่านฉบับเต็มได้ที่ลิงค์นี้ พ.ร.บ การรักษาความมั่นคงไซเบอร์ พ.ศ 2562</p>
              <p
                class="rem2"
              >พ.ร.บ. การรักษาความมั่นคงปลอดภัยไซเบอร์ หรือ เรียกกันสั้นๆ ว่า พ.ร.บ.ไซเบอร์ คือ กฎหมายที่ตราขึ้นเพื่อให้ประเทศไทยมีมาตรการป้องกัน รับมือ และลดความเสี่ยงจากภัยคุกคามทางไซเบอร์ทั้งจากภายในและภายนอกประเทศ ที่กระทบต่อความมั่นคงของรัฐและความสงบเรียบร้อยภายในประเทศ โดย พ.ร.บ. นี้เริ่มบังคับใช้กับหน่วยงานโครงสร้างพื้นฐานสำคัญทางสารสนเทศ (Critical Information Infrastructure) ทั่วประเทศ หน่วยงานของรัฐและเอกชน โดยมีสาระสำคัญคือแนวทางในการจัดการ การป้องกัน การรับมือ และการลดความเสี่ยงทางไซเบอร์ มีการประสานความร่วมมือระหว่างผู้เกี่ยวข้อง พัฒนาความรู้ความสามารถของบุคคลากรและผู้เชี่ยวชาญ รวมถึงการให้ความรู้และความตระหนักถึงภัยไซเบอร์อีกด้วย</p>
              <h5 class="rem2">สรุปสาระสำคัญกฎหมายว่าด้วยการรักษาความมั่นคงปลอดภัยไซเบอร์ ดังนี้</h5>
              <p
                class="rem5"
              >1. กำหนดให้โครงสร้างพื้นฐานสำคัญทางสารสนเทศและหน่วยงานภาครัฐมีมาตรฐานและมีแนวทางปฏิบัติในการรักษาความมั่นคงปลอดภัยไซเบอร์</p>
              <p
                class="rem5"
              >2. การเฝ้าระวังภัยคุกคามและมีแผนรีบมือเพื่อกู้คืนระบบให้กลับมาทำงานได้ปกติได้อย่างรวดเร็ว</p>
              <p
                class="rem5"
              >3. มีการร่วมมือและประสานงานกันกับสำนักงานรักษาความปลอดภัยไซเบอร์เมื่อมีภัยร้ายแรงที่ทำให้บริการที่สำคัญไม่สามารถทำงานได้ จนทำให้ประชาชนเดือนร้อน เข้ามาให้ความช่วยเหลือแก่หน่วยงาน</p>
              <p class="rem5 font-weight-bold">โดยภัยคุกคามสามารถแบ่งเป็น 3 ระดับ ดังนี้</p>
              <p
                class="rem7"
              >- ภัยคุกคามทางไซเบอร์ในระดับไม่ร้ายแรง คือ หตุการณ์ที่เป็นภัยคุกคามมีผลทำให้ประสิทธิภาพระบบเครือข่าย หรือคอมพิวเตอร์ทำให้ช้าลง</p>
              <p
                class="rem7"
              >- ภัยคุกคามทางไซเบอร์ในระดับร้ายแรง คือภัยคุกคามที่โจมตีระบบคอมพิวเตอร์โดยกระทบต่อความมั่นคงของรัฐทั้งด้านความสัมพันธ์ระหว่างประเทศ การป้องกันประเทศ เศรษฐกิจ ความปลอดภัยสาธารณะ</p>
              <p
                class="rem7"
              >- ภัยคุกคามทางไซเบอร์ในระดับวิกฤติ คือภัยคุมคามที่มีลักษณะการโจมตีระบบคอมพิวเตอร์ที่ส่งผลกระทบรุนแรงต่อโครงสร้างพื้นฐานของระบบสารสนเทศภายในประเทศเป็นบริเวณกว้าง และการโจมตีที่เป็นการก่ออาชญากรรมทางไซเบอร์</p>
              <br />
              <h4>คณะกรรมการที่มีส่วนเกี่ยวข้องโดยตรง</h4>
              <p
                class="rem2"
              >1. คณะกรรมการการรักษาความมั่นคง ปลอดภัยไซเบอร์แห่งชาติ เรียกย่อๆ ว่า กมช. และให้ใช้ชื่อเป็นภาษาอังกฤษว่า National Cyber Security Committee เรียกโดยย่อว่า NCSC มีหน้าที่ กําหนด เสนอ จัดทําแผนปฏิบัติกําหนด มาตรการและแนวทางต่าง ๆ ที่มีส่วนเกี่ยวข้องกับ พ.ร.บ.</p>
              <p
                class="rem2"
              >2. คณะกรรมการกํากับดูแลด้านความมั่นคงปลอดภัยไซเบอร์ เรียกย่อๆ ว่า กกม. มีหน้าที่ กํากับดูแลการดําเนินงานของศูนย์ประสานการรักษาความมั่นคงปลอดภัยระบบ คอมพิวเตอร์แห่งชาติ และการเผชิญเหตุและนิติวิทยาศาสตร์ทางคอมพิวเตอร์ รวมถึงกําหนดระดับของภัยคุกคามทางไซเบอร์ พร้อมทั้งรายละเอียดของมาตรการป้องกัน</p>
              <h4>สรุปบทลงโทษ</h4>
              <p
                class="rem2"
              >1. หากพนักงานเจ้าหน้าที่ตามพระราชบัญญัตินี้เปิดเผยหรือส่งมอบข้อมูลคอมพิวเตอร์ ข้อมูลจราจรทางคอมพิวเตอร์ ข้อมูลอื่นที่เกี่ยวข้องกับระบบคอมพิวเตอร์ หรือข้อมูลของผู้ใช้บริการ ที่ได้มาตามพระราชบัญญัตินี้ให้แก่บุคคลใด ผู้ใดฝ่าฝืนต้องระวางโทษจำคุกไม่เกิน 3 ปี หรือปรับไม่เกินหกหมื่นบาท หรือทั้งจำทั้งปรับตามมาตรา 70</p>
              <p
                class="rem2"
              >2. หากพนักงานเจ้าหน้าที่ตามพระราชบัญญัตินี้ผู้ใดกระทำโดยประมาทเป็นเหตุให้ผู้อื่นล่วงรู้ข้อมูลคอมพิวเตอร์ ข้อมูลจราจรทางคอมพิวเตอร์ ข้อมูลของผู้ใช้บริการหรือข้อมูลอื่นที่เกี่ยวข้องกับระบบคอมพิวเตอร์ ที่ได้มาตามพระราชบัญญัตินี้ ต้องระวางโทษจำคุกไม่เกินหนึ่งปี หรือปรับไม่เกิน 20,000 บาท หรือทั้งจำทั้งปรับตามมาตรา 71</p>
              <p
                class="rem2"
              >3. หากผู้ใดล่วงรู้ข้อมูลคอมพิวเตอร์ ข้อมูลจราจรทางคอมพิวเตอร์ ข้อมูลของผู้ใช้บริการ หรือข้อมูลอื่นที่เกี่ยวข้องกับระบบคอมพิวเตอร์ ที่พนักงานเจ้าหน้าที่ได้มาตามพระราชบัญญัตินี้ และเปิดเผยข้อมูลนั้นต่อผู้หนึ่งผู้ใดโดยมิชอบ ต้องระวางโทษจำคุกไม่เกิน 2 ปี หรือปรับไม่เกิน 40,000 บาท หรือทั้งจำทั้งปรับตามมาตรา 72</p>
              <p
                class="rem2"
              >4. หน่วยงานโครงสร้างพื้นฐานสำคัญทางสารสนเทศใดไม่รายงานเหตุภัยคุกคามทางไซเบอร์ตามมาตรา 57โดยไม่มีเหตุอันสมควร ต้องระวางโทษปรับไม่เกิน 200,000 บาท ตามมาตรา 73</p>
              <p
                class="rem2"
              >5. ผู้ใดไม่ปฏิบัติตามหนังสือเรียกของพนักงานเจ้าหน้าที่หรือไม่ส่งข้อมูลให้แก่พนักงานเจ้าหน้าที่ตามมาตรา 61 (1) หรือ (2) โดยไม่มีเหตุอันสมควรแล้วแต่กรณี ต้องระวางโทษปรับไม่เกิน 100,000 บาทตามมาตรา 74</p>
              <p
                class="rem2"
              >6. ผู้ใดฝ่าฝืนหรือไม่ปฏิบัติตามคำสั่งของ กกม. ตามมาตรา 65 (1) และ (2) โดยไม่มีเหตุอันสมควร ต้องระวางโทษปรับไม่เกิน 300,000 บาท และปรับอีกไม่เกินวันละ 10,000 บาท นับแต่วันที่ครบกำหนดระยะเวลาที่ กกม. ออกคำสั่งให้ปฏิบัติจนกว่าจะปฏิบัติให้ถูกต้องผู้ใดฝ่าฝืนหรือไม่ปฏิบัติตามคำสั่งของ กกม. ตามมาตรา 65 (3) และ (4) หรือไม่ปฏิบัติตามคำสั่งศาลตามมาตรา 65 (5) ต้องระวางโทษจำคุกไม่เกินหนึ่งปี หรือปรับไม่เกิน 20,000 บาท หรือทั้งจำทั้งปรับตามมาตรา 75</p>
              <p
                class="rem2"
              >7. ผู้ใดขัดขวาง หรือไม่ปฏิบัติตามคำสั่งของ กกม. หรือพนักงานเจ้าหน้าที่ซึ่งปฏิบัติการตามคำสั่งของ กกม. ตามมาตรา 66 (1) หรือไม่ปฏิบัติตามคำสั่งศาลตามมาตรา 66 (2)(3) หรือ (4) โดยไม่มีเหตุอันสมควร ต้องระวางโทษจ าคุกไม่เกินสามปี หรือปรับไม่เกินหกหมื่นบาทหรือทั้งจำทั้งปรับตามมาตรา 76</p>
              <p
                class="rem2"
              >8. ในกรณีที่ผู้กระทำความผิดตามพระราชบัญญัตินี้เป็นนิติบุคคล ถ้าการกระทำความผิดของนิติบุคคลนั้นเกิดจากการสั่งการหรือการกระทำของกรรมการหรือผู้จัดการ หรือบุคคลใดซึ่งรับผิดชอบในการดำเนินงานของนิติบุคคลนั้น หรือในกรณีที่บุคคลดังกล่าวมีหน้าที่ต้องสั่งการหรือกระทำการและละเว้นไม่สั่งการหรือไม่กระทำการจนเป็นเหตุให้นิติบุคคลนั้นกระทำความผิด ผู้นั้นต้องรับโทษตามที่บัญญัติไว้สำหรับความผิดนั้น ๆ ด้วยตามมาตรา 77</p>
              <br />
              <h4>• พ.ร.บ. คุ้มครองข้อมูลส่วนบุคคล</h4>
              <p
                class="rem2"
              >พ.ร.บ. คุ้มครองข้อมูลส่วนบุคคล พ.ศ. 2562 เป็นการคุ้มครองข้อมูลส่วนบุคคลให้มีความปลอดภัยมากขึ้น โดยเน้นไปที่องค์กร หน่วยงาน หรือนิติบุคคลให้มี “มาตรฐาน” ในการจัดการข้อมูลส่วนบุคคลอย่างเหมาะสมและเพียงพอ เมื่อมีความจำเป็นต้องขอใช้ข้อมูลส่วนบุคคล ทั้งนี้ก็เพื่อป้องกันความเสี่ยงที่จะมีผลกระทบไปถึงการรักษาความลับ (Confidentiality) ความถูกต้องสมบูรณ์ (Integrity) และความพร้อมใช้งาน (Availability) ของข้อมูลส่วนบุคคล ที่ก่อให้เกิดแนวโน้มให้เกิดผลกระทบเชิงลบหรือความเสียหายในระดับบุคคลหรือองค์กร พ.ร.บ. นี้มีผลบังคับใช้แล้วในเดือนพฤษภาคม 2563 สามารถอ่านฉบับเต็มได้ที่เว็บไซต์ทางการนี้</p>
              <br>
              <div class="container text-center font-italic">
                <div class="row">
                  <div class="col-sm"><img src="/img/lesson8/6a.png" width="80%" /></div>
                  <div class="col-sm"><img src="/img/lesson8/6b.png" width="80%" /></div>
                  
                </div>
                <br>
                 <div class="row">
                        <div class="col-sm"><p>รูปภาพแสดง  ข้อมูลส่วนบุคคล</p></div>
                     </div>
              </div>
              
              <!-- -------------------------------- -->
              <br />
              <br />
              <br />
              <br />
              <div class="container">
                <div class="row">
                  <div class="col-auto mr-auto">
                    <router-link to="/lesson6_2" title="Lesson6_2 Page">
                      <div class="btn-wrapper">
                        <base-button
                          tag="a"
                          target="_blank"
                          rel="noopener noreferrer"
                          class="mb-3 mb-sm-0"
                          outline
                          type="info"
                          icon="fa fa-chevron-left"
                        >Previous</base-button>
                      </div>
                    </router-link>
                  </div>
                  <div class="col-auto">
                    <router-link to="/lesson6_4" title="Lesson6_4 Page">
                      <div class="btn-wrapper">
                        <base-button
                          tag="a"
                          target="_blank"
                          rel="noopener noreferrer"
                          class="mb-3 mb-sm-0"
                          outline
                          type="info"
                        >
                          Next
                          <i class="fa fa-chevron-right" aria-hidden="true"></i>
                        </base-button>
                      </div>
                    </router-link>
                  </div>
                </div>
              </div>
              <div class="text-center mt-5">Page 3/4</div>
            </div>
          </div>
        </div>
      </section>

      <hr />
      <div class="col-lg-center">
        <div class="pt-4 text-center">
          <h5 class="title">
            <span class="d-block mb-1">Author | -</span>
            <small class="h6 text-black">_</small>
          </h5>
        </div>
      </div>
      <hr />
    </div>
  </div>
</template>

<script>
export default {
  name: "home",
  components: {},
};
</script>

<style></style>
