<template>
  <div>
    <div class="position-relative">
      <section
        class="fontx section section-lg section-shaped overflow-hidden my-0"
      >
        <div class="shape shape-style-1 shape-default shape-skew">
          <span></span>
          <span></span>
          <span></span>
          <span></span>
          <span></span>
          <span></span>
        </div>
        <br />
        <br />
        <br />
        <br />
        <div class="container py-0 pb-lg">
          <div class="row justify-content-between align-items-center">
            <div class="col-lg-5 mb-5 mb-lg-0">
              <h1 class="text-white font-weight-light display-1">
                Digital Disruption
              </h1>
              <p class="lead text-white mt-4">
                หากพูดถึงสื่อดิจิทัล สิ่งที่หลายคนนึกถึง คือ
                การสื่อสารระหว่างผู้คนบนโลกออนไลน์
                ที่สามารถเขื่อมต่อหากันได้ด้วยระบบอินเทอร์เน็ต
                ผ่านเครื่องมือดิจิทัลที่หลากหลาย ...
              </p>
            </div>
            <div class="col-lg-6 mb-lg-auto">
              <div
                class="rounded shadow-lg overflow-hidden transform-perspective-right"
              >
                <b-carousel id="carousel1" controls indicators>
                  <!-- Text slides with image -->
                  <b-carousel-slide
                    img-src="img/lesson4/cov.jpg"
                  ></b-carousel-slide>
                </b-carousel>
              </div>
            </div>
          </div>
        </div>
        <br />
        <br />
        <br />
        <br />
        <br />
        <br />
      </section>

      <section class="section section-shaped my-0 overflow-hidden">
        <div class="container pt-lg pb-80">
          <div class="row justify-content-center">
            <div class="fontx col-lg-10">
              <!-- -------------------------------- -->
              <h2 class="display-3 text-center">
                การพัฒนาความเป็นพลเมืองที่มีคุณภาพในยุคดิจิทัล
              </h2><br>
              <p class="rem2">
                หากพูดถึงสื่อดิจิทัล สิ่งที่หลายคนนึกถึง คือ
                การสื่อสารระหว่างผู้คนบนโลกออนไลน์
                ที่สามารถเขื่อมต่อหากันได้ด้วยระบบอินเทอร์เน็ต
                ผ่านเครื่องมือดิจิทัลที่หลากหลาย ไม่ว่าจะเป็นโทรศัพท์มือถือ
                คอมพิวเตอร์ คอมพิวเตอร์พกพา เครื่องเล่นเกม หรือโทรทัศน์
                อาจจะกล่าวได้ว่าสื่อดิจิทัลเป็นเสมือนปัจจัยที่ห้าในการดำรงชีวิตของมนุษย์ในยุคปัจจุบัน
                ด้วยไร้ข้อจำกัดด้านเวลาและสถานที่ (Timeless and Space less)
                ตอบสนองการใช้งานที่มีความหลากหลาย (multi-tasking)
                รวมถึงสามารถย่อโลกให้เล็กลงและมีความใกล้ชิดกันมากขึ้น
                ซึ่งสื่อดิจิทัลเข้ามาอำนวยความสะดวกในหลายด้าน
                ไม่ว่าเป็นด้านการศึกษา ด้านธุรกิจ หรือ
                การเชื่อมความสัมพันธ์ระหว่างผู้คนบนโลก
                สร้างการติดต่อสื่อสารได้อย่างมีปฏิสัมพันธ์ (Interactive)
                ด้วยความเร็ว แรง
                และแพร่กระจายได้อย่างรวดเร็วแบบที่ไม่เคยมีสื่อใดทำได้มาก่อน
                อาจจะกล่าวได้ว่าสื่อดิจิทัลได้มีอิทธิพลต่อชีวิตของผู้คนและสามารถเปลี่ยนแปลงสังคมเพียงปลายนิ้วสัมผัส
                ดังนั้น การมีความรู้ ความเข้าใจ
                เพื่อนำไปสู่การเกิดทักษะในการเป็นพลเมืองที่มีคุณภาพบนโลกออนไลน์จึงมีความสำคัญอย่างมาก
                ไม่ว่ะเป็นหลักการสื่อสารดิจิทัลเบื้องต้น
                คุณลักษณะและองค์ประกอบสำคัญที่เกี่ยวข้องกับการสื่อสารผ่านสื่อดิจิทัล
                หลักการและวิธีการในการใช้สื่อดิจิทัลอย่างสร้างสรรค์และรับผิดชอบ
                รวมถึงความปลอดภัยในการใช้สื่อดิจิทัลจะทำให้เกิดการสื่อสารผ่านสื่อดิจิทัลที่เกิดประโยชน์ต่อตนเอง
                ครอบครัว และสังคมต่อไป
              </p>
              <br />
              <h4>
                การสื่อสารผ่านสื่อดิจิทัลพลังของการเปลี่ยนแปลงอยู่ในมือคุณ
              </h4>
              <p class="rem2">
                พวกเรากำลังอยู่ในยุคของการเปลี่ยนแปลงและการปรับตัวครั้งสำคัญอีกครั้งในประวัติศาสตร์ของมนุษยชาติ
                และสื่อดิจิทัลได้เข้ามามีส่วนสำคัญอย่างยิ่งต่อชีวิตของทุกคน
                คำถามคือ
                ทำไมสื่อดิจิทัลจึงทรงพลังและแฝงไว้ด้วยอำนาจในการพลิกผันโลกใบนี้
                เราคงเคยได้ยินคำว่า Digital Disruption ซึ่งเทคโนโลยีดิจิทัล เช่น
                Cloud, Big Data, Robotics หรือ Machine Learning (A.I.)
                ได้เข้ามีบทบาทในการพลิกโฉมการดำเนินชีวิตอย่างรวดเร็วและฉับพลัน
                ในส่วนของการสื่อสารเราได้เห็นรูปแบบผ่านสื่อสังคมออนไลน์ หรือ
                โซเชียลเน็ตมีเดีย (Social Media) หลากหลายประเภท เช่น
              </p>
              <p class="rem2">
                เฟสบุ๊ค (facebook)
                เครือข่ายสังคมออนไลน์ที่ใหญ่ที่สุดของโลกที่ถือว่าได้รับความนิยมอย่างยิ่งในปัจจุบัน
                ซึ่ง มาร์ก ซักเคอร์เบิร์ก ได้สร้างสารบัญภาพและประวัติสั้นๆ
                ของเพื่อนร่วมชั้นเรียน
                จนกลายมาเป็นสื่อสังคมออนไลน์ที่ได้รับความนิยมในอันดับต้น ๆ
                ในยุคปัจจุบัน ที่ผู้คนใช้ติดต่อสื่อสาร
                เป็นเครือข่ายที่ได้รับความนิยมเป็นลำดับต้นๆ ในเวลานี้
              </p>
              <p class="rem2">
                ทวิตเตอร์ (Twitter) เครือข่ายสังคมออนไลน์แบบไมโครบล็อก
                ที่ผู้ใช้เรียกการส่งข้อความนี้ว่าทวีต (Tweet) หรือเสียงนกร้อง
                โดยผู้ใช้สามารถส่งข้อความยาวไม่เกิน 280 ตัวอักษร
                ที่เน้นการส่งข้อความสั้น กระชับ และรวดเร็ว
                เราจะเห็นว่าทวิตเตอร์จะมีบทบาทสูงในช่วงที่สถานการณ์วิกฤติต่างๆ
                เช่น กรณีกลุ่มหมูป่าติดถ้ำ
                ที่สร้างให้เกิดการมีส่วนร่วมของผู้คนในสังคมจากทั่วสารทิศได้อย่างรวดเร็ว
              </p>
              <p class="rem2">
                ยูทูป (Youtube)
                เครือข่ายสังคมออนไลน์ที่ให้ผู้ใช้งานสามารถอัพโหลดและแลกเปลี่ยนคลิปวิดีโอ
                ดิจิทัลแพลตฟอร์ม (Digital Platform) ชนิดนี้
                ที่สร้างชื่อเสียงให้ศิลปินโด่งดังทั้งในระดับประเทศและระดับโลกมาหลายต่อหลายคน
              </p>
              <p class="rem2">
                อินสตาแกรม (Instagram) โปรแกรมแบ่งปันรูปภาพและคลิปวิดีโอสั้น ๆ
                ที่ผู้ใช้งานสามารถถ่ายรูปและตกแต่งรูปภาพได้ตามต้องการ
                และแบ่งปันผ่านบริการเครือข่ายสังคมออนไลน์
              </p>
              <p class="rem2">
                ในทางหนึ่งสื่อสังคมออนไลน์ถือว่ามีประโยชน์อย่างมากใน
                เพราะเป็นการเปิดโอกาสให้บุคคลทั่วไปได้แสดงศักยภาพของตนเองอย่างที่ไม่เคยมีมาก่อน
                เป็นช่องทางในการติดต่อสื่อสาร การเรียนรู้ ทำธุรกิจ
                อย่างไรก็ตามในขณะเดียวกันก็พบปัญหาหรือสถารณ์ที่เป็นความเสี่ยงอันเกิดจากการใช้สื่อดิจิทัล
                ไม่ว่าจะเป็นนำเสนอหรือกระจายข่าวปลอม การถูกล่อลวงจากมิจฉาชีพ
                (scammer) การใช้ในการรังแกกันทางไซเบอร์ (Cyber Bullying)
                หรือประทุษวาจาบนโลกออนไลน์ (Hate speech)
                การหลอกขายของบนโลกออนไลน์ หรือ สื่อลามกอนาจารย์ เป็นต้น
              </p>
              <p class="rem2">
                ดังนั้น จำเป็นอย่างยิ่งที่ผู้คนในยุคนี้
                หรือพลเมืองที่เกิดในยุคดิจิทัลจะต้องมีความสามารถในการใช้สื่อดิจิทัลเพื่อการสื่อสารอย่างสร้างสรรค์และปลอดภัย
                ทุกคนจำเป็นต้องมีทักษะในการจัดการกับปัญหาหรือผลกระทบบนโลกออนไลน์ได้อย่างปลอดภัยและเหมาะสม
                การเข้าใจคุณลักษณะสำคัญของการสื่อสารดิจิทัลจะนำไปสู่การใช้สื่อดิจิทัลอย่างรู้เท่าทัน
              </p>

              <br />
              <h3>1. ลักษณะสำคัญที่ทำให้สื่อดิจิทัลทรงพลัง</h3>
              <p class="rem2">
                ศตวรรษที่ 21 คนส่วนใหญ่ใช้วลาอยู่หน้าจอคอมพิวเตอร์
                โลกของสื่อดิจิทัล คือ โลกของการผสานกัน (convergence)
                และสื่อหนึ่งชนิดสามารถทําหน้าที่ได้หลายอย่าง (multi-tasking)
                ซึ่งหมายความว่า ผู้ใช้สื่อหนึ่งคน
                สามารถปฏิสัมพันธ์กับสื่อได้อย่างน้อยสี่ชนิดในเวลาเดียวกัน
                จนเกิดเป็นการผสมผสาน
                การประเมินความจุดร่วมของเทคโนโลยีและเนื้อหาเพื่อให้เข้าถึงผู้รับสาร
                ทั้งบรอดแบรนด์ โทรทัศน์ วิทยุ คอมพิวเตอร์ โทรศัพท์มือถือ
                ด้วยการรับสารผ่าน PC, Notebook, IPAD, iPod ,Tablet
                โดยคุณลักษณะที่สำคัญของการสื่อสารในยุคดิจิทัล มีดังตอ่ไปนี้
              </p>

              <h4 class="rem2">
                1.1 การปราศจากขอจํากัดในการเข้าถึง (Untethered)
              </h4>
              <p class="rem2">
                นั้นหมายถึง สื่อออนไลน์ได้ทำลายข้อจำกัดด้านพื้นที่และเวลา
                (Spaceless and Timeless) เราจึงสามารถใช้สื่อดิจิทัลได้ทุกเวลา
                ทุกสถานที่
              </p>
              <p class="rem5">
                • เราสามารถใช้สื่อดิจิทัลเวลาไดก็ได้ (Anytime)
                การสื่อสารบนโลกออนไลน์ไร้ข้อจำกัดด้านเวลา (Timeless)
                ทำให้สามารถสื่อสาร หรือใช้สื่ออนไลน์ได้ตลอด 24 ชั่วโมง
              </p>
              <p class="rem5">
                • เราสามารถใช้งานที่ใดก็ได้ (Anywhere)
                ดังนั้นแม้จะอยู่ในพื้นที่ห่างไกลก็สามารถสื่อสารผ่านระบบออนไลน์ได้
                สามารถช้อปปิ้งผ่านระบบออนไลน์ (Online Shopping)
                ชมภาพยนตร์ออนไลน์ เรียนออนไลน์ หรือประชุมออนไลน์
                ตัวอย่างที่เห้นได้ชัดเจนคือในช่วงของการแพร่ระบาดของเชื้อไวรัสโควิด
                19 ได้เกิดการสร้างมาตรการการสร้างระยะห่างทางสังคม (social
                distancing)
                ขึ้นทำเกิดมาตรการให้คนทำงานจากที่บ้านเพื่อลดการติดเชื้อ (work
                from home) โดยมีการประชุมการทำงานผ่านแอพพลิเคชั่น เช่น Zoom, MS
                Team หรือ Cisco Webex เป็นต้น
                ได้มีการเรียนการสอนผ่านระบบออนไลน์เพื่อให้นักเรียนสามารถเรียนรู้ได้
                แม้จะมีการสั่งปิดสถานศึกษาเพื่อลดการแพร่ระบาดของเชื้อโรค
              </p>
              <p class="rem5">
                • ใคร ๆ ก็สามารถสื่อสารบนโลกออนไลน์ได้ (Anyone)
                ในโลกออนไลน์เราสามารถสื่อสารกับใครก็ได้โดยได้มีพรหมแดนด้านระยะทาง
                เชื้อชาติ ภาษา หรือวัฒนธรรมมาขวางกั้น
                การติดต่อสื่อสารดังกล่าวมีรูปแบบจากคนหนึ่งสู่อีกคนหนึ่ง (one to
                one) จากคนหนึ่งสู่คนหลายๆ คน (one to many)
                จากคนกลุ่มเล็กสู่คนหลายๆคน (few to many)
                หรือจากคนหลายคนสู่คนกลุ่มใหญ่ (many to many)
                สามารถกระจายข่าวสารผ่านการโพสต์ (Post) การแชร์ (Share)
                ที่ทำให้การเกิดการกระจายของเนื้อหาดิจิทัลนั้น (Digital Content)
                ออกไปอย่างกว้างขวาง ดังภาพด้านล่าง
              </p>
              <div class="text-center font-italic">
                <img src="/img/lesson4/1.jpg" width="60%" />
                <p>
                  <br />ภาพที่ 1 – Theme สำเร็จรูปที่มีอยู่ในโปรแกรม Microsoft
                  PowerPoint
                </p>
              </div>
              <br />
              <p class="rem2">
                นอกจากนี้ ผู้ใช้สื่อยังสามารถการออกแบบสื่อด้วยตนเอง
                และมีความสามารถในการส่งสาร
                ซึ่งต่างจากสมัยก่อนที่ผู้ส่งสารมีเพียงกลุ่มที่จำกัด เช่น
                กลุ่มที่เป็นเจ้าขององค์กรด้านการสื่อสารมวลชน หรือนักสื่อสารมวลชน
                แต่ในปัจจุบันหากมีอุปกรณ์ที่เชื่อมต่ออินเทอร์เน็ตได้เช่นสมาร์ทโฟน
                ก็ทำให้ทุกคนมีอำนาจเท่าเทียมกันในการส่งข้อมูลข่าวสาร
                สร้างเนื้อหาข่าวสาร เพื่อส่งไปยังผู้คนจำนานมากทั้งหมด เรียกวว่า
                User Generated Content (UCG)
                นั่นคือการที่ผู้บริโภคหรือลูกค้ากลุ่มเป้าหมายผลิตเนื้อหาสาร
                (Digital content) ด้วยตัวเอง
              </p>

              <p class="rem2">
                อย่างไรก็ตาม
                เมื่อใครก็ได้สามารถผลิตสื่อเองเพื่อเผยแพร่ก็อาจจะทำให้เกิดการสร้างข่าวลวงข่าวปลอม
                เกิดแก๊งหรือกลุ่มมิจฉาชีพที่ใช้สื่อออนไลน์เพื่อล่อลวงหรือต้มตุ๋นผู้อื่น
                (scammer)
                รวมถึงคนที่อาจจะใช้สื่อออนไลน์เพื่อสร้างความรุนแรงเช่นการด่าทอหรือการรังแกผู้อื่น
                สื่อลามกอานาจาร ยาเสพติดหรือการพนัน
                แม้จะมีมาตรการทางกฎหมายเข้ามาดูแลเช่น
                พระราชบัญญัติว่าด้วยการกระทําความผิดเกี่ยวกับคอมพิวเตอร์ พ.ศ.
                ๒๕๖๐ แต่ก็ยากจะควบคุมได้ทั้งหมด ดังนั้น
                ผู้ใช้เองก็ต้องมีภูมิรู้และมีการรู้เท่าทันเพื่อจะได้ป้องกันตนเองจากบุคคลที่อาจจะแฝงตัวผ่านโลกออนไลน์เพื่อนำข้อมูลหรือการสื่อสารนั้นๆ
                ไปใช้ประโยชน์ในทางมิชอบอีกด้วย
              </p>
              <p class="rem5">
                • เราสามารถสื่อสารผ่านอุปรณ์ใดๆ ก็ได้ (Any device)
                เทคโนโลยีดิจิทัลได้สร้างโลกใบใหม่ที่ชื่อว่าโลกออนไลน์
                การเข้าถึงข้อมูลข่าวสารและการติดต่อสื่อสารไม่ได้จำกัดแค่วิทยุ
                โทรทัศน์ อีกต่อไป แต่เราสามารถสื่อสารผ่านอุปกรณ์ต่างๆ
                ที่เชื่อมต่อกับระบบอินเทอร์เน็ต เช่น โทรศัพท์มือถือ โทรทัศน์
                คอมพิวเตอร์ เครื่องเล่นเกม โดยสามารถใช้ในการติดต่อสื่อสาร
                หรือเข้าถึงข้อมูลข่าสารได้อย่างไม่มีข้อจำกัดแค่วิทยุหรือโทรทัศน์เท่านั้น
                ยิ่งอุปกรณ์การสื่อสารที่มีการพัฒนาอย่างต่อเนื่องจากเดิมที่ต้องมีการใช้สายแลน
                (LAN) เพื่อเชื่อมต่อสัญญานอินเทอร์เน็ต
                มาเป็นสัญญานอินเทอร์เน็ตแบบไร้สาย (wireless)
                ก็ยิ่งทำให้การสื่อสารสะดวกสบายมากยิ่งขึ้นไปอีก
              </p>

              <p class="rem5">
                • สื่อดิจิทัลทำให้เราสามารถทำงานได้หลายอย่างพร้อมกัน
                ผ่านอุปกรณ์ที่มีความหลากหลาย และทำหน้าที่ได้หลายอย่างพร้อมกัน
                (Multi-mode, Multi-device และ Multi-tasking)
              </p>
              <p class="rem2">
                คำว่า Multi-mode และ Multi-tasking
                จะมีความหมายใกล้เคียงกันนั้นคือการทำงานด้วยความสามารถหลากหลายในเวลาเดียวกัน
                เช่น สมาร์ทโฟนหนึ่งเครื่องสามารถใช้ในการชม การฟัง
                การติดต่อสื่อสาร การพูด การเล่น ที่มีครบในเครื่องเดียวกันทั้งหมด
                สามารถทำงานพร้อมกันได้หลายอย่าง เช่น การเช็กข้อมูล e-mail
                กล่องข้อความใน facebook สื่อสารกับลูกค้าผ่าน Line
                จัดทำเอกสารในโปรแกรม Word โปรแกรม Excel หรือ presentation
                ด้วยโปรแกรม power point เป็นต้น
                โดยอาจจะผ่านอุปกรณ์ที่สามารถเชื่อมต่ออินเทอร์เน็ตได้เพียงเครื่องเดียว
                ซึ่งจะทำให้ประหยัดเวลา ได้งานที่มีจำนวนมากขึ้น
                ทำงานได้หลายอย่างได้ในเวลาเดียวกัน
                ทำให้ประหยัดเวลาและงบประมาณได้เป็นอย่างดี แต่มีงานวิจัยระบุว่า
                การทำงานหลายอย่างพร้อมกันตลอดเวลาอาจจะส่งผลต่อการลดศักยภาพในการจดจำ
                เพราะผู้ใช้ไม่ได้ฝึกให้สมองจดจ่ออยู่กับการทำงานอย่างใดอย่างหนึ่งเป็นเวลานานๆ
                และอาจจะมีผลต่อความหนาแน่นของเซลล์ประสาทในสมองส่วนที่ควบคุมการหยั่งรู้
                ความเข้าใจ ความรู้สึก และการควบคุมอารมณ์ตนเอง
                นอกจากนี้ยังทำให้เกิดภาวะ สมาธิสั้น หลงลืมบ่อยอีกด้วย (อรวรรณ,
                2563)
                อย่างไรก็ตามการมีอุปกรณ์ที่สามารถตอบสนองการทำงานที่หลากหลายถือเป็นประโยชน์หากผู้ใช้สามารถบริหารจัดการในการใช้สื่อได้อย่างมีประสิทธิภาพ
              </p>
              <p class="rem2">
                นอกจากการเข้าใจหลักการพื้นฐานที่สำคัญในยุคดิจิทัลแล้ว
                การเข้าใจองค์กระกอบของกระบวนการในการสื่อสารดิทัลจะทำให้เราสามารถใช้สื่อดิจิทัลได้อย่างมีคุณภาพและบรรลุเป้าหมายที่วางไว้ได้
              </p>
              <br />
              <h3>2. องค์ประกอบของการสื่อสารในยุคดิจิทัล</h3>
              <p class="rem2">
                แรกเริ่มเดิมทีองค์ประกอบการที่สำคัญและเป็นพื้นฐานประกอบ
                ผู้ส่งสาร (Sender) สาร (Message) สื่อ (Channel) ผู้รับสาร
                (Receiver) และการสื่อสารตอบกลับ
                การสื่อสารที่ประสบความสำเร็จคือการที่ผู้ส่งสารสามารถส่งเนื้อหาสารไปยังผู้รับสารจนเกิดเป็นความเข้าใจที่ตรงกัน
                ชัดเจน และบรรลุเป้าหมายที่จะสื่อสารนั้น
                เมื่อยุคสมัยเปลี่ยนไปเกิดเทคโนโลยีดิจิทัลเข้ามาแทนที่รูปแบบการสื่อสารแบบดั้งเดิมก็ส่งผลให้องค์ประกอบการสื่อสารเปลี่ยนแปลงเช่นกัน
              </p>
              <h4 class="rem2">
                2.1 องค์ประกอบด้านการสื่อสารดิจิทัล :
                การเปลี่ยนผ่านจากสื่อเก่าสู่สื่อใหม่
              </h4>
              <p class="rem5">
                เมื่อช่องทางการสื่อสารเกิดการเปลี่ยนแปลงเข้าสู่ยุคดิจิทัล
                โดยมีการสื่อสารผ่านเครือข่ายอินทอร์เน็ต
                ผ่านรูปแบบการสื่อสารใหม่ที่มนุษย์ได้พัฒนาขึ้น เช่น การ
                พูดคุยผ่านการสนทนาข้อความ (Chatting) การเข้าสู่
                เครือข่ายสังคมออนไลน์ (Social Networking)
                หรือการพูดคุยกันโดยเชื่อมต่อกับอินเทอร์เน็ต (Free Call)
                ไปจนถึงการพูดคุยแบบเห็นหน้ากัน (Video Call)
                จึงส่งผลให้องค์ประกอบของการสื่อสารมีการเปลี่ยนแลงไปตามเทคโนโลยีดิจิทัล
                ดังต่อไปนี้
              </p>
              <h5 class="rem5">
                2.2.1 การหลอมรวมระหว่างผู้ส่งสารและผู้รับสาร
                กลายเป็นผู้สร้างสรรค์สื่อ (User Generated Content: UCG)
              </h5>
              <p class="rem5">
                ด้วยลักษณะของสื่อดิจิทัลที่ผู้ส่งสารและผู้รับสาร
                สามารถสลับบทบาทในการสื่อสารได้ทันที มีการโต้ตอบ
                และมีปฏิสัมพันธ์ต่อการสื่อสาร
                ที่ทุกคนสามารถเป็นผู้ส่งสารและรับสารได้ในเวลาเดียวกัน
                ทำให้เส้นแบ่งระหว่างผู้ส่งสารและผู้รับสารได้ถูกทำลายลงไป
                ผู้ใช้ออนไลน์จะสามารถสร้างสรรค์หรือสื่อสารเนื้อหาได้อย่างอิสระผ่านช่องทางต่างๆ
                หลากหลายรูปแบบ สามารถจัดกลุ่มรูปแบบการสื่อสารแบบ UCG ได้ดังนี้
              </p>

              <p class="rem5">
                1) กระดานสนทนา เว็บบอร์ด ฟอรั่ม เช่น Pantip.com, Dek-D.com
              </p>
              <p class="rem5">
                2) เว็บล็อก/ไดอารี่ออนไลน์ เช่น Wordpress, Blogger, Tumbler
              </p>
              <p class="rem5">3) สาราณุกรมออนไลน์ เช่น Wikipedia</p>
              <p class="rem5">
                4) เครือข่ายสังคมออนไลน์ เช่น Facebook, Twitter, Instagram,
                Pinterest
              </p>
              <p class="rem5">
                5) ชุมชนแฟน เช่น แฟนเพจต่างๆ อาทิ ภาพยนตร์ ละคร ดาหรา นักร้อง
                สโมสรฟุตบอล ดนตรี และกีฬา เป็นต้น
              </p>
              <br />
              <p class="rem5">
                อย่างไรก็ตาม การที่ใครๆ ก็สามารถกลายเป็นผู้สร้างสรรค์เนื้อหานี้
                อาจจะทำให้ความเป็นมืออาชีพลดลง
                รูปแบบการสื่อสารเป็นแบบเพื่อนต่อเพื่อน (Peer to peer)
                ไม่เป็นทางการ ทุกคนมีอิสระเต็มที่ในการสื่อสาร
                เมื่อประกอบกับตัวพื้นที่ในรูปแบบของ UCG
                ก็เอื้ออำนวยความง่ายในการจัดทำสื่อและสื่อสารออกไปดังที่กล่าวข้างต้น
                บนโลกออนไลน์จึงเต็มไปด้วยข้อมูลจำนวนมากมายมหาศาลจากทั่วทุกมุมมองโลก
                ดังที่ โธมัส ฟริดแมน (Thomas Friedman) ได้เขียนไว้ในหนังสือ
                “โลกของเรานั้นแบน: ประวัติศาสตร์โดยย่อของศตวรรษที่ยี่สิบเอ็ด
                (The World Is Flat: A Brief History of the Twenty-first
                Century)” โดยหนังสือเล่มนี้รู้จักในนาม “ใครว่าโลกกลม”
                ว่าการเกิดขึ้นของโปรแกรมท่องอินเทอร์เน็ตอย่างเนตสเคป (Netscape)
                ทำให้ผู้คนเข้าถึงข้อมูลทางอินเทอร์เน็ตได้สะดวกขึ้น
                ฟริดแมนเขียนไว้ชัดว่า “เวทีที่เกิดขึ้นใหม่นี้เป็นเวทีระดับโลก
                บนพื้นฐานของการติดต่อผ่านอินเทอร์เน็ต
                ที่ส่งผลให้เกิดความร่วมมือกันในหลายระดับ
                โดยเฉพาะการแบ่งปันความรู้ และแบ่งงานกันทำ ในเวลาเดียวกัน
                โดยไม่คำนึงถึงความห่างไกลด้านภูมิศาสตร์ หรือภาษา”
              </p>
              <p class="rem5">
                อย่างไรก็ตาม
                ในด้านหนึ่งการสื่อสารที่มาจากคนหลากหลายและมีเสรีภาพได้ส่งผลให้โลกออนไลน์ถูกนำมาใช้ในทางที่ก่อให้เกิดความเสียหายจากมิจฉาชีพ
                เช่น ข้อมูลข่าวสารที่อาจจะเป็นเท็จ ข่าวปลอม (Fake News)
                โฆษณาชวนเชื่อ การต้มตุ๋นผู้อื่น (Scammer)
                รวมถึงการเข้าไปลักลอบขโมยข้อมูลทางด้านการเงินหรือข้อมูลสำคัญ
                (Hack)
                ซึ่งผู้ที่ใช้สื่อดิจิทัลจำเป็นจะต้องมีความรู้พื้นฐานในการใช้สื่อดิจิทัลอย่างปลอดภัยและรู้เท่าทัน
                (Digital security and Digital Literacy)
                รวมถึงนำสื่อดิจิทัลไปใช้ให้เกิดประโยชน์แก่ตนเองและผู้อื่น
                โดยผู้ใช้สารจะต้องใช้วิจารณญาณรวมถึงการคิดวิเคราะห์อย่างสูงในการเลือกข้อมูลข่าวสารที่สอดคล้องกับความต้องการของตนเอง
                ปลอดภัย และมีประโยชน์อีกด้วย
              </p>
              <br />
              <h5 class="rem5">2.2.2 การปฏิสัมพันธ์กับเนื้อหาแบบใหม่</h5>
              <p class="rem5">
                จากเดินรูปแบบการสื่อสารจะเป็นลักษณะการที่ผู้ส่งสารจัดทำเนื้อหาสารแล้วส่งไปยังผู้รับสารแล้วรอการตอบกลับ
                แต่สำหรับสื่อดิจิทัลได้สร้างให้เกิดการมีปฎิสัมพันธ์
                (Interactive) รูปแบบใหม่ ด้วยรูปแบบการแบ่งปัน
                การนำเนื้อหามาจัดกระทำใหม่ หรือสร้างขึ้นมาใหม่ (share, mix,
                remix) ทำให้เกิดการการกระจายเนื้อหาไปในวงกว้าง
                นอกจากนี้ยังสามารถมีส่วนร่วมด้วยการเข้าไปแสดงความรู้สึก
                และความคิดเห็นด้วยการกด Like, Comment หรือ Share
                ได้อย่างอิสระเสรี โดยทำให้มีการตอบโต้กันระหว่างผู้ใช้สาร
                และมีเครื่องมือให้ผู้รับสารสามารถเลือกรับข่าวสารในรูปแบบที่ต้องการได้
                (interactivity) และสามารถเชื่อมโยงประเด็นนั้นๆไปสู่ประเด็นอื่น ๆ
                หรือสามารถหาข้อมูลได้ลงลึกมากยิ่งขึ้นผ่านลิงค์ต่างๆ (Hyperlink)
                มีความสามารถในการเชื่อมต่อข้อมูล (hypertextuality)
                รูปแบบการสื่อสารบนโลกออนไลน์จึงเป็นเรื่องของการแบง่ปัน
                การรับฟังและตอบโต้กับผู้อื่นทำให้มีการแลกเปลี่ยนประสบการณ์
                ความรู้ การสร้างความสัมพันธ์
                และการรวบรวมความรู้มาจากแหล่งที่หลากหลาย
                เป็นเครือข่ายทำให้คนสามารถแสดงความเห็นส่งข้อมลูได้อย่างอสิระและก้าวข้ามข้อจำกัดของสื่อดั้งเดิมได้
              </p>
              <p class="rem5">
                ดังนั้น
                ทุกคนบนโลกออนไลน์จะมีโอกาสในการสร้างเนื้อหาแบบใหม่รวมถึงการเข้าไปเป็นส่วนหนึ่งบนสังคมออนไลน์โดยที่อาจจะไม่เคยรู้จักกันมาก่อน
                การมีปฏิสัมพันธ์แบบใหม่จะสร้างให้เกิดเป็นวัฒนธรรมการมีส่วนร่วม
                (Participatory Culture) ของผู้คนบนโลกออนไลน์มากขึ้น
                ผู้รับสารอาจจะกลายเป็นผู้สร้าง และผู้ส่งอาจจะกลายเป็นผู้รับ
                หรือกลายเป็นผู้ติดตาม (Followers)
                หรือเป็นผู้ที่นำเนื้อหาที่ได้มาจัดกระทำขึ้นใหม่
                ข้อมูลที่ส่งผ่านมีปฏิสัมพันธ์เนื้อหาแบบใหม่นี้เองที่จะให้เกิดอิสรภาพในการแสดงความคิดเห็น
                การโต้ตอบ หรือการแสดงความไม่เห็นด้วยกรณีที่เป็นความเห็นต่าง
                ทั้งนี้
                เพราะแพลตฟอร์มดิจิทัลได้เปิดโอกาสให้ทุกคนได้เข้าไปมีส่วนร่วมอย่างเต็มที่
                มีอิสระในการแสดงความคิดเห็น (Freedom of Expression)
                ช่วยสะท้อนมุมมองความเป็นจริงที่เราอาจจะไม่เคยรู้มาก่อน
                และอาจจะนำมาซึ่งการเปลี่ยนแปลงสังคมไปในทิศทางที่ดีขึ้น
                อย่างไรก็ตาม หากผู้ที่ใช้สื่อเป็นผู้ที่ขาดจริยธรรม
                หรือขาดความรับผิดชอบต่อสังคม สิ่งที่อาจจะตามมาคือ
                การนำเสนอข้อมูลข่าวสารหรือการส่งข้อมูลข่าวสารออกไปอย่างผิด ๆ
                หากเป็นกรณีของการใช้สื่อออนไลน์เพื่อกลั่นแกล้งบุคคลอื่นบนโลกออนไลน์
                หรือการบิดเบือนข้อเท็จจริง
                ก็จะส่งผลกระทบอย่างรุนแรงต่อผู้ที่เกี่ยวข้อง
                เพราะการที่คนสามารถเข้ามาแลกเปลี่ยนและมีปฏิสัมพันธ์
                หากไม่ผ่านการกลั่นกรอง การตรวจสอบข้อเท็จจริง
                การใช้กระบวนการคิดมีวิจารณญาณ แต่เน้นอารมณ์
                พื้นที่ออนไลน์ก็จะเต็มไปด้วยเนื้อหาที่เต็มไปด้วยความรุนแรง
                ข่าวลวง หรือการกลั่นแกล้งผู้อื่น
                และเป็นพื้นในการสร้างมลพิษทางการสื่อสารให้กับสังคมได้
              </p>

              <br />
              <h5 class="rem5">
                2.2.3 ช่องทางในการสื่อสาร (Channel) แบบใหม่: Smart Devices
              </h5>
              <p class="rem5">
                ในสมัยอดีดช่องทางที่ใช้ติดต่อสื่อสารอาจจะมีข้อจำกัด เช่น
                หากเป็นโทรศัพท์ก็ใช้เพียงแค่โทรติดต่อสื่อสารอย่างเดียว
                และการฟังจะเป็นฟังจากเครื่องรับวิทยุ
                ส่วนการชมจะใช้เครื่องรับโทรทัศน์หรือภาพยนตร์
                แต่ในยุคดิจิทัลทุกผัสสะการเขียน การอ่าน การฟัง การพูด
                ได้ถูกนำมาหลอมรวมไว้ในการสื่อสารผ่านอุปกรณ์เพียงเครื่องเดียวนั่นคือ
                สมาร์ทโฟน (Smartphone) หรือ อุปกรณ์อัจฉริยะ (Smart Devices)
                ที่สามารถตอบสนองการสื่อสารได้ทุกรูปแบบ
                ช่องทางการสื่อสารแบบใหม่นี้จึงได้เข้ามาทำลายข้อจำกัดในการสื่อสารและทำให้เกิดความสะดวกสบายทางการสื่อสารอย่างที่ไม่เคยเป็นมาก่อน
              </p>

              <br />
              <h5 class="rem5">
                2.2.4 จากเนื้อหาสาร (Messages) ไปสู่ดิจิทัลคอนเทนต์ (Digital
                Content)
              </h5>
              <p class="rem5">
                เนื้อหาสารแบบใหม่เกิดจากการสร้างขึ้นด้วยชุมชน หรือ
                พลเมืองบนโลกออนไลน์
                ซึ่งคนเหล่านั้นอาจจะสร้างเนื้อหาขึ้นมาเพื่อตอบโจทย์กลุ่มเฉพาะ
                หรือสามารถตอบโจทย์ความต้องการของผู้คนบนโลกออนไลน์
                แต่ประเด็นที่สำคัญคือควาพยายามในการการสร้างเนื้อหาที่กระตุ้นให้คนอยากติดตาม
                อยากไปมีส่วนร่วม (Engagement) ซึ่งหมายถึง
                การสร้างให้เกิดความสนใจและความผูกผันต่อเนื้อหานั้นจนกลายเป็นผู้ติดตามอย่างเหนียวแน่น
                และส่งต่อข้อมูล (share) ไปยังคนอื่นๆ
                หรืออาจจัดทำเนื้อหาขึ้นมาใหม่ภายใต้เนื้อหาเดิมเพื่อสร้างให้เกิดความสนใจและเป็นกระแสที่น่าติดตามมากขึ้นบนโลกออนไลน์
                อย่างไรก็ตามมีข้อที่พึงระวัง คือ
                บนโลกออนไลน์มีผู้คนหลากหลายและมีอิสระในการสื่อสาร
                สามารถเป็นผู้ผลิตสื่อและกระจายเนื้อหา
                อาจจะทำให้มิจฉาชีพใช้เป็นช่องทางในการส่งข้อมูลหรือเนื้อหาที่อาจจะเป็นเท็จ
                หรือเนื้อหาที่ทำร้ายหรือทำลายชื่อเสียงผู้อื่น
                และในบางคนอาจจะใช้เป็นพื้นที่ในการส่งเนื้อหาที่เป็นการกระทำผิด
                หรือล่อลวงให้คนหลงเชื่อจนนำไปสู่ความเสียหายได้เช่นกัน
              </p>

              <br />
              <h5 class="rem5">
                2.2.5 จากผู้รับสาร (Receiver) เป็นนักสำรวจ (Discover)
              </h5>
              <p class="rem5">
                สื่อดิจิทัลได้ทำให้ผู้รับสารได้มีพลังมากขึ้น ดังนั้น
                ผู้รับสารกลายมาเป็นผู้ค้นพบข้อมูล (Discover)
                และมีอำนาจในการเลือกเนือหาที่มาตอบความต้องการของตนเองมากที่สุด
                จากการที่เป็นผู้รับสารแบบตั้งรับ (passive audiences)
                กลายมาเป็นผู้ที่รับสารแบบกระตือรือร้น (active users)
                และยังสามารถแนะนำเนื้อหาสารนั้นๆ
                ส่งไปให้ผู้อื่นด้วยการกระจายข้อมูลข่าวารออกไปอย่างไม่สิ้นสุด
                การที่เป็นผู้แนะนำและสามารถส่งได้อย่างไม่สิ้นสุดนี้เอง
                ผู้ใช้สารต้องมีทักษะความคิดวิเคราะห์ในการเลือก
                ข้อมูลข่าวสารที่เป็นประโยชน์และมีความรับผิดชอบสูงมาก
              </p>
              <p class="rem5">
                จากองค์ประกอบทั้งหมดข้างต้น Pricewaterhouse Cooper
                ให้นิยามของการสื่อสารในยุคดิจิทัลไว้ว่า “Life Style Media”
                (2006)
                โดยการสื่อสารในยุคดิจิทัลโดยผู้ใช้สารเป็นผู้ที่เข้ามามีบทบาทสำคัญในการกำหนดเนื้อหาสาร
                ที่มิใช่เป็นเพียงการสื่อสารแบบตั้งรับ (passive)
                แต่กลายเป็นคนที่สามารถเป็นผู้เลือกค้นพบ จัดกระทำ ส่งต่อ
                และกระจายเนื้อหาข่าวสารได้อย่างไม่มีที่สิ้นสุด
                ซึ่งถือเป็นการปรับมุมมองใหม่ของกระบวนการสื่อสารในยุคดิจิทัล
                เทคโนโลยีจะเข้ามาเป็นตัวเชื่อมช่องว่างระหว่างความเป็นมืออาชีพและความสามารถในการสร้างสรรค์เนื้อหาตามความต้องการของผู้รับสาร
                (on demand) ผู้รับสารจะมีความสามารถในการผลิตเนื้อหาได้เอง
                ซึ่งอาจจะกล่าวได้ว่า
                ผู้ใช้สารบนโลกออนไลน์มีอำนาจในการควบคุมเนื้อหา
                มีความสามารถในการผลิตเนื้อหาสารได้เอง
                และมีอำนาจในการเผยแพร่ออกไปอย่างกว้างขวางบนโลกออนไลน์ (social
                network)
                ผ่านช่องทางใหม่คืออุปกรณ์ดิจิทัลที่มีการเชื่อมต่ออินเทอรณ์เน็ตที่สามารถเข้าถึงได้ทุกที่ทุกเวลา
                โดยองค์ประกอบการสื่อสารแบบ Life Style Media (สุจิตรา, 2556)
                แสดงในแผนภูมิด้านล่าง
              </p>
              <br />
              <div class="text-center font-italic">
                <img src="/img/lesson4/2.png" width="80%" />
                <p><br />ภาพที่ 2 แบบจำลอง Lifestyle Media</p>
              </div>
              <br /><br>

              <h3>
                3.ทักษะที่เด็กและเยาวชนยุคใหม่ควรเรียนรู้ในการเป็นพลเมืองยุคดิจิทัล
              </h3><br>
              <p class="rem2">
                เมื่อชีวิตของกลุ่มคนรุ่นใหม่ต้องเข้าไปเกี่ยวข้องกับเทคโนโลยีดิจิทัล
                การเข้าใจและนำหลักการสื่อสารดิจิทัลมาเพื่อปกป้องตนเองจากความเสี่ยงบนโลกออนไลน์
                และสามารถใช้สื่อดิจิทัลให้เกิดประโยชน์สูงสุดจึงสำคัญอย่างยิ่งในการนำมาเสริมสร้างทักษะในการดำเนินชวิตบนโลกดิจิทัลได้อย่างปลอดภัยและมีความสุข
                เมื่อกลางปี พ.ศ. 2559 World Economic Forum ได้จัดทำอินโฟกราฟฟิก
                เรื่องความฉลาดทางดิจิทัล (Digital Intelligence) ซึ่งจัดทำโดย DQ
                Institute เพื่อเสนอทักษะ 8
                ด้านที่เด็กและเยาวชนเรียนรู้เพื่อแสดงให้เห็นถึงทักษะที่เด็กและเยาวชนในยุคดิจิทัลควรเรียนรู้
                ซึ่ง Digital Intelligence หรือ DQ หมายถึงชุดความสามารถทางความรู้
                อารมณ์และสังคมที่ทำให้เด็กสามารถที่จะเผชิญความท้าทายและปรับตัวสู่ชีวิตยุคดิจิทัลได้
                (โสภิดา, 2561) ดังภาพด้านล่าง
              </p>
              <br />
              <div class="text-center font-italic">
                <img src="/img/lesson4/3.jpg" width="100%" />
                <p>
                  <br />ภาพที่ 3
                  ทักษะที่เด็กและเยาวชนยุคใหม่ควรเรียนรู้ในการเป็นพลเมืองในยุคดิจิทัล
                </p>
              </div>
              <br />
              <h4 class="rem2">
                3.1 การสร้างอัตลักษณ์พลเมืองดิจิทัล (Digital Citizen Identity)
              </h4>
              <p class="rem5">
                ความสามารถในการสร้างและบริหารจัดการอัตลักษณ์ทั้งในโลกออนไลน์และออฟไลน์ด้วยความซื่อตรง
                (integrity) การใช้ application
                เพื่อทำให้ภาพที่ออกมาดูดีเป็นเรื่องธรรมดา
                แต่ไม่ควรจะมีการตกแต่งจนกระทั่งบิดเบือนความจริงและนำไปใช้เพื่อการหลอกลวงหรือหวังผลประโยชน์ในทางมิชอบ
                ดังภาพด้านล่าง
              </p>
              <br />
              <div class="text-center font-italic">
                <img src="/img/lesson4/4.png" width="80%" />
                <p><br />ภาพที่ 4 ภาพการสร้างอัตลักษณ์บิดเบือน</p>
              </div>
              <br />
              <p class="rem5">
                ในความเป็นจริงนั้นสิ่งที่เราควรจะเข้าใจคือ
                คนทุกคนล้วนมีความแตกต่างกัน
                แม้แต่ฝาแฝดที่เหมือนกันมากที่สุดก็ยังมีจุดที่แตกต่าง
                และความแตกต่างเหล่านี้เป็นความหลากหลาย (Diversity)
                ที่ควรได้รับการยอมรับ มองเห็นคุณค่า
                อัตลักษณ์ที่โดดเด่นแตกต่างกันไม่ว่าจะเป็น เพศ รูปร่าง สีผิว
                ใบหน้า คุณลักษณะนิสัย เชื้อชาติ ศาสนา ภาษาที่ใช้
                หรือแม้แต่สถานะทางสังคม ฯลฯ มีความงดงามเฉพาะตน
                ซึ่งเราไม่ควรใช้เพียงมาตรฐานเดียวมาเบียดทับหรือลดทอนคุณค่าผู้ที่มีความแตกต่าง
                ในทางตรงกันข้ามผู้ที่ใช้สื่อดิจิทัลอย่างมีวิจารณญาณจะมีโอกาสสูงในการเรียนรู้อยู่ร่วมกับความหลากหลายชาติพันธุ์และมุมมอง
                ซึ่งถือว่าเป็นเรื่องธรรมชาติ ดังนั้น
                การภูมิใจในอัตลักษณ์แห่งตนคือการยอมรับความเป็นตัวตนของตนเองถือเป็นพื้นฐานสำคัญในการมองเห็นคุณค่าตนเอง
                อันจะนำมาซึ่งความมั่นใจในตนเอง
                การสื่อสารตัวตนด้วยความมั่นใจภายใต้เอกลักษณ์ที่แตกต่างนี้เป็นเสน่ห์อย่างหนึ่ง
                ทีทำให้ผู้มองหรือผู้ดูประทับใจ คนที่ลุกขึ้นมากล้าที่จะแตกต่าง
                น่าดูและน่าสนใจ ดังนั้น สิ่งสำคัญคือการยอมรับความแตกต่าง
                การเคารพคุณค่าของความเป็นมนุษย์ที่ไม่จำเป็นต้องเหมือนกัน
                และสื่อสารด้วยการชื่นชมและมองคุณค่าผู้อื่นไม่ใช่การเข้าไปทับถม
                ล้อเล่น
                หรือนำเอาปมด้อยที่สังคมกำหนดมาทำล้อเลียนผ่านสื่อสังคมออนไลน์จนทำให้บุคคลนั้นๆ
                หมดความมั่นใจในอัตลักษณ์แห่งตนเอง
                การมองและยอมรับในความแตกต่างของคนที่ไม่เท่ากัน ไม่เหมือนกัน
                ไม่ใช่ความแปลกแยกแต่คือ ความหลากหลายและเท่าเทียม
                ซึ่งคนที่ได้ชื่อว่าเป็นพลเมืองยุคดิจิทัลจำเป็นจะต้องเข้าใจและสื่อสารในทางบวกเพื่อสร้างนิเวศท์ที่ดีในโลกออนไลน์และออฟไลน์
                ในส่วนของผู้ปลอมแปลงอัตลักษณ์แห่งตนหรือบิดเบือนความจริงเพื่อใช้หลอกผู้อื่นนั้น
                ผู้ใช้สื่อก็ควรรู้เท่าทัน
                ใช้เหตุและผลมาประกอบการพิจารณามากกว่าอารมณ์ความรู้สึก
                การตรวจสอบข้อมูลจากหลากหลายก่อนที่จะหลงเชื่อแล้วต้องตกเป็นเหยื่อ
              </p><br>
              <h4 classs="rem2">
                3.2 การจัดสรรเวลาหน้าจอ (Screen time management)
              </h4>
              <p class="rem5">
                การเป็นพลเมืองยุคดิจิทัลที่คุณภานั้นความสามารถในการบริหารเวลาที่ใช้อุปกรณ์ดิจิทัลในกิจกรรมต่างๆ
                ไม่ว่าจะเป็นโซเชียลมีเดีย การเล่มเกมหรืองานอื่นๆ
                ในแบบที่ควบคุมตนเองได้ถือเป็นเรื่องสำคัญอย่างมาก จากข้อมูลเรื่อง
                การบริหารจัดการเวลาบนโลกดิจิทัล
                โดยสำนักงานกองทุนสนับสนุนการสร้างเสริมสุขภาพหรือ
                สสส.จากการสำรวจพฤตกิรรมผู้ใช้ดิจิทัลทั่วโลกในปี 2561 ของ “We Are
                Social” ดิจิทัลเอเจ็นซี และ “Hootsuite”
                พบว่าประเทศไทยเป็นประเทศที่ใช้เวลาอยู่กับอินเทอร์เน็ต
                (รวมทุกอุปกรณ์) มากที่สุดในโลก โดยเฉลี่ยอยู่ที 98 ชั่วโมง 9
                ชั่วโมง 38 นาทีต่อวัน
                และหากวัดเฉพาะการใช้งานอินเทอร์เน็ตบนสมาร์ทโฟน
                ประเทศไทยยังคงเป็นประเทศที่ใช้เวลาท่องเน็ตต่อวันมากที่สุดในโลกโดยเฉลี่ยอยู่ที่
                4 ชั่วโมง 56 นาที (สุรานนท์, 2563, หน้า 3)
                จึงทำให้เรื่องการบริหารจัดการเวลาหน้าจอเป็นเรื่องสำคัญ
                ทั้งนี้ด้วยลักษณะของสื่อออนไลน์ที่เป็นแบบ anywhere anytime
                ทำให้ผู้ใช้สื่อสามารถจะใช้สื่อดิจิทัลในช่วงเวลาใดหรือที่ไหนก็ได้
                ในความเป็นจริงถือเป็นความท้าทายของพ่อแม่ผู้ปกครองหรือแม้แต่ตัวผู้ใช้สื่อเอง
                ที่จะทำอย่างไรให้สามารถควบคุมตนเองให้สนใจกับกิจกรรมตรงหน้า เช่น
                ในขณะที่เข้าชั้นเรียน
                หรือในขณะที่มีการประชุมโดยไม่ใช้สื่อออนไลน์
                โดยที่ไม่ต้องมีกฏระเบียบมาควบคุม เช่น การกำหนดเวลาในการเล่นเกม
                การยึดโทรศัพท์ในห้องเรียน
                เพราะหากผู้ใช้สามารถรับผิดชอบแยกแยะว่าสิ่งใดควรกระทำหรือไม่ควรกระทำด้วยตนเองจะเกิดผลดีในระยะยาวมากกว่าการถูกควบคุม
                ดังนั้น
                การมีหลักคิดและความรับผิดชอบต่อการใช้สื่อดิจิทัลอย่างเหมาะสม
                และสมดุลจึงมีความสำคัญมาก ทั้งนี้
                การบริหารจัดการเวลาในการใช้สื่อดิจิทัลนั้นเป็นสิ่งสำคัญที่ผู้ใช้จะต้องบริหารเวลาโดยทีไม่มีผลกระทบต่อการดำเนินชีวิตทั้งด้านสุขภาพ
                การเรียน การงาน รวมถึงความสัมพันธ์กับผู้อื่นบนโลกออฟไลน์
                รวมถึงไม่ส่งผลกระทบต่อความรับผิดชอบและมารยาทในการใช้ชีวิตร่วมกับผู้อื่น
                การดำเนินกิจกรรมต่างๆ บนโลกออฟไลน์
                พลเมืองดิจิทัลที่ดีจะต้องมีมรรยาทและความรับผิดชอบต่อการกระทำของตน
                (Digital Etiquette)
                ที่จะเป็นเครื่องมือในการย้ำเตือนสติตลอดจนการกระทำที่เหมาะสมในการสื่อสารทุกประเภท
                การใช้เทคโนโลยีสารสนเทศที่ขาดความเหมาะสมอาจส่งผลเสียต่อสุขภาพโดยรวม
                เช่น
                ความเครียดต่อสุขภาพกายและสุขภาพจิตตลอดจนการก่อให้เกิดการสูญเสียสัมพันธภาพในสังคมได้
              </p>
              <br />
              <h4 classs="rem2">
                3.3 การรับมือกับการรังแกบนโลกไซเบอร์ (Cyberbullying Management)
              </h4>
              <p class="rem5">
                ความสามารถในการรับรู้และรับมือกับการคุกคามบนโลกออนไลน์ได้อย่างชาญฉลาดและมีสติถือเป็นเรื่องสำคัญมาก
                การระรานหรือการรังแกกันบนโลกออนไลน์ คือ
                ความตั้งใจที่จะทำให้ผู้ถูกกระทำได้รับความเสียหาย
                หรือทำให้เกิดความรู้สึกแย่หรือเสียใจ
                จนกระทั่งนำไปสู่การลดทอนการมองเห็นคุณค่าในตนเอง
                โดยการกระทำดังกล่าวต้องเกิดจากความตั้งใจและต่อเนื่องโดยมีเป้าหมายเพื่อทำร้ายหรือทำให้ได้รับผลกระทบในทางลบ
                มีงานวิจัยหลายชิ้นศึกษารูปแบบพฤติกรรมการรังแกกันบนโลกออนไลน์และได้สรุปว่า
                สำหรับพฤติกรรมการรังแกกันบนโลกไซเบอร์แบ่งออกเป็น 5 ประเภท คือ
                การนินทาหรือด่าทอผู้อื่น การแอบอ้างชื่อผู้อื่น
                การนำความลับที่เป็นข้อมูลส่วนตัวของผู้อื่นไปเปิดเผย
                และการลบหรือบล็อกผู้อื่นบนโลกไซเบอร์ซึ่งมีผลมาจากจากการเหยียดในความแตกต่างหรือปมด้อยของบุคคลนั้นๆ
                (Tudkuea and Laeheem, 2014)
                โดยมันจะเกิดขึ้นในพื้นที่สังคมออนไลน์ เช่น เฟสบุ๊ก (Facebook),
                ยูทูป (YouTube), อินสตาแกรม (Instagram), ทวิตเตอร์ (Twitter)
                เป็นต้น ตัวอย่างของการกลั่นแกล้งออนไลน์ เช่น
              </p>
              <p class="rem7">
                • การโพสต์วิดีโอที่น่าอับอายของคนอื่นในบริการฝากวิดีโอ เช่น
                ยูทูบหรือเฟสบุ๊ค
              </p>
              <p class="rem7">
                •
                การส่งข้อความหรืออีเมลที่มีเนื้อหาคุกคามหรือน่ารังเกียจให้กับผู้อื่นอย่างต่อเนื่อง
              </p>
              <p class="rem7">
                •
                การโพสต์เนื้อหาที่คุกคามหรือมุ่งทำให้ผู้อื่นอับอายในโซเชียลมีเดีย
              </p>
              <p class="rem7">
                • การสร้างบัญชีในโซเชียลมีเดียสำหรับล้อเลียนคนอื่นเป็นการเฉพาะ
              </p>
              <p class="rem7">
                • การถ่ายวิดีโอการทำร้ายร่างกายผู้อื่นผ่านมือถือ
                แล้วนำไปแชร์ต่อให้คนได้เห็นซ้ำๆ
              </p>
              <p class="rem7">
                • การโพสต์หรือส่งต่อข้อมูลส่วนบุคคลของผู้อื่นโดยไม่ได้รับอนุญาต
                (โดยเฉพาะภาพที่มีเนื้อหาทางเพศของคนอื่น ดังที่เรียกว่า sexting)
              </p>
              <p class="rem7">• การส่งมัลแวร์ไปทำลายคอมพิวเตอร์ของผู้อื่น</p>

              <p class="rem5">
                ทั้งนี้
                การรับมือต่อสถานการณ์ดังกล่าวมีหลายรูปแบบนับตั้งแต่การดำเนินคดีแก่ผู้กระทำตามพ.ร.บ.คอมพิวเตอร์
                การ block ผู้กระทำ
                ไปจนถึงการเพิกเฉยหรือไม่ให้คุณค่และความสำคัญต่อการกระทำ
                โดยสิ่งแรกที่ต้องทำ คือ
                การตั้งสติเมื่อเผชิญกับสถานการณ์การรังแกกันบนโลกออนไลน์
                และดูระดับความเสียหายของการกระทำที่เกิด
                และจัดการปัญหาให้สอดคล้องกับบริบทของแต่ละคน อย่างไรก็ตาม
                ด้วยลักษณะของสื่อดิจิทัลที่มีความเป็น Anyone ที่ใครๆ
                สามารถเข้ามาใช้สื่อเพื่อคุกคามผู้อื่นรวมถึงอาจจะไม่มีระบุตัวตน
                (anonymous)
                ซึ่งจะทำให้บุคคลที่จะรังแกผู้อื่นสามารถใช้ช่องว่านี้ในการกลั่นแกล้งได้
                เพราะสื่อสังคมออนไลน์สามารถแพร่กระจายข่าวสารได้อย่างรวดเร็วแบบ
                many to many
                ก็ยิ่งทำให้ระดับความรุนแรงของการรังแกเพิ่มมากขึ้นเป็นเท่าทวีคูณ
                ผู้ใช้สื่อจึงมีความจำเป็นที่จะต้องที่มีทักษะในการใช้เทคโนโลยีอย่างมีประสิทธิภาพแล้วจะต้องใฝ่รู้และให้ความสำคัญกับมาตรการเพื่อความปลอดภัยและการคุ้มครองข้อมูลส่วนบุคคลด้วย
                (Digital Security) รู้การสร้างรหัสผ่านที่มีความปลอดภัยและแข็งแรง
                (strong password)
                เพื่อป้องกันปัญหากรณีเกิดการนำข้อมูลเช่นรูปภาพไปใช้เพื่อกลั่นแกล้ง
                การตั้งระบบความปลอดภัยเพื่อคัดเลือกเพื่อนบนโลกออนไลน์
                ด้วยการตั้งค่าความเป็นส่วนตัว (privacy setting)
                เพื่อไม่ให้ข้อมูลถูกเปิดเผยทางอินเทอร์เน็ต
                การศึกษากฎหมายเกี่ยวข้องการใช้สื่อดิจิทัลเช่น พ.ร.บ.คอมพิวเตอร์
                หากการรังแกนั้นเป็นการคุกคามการดำเนินชีวิตและส่งผลกระทบต่อการเรียนหรืออาชีพการงาน
                อาจจะนำเรื่องการถูกคุกคามไปปรึกษาผู้ใหญ่ที่ไว้ใจได้ เช่น
                ผู้ปกครอง หรือครูบาอาจารย์ เพื่อร่วมกันหาทางออกที่เหมาะสมต่อไป
              </p>

              <p class="rem5 font-weight-bold">
                หากต้องเผชิญกับการกลั่นแกล้งออนไลน์ แนวทางในการรับมือมีดังนี้
              </p>
              <p class="rem7">
                • ไม่ตอบโต้หรือคิดแก้แค้น
                เพราะไม่เพียงแต่ทำให้ผู้กลั่นแกล้งได้ใจ
                แต่ยังทำให้เราไม่ต่างจากผู้ที่กลั่นแกล้งเรา
              </p>
              <p class="rem7">
                • ใช้เทคโนโลยีให้เป็นประโยชน์
                บริการในอินเทอร์เน็ตไม่ว่าจะผ่านเว็บไซต์หรือแอปพลิเคชั่น
                อนุญาตให้เราบล็อกคนที่ไม่ต้องการติดต่อได้ ถ้าไม่อยากเห็นข้อความ
                รูปภาพ หรือวิดีโอที่ทำให้คุณรู้สึกแย่
              </p>
              <p class="rem7">
                • ขอความช่วยเหลือ
                ถ้าคุณรู้สึกไม่สบายใจหรือสถานการณ์เลวร้ายลงเรื่อยๆ
                ให้ขอความช่วยเหลือจากคนที่คุณไว้ใจ แต่ถ้าสถานการณ์เลวร้ายมากขึ้น
                คุณควรปรึกษามืออาชีพ
                หรือหากการกลั่นแกล้งรุนแรงไปถึงขั้นทำร้ายร่างกายหรือการคุกคามทางเพศ
                ให้แจ้งตำรวจเพื่อดำเนินคดีกับผู้กระทำ
              </p>
              <p class="rem7">
                • เก็บหลักฐานไว้
                การกลั่นแกล้งในโลกออนไลน์นั้นช่วยให้เราเก็บรวบรวมหลักฐานการกลั่นแกล้งไว้ได้ง่าย
                เช่น การเซฟหน้าจอ เพื่อใช้ในการสืบค้นตัวตนของผู้ที่รังแก
                (กรณีที่ทำโดยไม่เปิดเผย) หรือเป็นหลักฐานในการดำเนินคดี
              </p>
              <p class="rem7">
                • อย่าอยู่เฉยถ้าเห็นผู้อื่นโดนกลั่นแกล้ง ควรให้กำลังใจ
                ให้คำปรึกษาแก่ผู้ที่ถูกรังแกและรายงานเรื่องที่พบเห็นให้ผู้ที่เกี่ยวข้อง
              </p>
              <p class="rem7">
                • รายงานการกลั่นแกล้งออนไลน์ไปยังผู้ให้บริการอินเทอร์เน็ต
                (Internet Service Provider หรือ ISP) หรือผู้ให้บริการมือถือ
                ซึ่งปัจจุบันสื่อโซเชียลมีเดียได้ติดตั้งระบบการรายงานเพื่อลดการใช้สื่อออนไลน์มาเพื่อคุกคามผู้อื่น
                (ความปลอภัยแห่งศตวรรษที่ 21, 2561)
              </p>
              <br />
              <p class="rem5">
                ประการสำคัญที่สุด
                ผู้ที่ถูกกลั่นแกล้งต้องฝึกจิตใจให้เข้มแข็งและเผชิญกับสถานการณ์ที่เกิดขึ้นด้วยสติ
                หากสิ่งที่นำไปเผยแพร่ไม่ใช่ความจริง
                ท่านมีสิทธิ์ในการชี้แจงต่อที่สาธารณะ
                และไม่ควรรู้สึกเสียใจหรือหมดกำลังใจในการดำเนินชีวิต
                การที่ท่านถูกระรานนั้นผู้ที่ผิดคือผู้กระทำ ที่ไม่มีความยั้งคิด
                ขาดวุฒิภาวะ และใช้ความรุนแรงมาแก้ปัญหา
                ซึ่งสะท้อนถึงสภาพพฤติกรรมและจิตใจที่ไม่มีคุณภาพของผู้กระทำ
                ซึ่งคนเหล่านั้นอาจจะมีปัญหาการมองเห็นคุณค่าในตนเองและอยากเห็นคนที่รู้สึกต่ำต้อย
                การขาดการบ่มเพาะให้มีจริยธรรมคุณธรรมที่เหมาะสม
                การขาดความเห็นอกเห็นใจต่อผู้อื่น
                ซึ่งเหล่านี้อาจจะมาจากสภาพแวดล้อม การเลี้ยงดู
                หรือสภาพครอบครัวที่ไม่สร้างพฤติกรรมเชิงบวก
                และพฤติกรรมเหล่านี้ไม่ใช้พฤติกรรมที่น่าชื่นชมหรือควรแก่การยอมรับ
                ดังนั้น ความรับผิดชอบด้วยการรู้คิดและมีจิตสำนึกที่ดี
                ความเห็นอกเห็นใจต่อผู้อื่นจึงเป็นพื้นฐานสำคัญในการลดปัญหารการรังแกและประทุษวาจาบนโลกออนไลน์ได้อีกทางหนึ่ง ...(ต่อ)...
              </p>

              <!-- ---------------------------------->
              <br />
              <br />
              <br />
              <br />
              <div class="container">
                <div class="row">
                  <div class="col-auto mr-auto">
                    <div class="btn-wrapper">
                      <base-button
                        tag="a"
                        target="_blank"
                        rel="noopener noreferrer"
                        class="mb-3 mb-sm-0"
                        outline
                        type="info"
                        icon="fa fa-chevron-left"
                        >Previous</base-button
                      >
                    </div>
                  </div>
                  <div class="col-auto">
                    <router-link to="/lesson4_2" title="Lesson4_2 Page">
                      <div class="btn-wrapper">
                        <base-button
                          tag="a"
                          target="_blank"
                          rel="noopener noreferrer"
                          class="mb-3 mb-sm-0"
                          outline
                          type="info"
                        >
                          Next
                          <i class="fa fa-chevron-right" aria-hidden="true"></i>
                        </base-button>
                      </div>
                    </router-link>
                  </div>
                </div>
              </div>
            </div>
          </div>
        </div>
      </section>

      <!-- Author -->
      <hr />
      <div class="col-lg-center">
        <div class="pt-4 text-center">
          <h5 class="title">
            <span class="d-block mb-1">Author | Dr.Sujttra Kaewseenual</span>
            <small class="h6 text-black"
              >Lecturer in the Digital Communications at Maejo University</small
            >
          </h5>
        </div>
      </div>
      <hr />
    </div>
  </div>
</template>

<script>
import { BCarousel } from "bootstrap-vue/esm/components/carousel/carousel";
import { BCarouselSlide } from "bootstrap-vue/esm/components/carousel/carousel-slide";
export default {
  name: "home",
  components: {
    BCarousel,
    BCarouselSlide,
  },
};
</script>
