<template>
  <div>
    <div class="position-relative">
      <section
        class="fontx section section-lg section-shaped overflow-hidden my-0"
      >
        <div class="shape shape-style-1 shape-default shape-skew">
          <span></span>
          <span></span>
          <span></span>
          <span></span>
          <span></span>
          <span></span>
        </div>
        <br />
        <br />
        <br />
        <br />
        <div class="container py-0 pb-lg">
          <div class="row justify-content-between align-items-center">
            <div class="col-lg-5 mb-5 mb-lg-0">
              <h1 class="text-white font-weight-light display-1">
                Storage and Interface
              </h1>
              <p class="lead text-white mt-4">
                การทำงานในยุกต์ดิจิทัลนั้นคงหลีกเลี่ยงไม่ได้ที่จะต้องทำงานกับข้อมูล
                ไม่ว่าจะเป็นเอกสารที่เป็นตัวอักษรหรือภาพ...
              </p>
            </div>
            <div class="col-lg-6 mb-lg-auto">
              <div
                class="rounded shadow-lg overflow-hidden transform-perspective-right"
              >
                <b-carousel id="carousel1" controls indicators>
                  <!-- Text slides with image -->
                  <b-carousel-slide
                    img-src="img/lesson7/cov.jpg"
                  ></b-carousel-slide>
                </b-carousel>
              </div>
            </div>
          </div>
        </div>
        <br />
        <br />
        <br />
        <br />
        <br />
        <br />
      </section>

      <section class="section section-shaped my-0 overflow-hidden">
        <div class="container pt-lg pb-80">
          <div class="row justify-content-center">
            <div class="fontx col-lg-10">
              <!-- -------------------------------- -->
              <h2 class="display-3 text-center">
                การบันทึก ส่งออก และนำเข้าข้อมูล
              </h2>
              <br /><br />
              <p class="rem2">
                การทำงานในยุกต์ดิจิทัลนั้นคงหลีกเลี่ยงไม่ได้ที่จะต้องทำงานกับข้อมูล
                ไม่ว่าจะเป็นเอกสารที่เป็นตัวอักษรหรือภาพ
                ซึ่งจะต้องมีการปฏิบัติการที่เกี่ยวข้องกับอุปกรณ์พื้นฐานที่ใช้ในการบันทึกข้อมูล
                ส่งออกข้อมูลจากแฟ้มดิจิทัลไปสู่เอกสารที่เป็นกระดาษ
                และการนำเข้าข้อมูลจากเอกสารที่เป็นกระดาษสู่ระบบแฟ้มข้อมูลดิจิทัล
                เนื้อหาในบทนี้จะกล่าวถึงอุปกรณ์เหล่านี้ โดยจะประกอบไปด้วย
                หลักทฤษฎีเบื้องต้น การใช้งานที่ถูกต้อง
                และการเลือกใช้ให้เหมาะสมกับงาน
              </p>
              <br />
              <h4>การบันทึกข้อมูล</h4>
              <p class="rem2">
                การบันทึกข้อมูลคือการคงข้อมูลไว้ในสื่อบันทึกข้อมูล (Storage
                M\medium) โดยข้อมูลนี้จะยังคงอยู่ถาวรโดยไม่ต้องใช้กระแสไฟฟ้า
                ปัจจุบันนี้เทคโนโลยีสื่อบันทึกข้อมูลที่นิยมใช้กันมากก็คือ
                หน่วยความจำแฟลช หรือ แฟลช (Flash Memory)
                ซึ่งใช้เป็นส่วนเก็บข้อมูลถาวรในอุปกรณ์ แฟลชไดรฟ์ โซลิตสเตตไดรฟ์
                เมมโมรี่การ์ด และยังใช้เป็นส่วนเก็บข้อมูลหลักในสมาร์ทโฟนอีกด้วย
              </p>
              <p class="rem2">
                หน่วยความจำแฟลช นั้นถูกพัฒนาขึ้นในปี 1980 โดย โตชิบา (Toshiba)
                เป็นการพัฒนาต่อยอดมาจาก หน่วยความจำแบบอีอีพรอม (EEPROM)
                ซึ่งเป็นหน่วยความจำที่เก็บข้อมูลได้ถาวร
                สามารถลบข้อมูลและเขียนทับได้หลายครั้ง แต่ข้อเสียของอีอีพรอมคือ
                การลบข้อมูลไม่สามารถระบุตำแหน่งได้
                ต้องลบทั้งหมดจึงจะเริ่มเขียนข้อมูลเข้าไปใหม่ได้
                ทำให้ไม่เหมาะสำหรับใช้บันทึกเอกสารที่ต้องมีการแก้ไขและเปลี่ยนแปลงบ่อย
                การใช้งานอีอีพรอมจึงจำกัดอยู่แค่ใช้เก็บเฟิร์มแวร์หรือโปรแกรมเท่านั้น
                ต่อมาโตชิบา
                ได้พัฒนาอีอีพรอมให้สามารถลบหรือแก้ไขข้อมูลเฉพาะตำแหน่งได้
                โดยการแบ่งโครงสร้างออกเป็นส่วนย่อยหลายๆส่วน เรียกว่าเซลล์ (cell)
                การเปลี่ยนแปลงข้อมูลจึงทำในเพียงระดับเซลล์เท่านั้นไม่จำเป็นต้องทำทั้งหมด
                จึงสามารถเขียนข้อมูลได้อย่างรวดเร็วและใช้กับการบันทึกเอกสารและใช้ทำงานที่ต้องมีการเปลี่ยนแปลงข้อมูลบ่อยได้
              </p>
              <br />
              <div class="text-center font-italic col">
                <img src="/img/lesson7/1.png" width="50%" />
                <p><br />รูป 1 โครงสร้างของโฟลทติ้งเกตมอสเฟท</p>
              </div>
              <br />
              <p class="rem2">
                โครงสร้างส่วนบันทึกข้อมูลของแฟลชนั้นถูกสร้างขึ้นมาจาก
                โฟลทติ้งเกตมอสเฟท (Floating-gate MOSFET ) หรือเอฟจีมอส (FGMOS)
                โดยจะประกอบไปด้วยชั้นอ๊อกไซด์ของโลหะ (Metal Oxide)
                กั้นอยู่ระหว่างชั้นของสารกึ่งตัวนำ (semiconductor)
                มีขั้วต่อใช้งานอยู่ 3 จุด คือ
              </p>
              <p class="rem5">1. เดรน (drain) แทนด้วยตัวอักษร D</p>
              <p class="rem5">2. คอนโทรลเกต (control gate) แทนด้วยตัวอักษร G</p>
              <p class="rem5">3. ซอร์ส (source) แทนด้วยตัวอักษร S</p>
              <p class="rem2">
                เอฟจีมอสบันทึกข้อมูลหรือสถานะ “0” หรือ “1”
                ในตัวของมันได้โดยการสะสมประจุไฟฟ้าไว้ที่ชั้นของโฟลทติ้งเกต
                (floating gate) สถานะข้อมูลจะเป็น “0”
                เมื่อไม่มีประจุสะสมอยู่ในโฟลทติ้งเกต และสถานะข้อมูลจะเป็น “1”
                เมื่อมีประจุสะสมอยู่ภายในโฟลทติ้งเกต
                ประจุนี้จะไปเปลี่ยนแปลงคุณสมบัติทางการนำไฟฟ้าของเอฟจีมอส
                หากไม่มีประจุในชั้นโฟลทติ้ง เมื่อจ่ายแรงดันต่ำระหว่าง G และ S
                ก็จะเกิดกระแสไหลจาก S ไปยัง D ได้ แต่หากมีประจุสะสมในโฟลทติ้งเกต
                การจ่ายแรงดันต่ำระหว่าง G และ S จะไม่เพียงพอให้เกิดกระแสไหลจาก S
                ไปยัง D ได้ แต่หากเพิ่มแรงดันให้สูงขึ้น กระแสก็สามารถที่จะไหลจาก
                S ไปยัง D ได้
              </p>
              <p class="rem2">
                การอ่านข้อมูลจากเอฟจีมอสจะใช้วิธีจ่ายแรงดันที่อยู่ระหว่าง
                แรงดันต่ำ และ แรงดันสูง เรียกว่าแรงดันระหว่างกลาง (intermediate
                voltage) ระหว่างขา G และ S ถ้าหากในตัวเอฟจีมอสบันทึกข้อมูล “0”
                เอาไว้ ก็จะมีกระแสไหลออกมาทาง D และถ้าในตัวเอฟจีมอสบันทึกข้อมูล
                “1” เอาไว้ ก็จะไม่มีกระแสไหลออกมาทาง D
              </p>
              <br />
              <div class="text-center font-italic col">
                <img src="/img/lesson7/2.png" width="50%" />
                <p><br />รูป 2 การอ่านข้อมูลที่บันทึกอยู่ภายในเอฟจีมอส</p>
              </div>
              <br />
              <p class="rem2">
                การเขียนข้อมูลลงไปในเอฟจีมอส
                สามารถทำได้โดยอาศัยหลักของอุโมงค์ควอนตัม (quantum tunneling)
                ชั้นอ๊อกไซด์ของโลหะจะมีคุณสมบัติเป็นกำแพงศักดิ์ (The potential
                barrier) กั้นประจุจากชั้นล่างสุดไม่ให้เคลื่อนผ่านตัวมันไปได้
                แต่หากจ่ายพลังงานมากพอก็จะทำให้ประจุ ทะลุผ่าน (Tunneling)
                กำแพงนี้ไปได้
              </p>
              <p class="rem2">
                ในการบันทึก “1” ลงไปในเอฟจีมอส กระทำโดยป้อนแรงดันสูง + ระหว่าง G
                และ S
                ประจุจะทะลุผ่านชั้นอ๊อกไซด์ของโลหะเข้าไปสะสมอยู่ในชั้นโฟลทติ้งเกต
                ถึงแม้จะหยุดป้อนแรงดันแล้ว
                แต่ประจุจะยังคงอยู่ในชั้นโฟลทติ้งเกตได้นานจนสิ้นอายุขัยของเอฟจีมอส
                (ประมาณ 1,000 ปี)
              </p>
              <p class="rem2">
                การเปลี่ยนข้อมูลจาก “1” ไปเป็น “0” กระทำโดยป้อนแรงกันสูง –
                ระหว่าง G และ S แรงดัน –
                จะไปดันประจุในชั้นโฟลทติ้งเกตให้เคลื่อนทะลุลงมายังชั้นล่างสุด
                จึงไม่เหลือประจุสะสมอยู่ในโฟลทติ้งเกต
              </p>
              <br />
              <div class="text-center font-italic col">
                <img src="/img/lesson7/f1.png" width="50%" />
                <p><br />Figure 1 การบันทึกและลบข้อมูลในเอฟจีมอส</p>
              </div>
              <br />
              <p class="rem2">
                ถ้าแม้ว่าประจุที่อยู่ในเอฟจีมอสจะคงอยู่ได้ยาวนานหลายปี
                แต่จุดอ่อนของเอฟจีมอสคือทุกครั้งที่มีการเปลี่ยนข้อมูลจาก “1”
                เป็น “0” จะเกิดการสึกหรอขึ้นที่ชั้นของอ๊อกไซด์โลหะ
                จึงส่งผลจำนวนรอบของการเขียนและลบนั้นมีค่าจำกัดอยู่ที่ประมาณ
                100,000 ครั้ง
              </p>
              <p class="rem2">
                ตัวอย่างที่กล่าวมานั้นเป็นเอฟจีมอสเพียง 1
                ตัวซึ่งใช้บันทึกข้อมูลได้เพียง 1 บิตเท่านั้น
                เพื่อให้สามารถมีความจุมากพอที่จะบันทึกเอกสาร หรือภาพดิจิทัลได้
                จะต้องนำเอาเอฟจีมอสจำนวนมหาศาล มาเชื่อมต่อกันให้มีบริมาณมากพอ
                แล้วทำการเชื่อมสายสัญญาณควบคุมของแต่ละบิตออกมาเพื่อใช้ในการอ่าน
                และบันทึกข้อมูลในแต่ละบิตอีกด้วย
                โดยการเชื่อมต่อเอฟจีมอสเข้าได้กัน นิยมทำใน 2 รูปแบบคือ แบบนอร์
                (NOR) และแบบ แนน (NAND)
              </p>
              <p class="rem2">
                นอร์ หรือ นอร์แฟลช เป็นการเชื่อมเอฟจีมอสเข้าด้วยกันแบบขนาน
                ซึ่งการเชื่อมแบบนี้มีลักษณะการเชื่อมที่เหมือนกับ วงจรนอร์เกต
                (NOR GATE) จึงเรียกชื่อว่านอร์แฟลช
                การเชื่อมต่อแบบนี้จะมีการเชื่อมสายสัญญาณควบคุมทุกตัว
                ในการอ่านและเขียนข้อมูล การอ่านและเขียนจึงทำได้เร็ว
                แต่มีข้อเสียคือต้องใช้สายเชื่อมจำนวนมาก
                จึงส่งผลให้พื้นที่ของซิลิคอนส่วนมากจะใช้ไปกับสายเชื่อมต่อ
                ทำให้นอร์แฟลชมีความจุน้อย และราคาแพง
                จึงนิยมใช้ในอุปกรณ์ที่ต้องการเข้าถึงข้อมูลด้วยความเร็วสูงเท่านั้น
              </p>
              <p class="rem2">
                แนน หรือ แนนแฟลช เป็นการเชื่อมต่อเอฟจีมอสเข้าด้วยกันแบบอนุกรม
                มีลักษณะการเชื่อมเหมือนกับวงจรแนนเกต (NAND GATE)
                จึงเรียกชื่อว่าแนนแฟลช
                การเชื่อมต่อแบบแนนจะนำเอาเอฟจีมอสมาต่ออนุกรมกันเป็นเส้นยาว
                และทำการเชื่อมสัญญาณควบคุมเฉพาะตัวแรกและตัวสุดท้ายของเส้นเท่านั้น
                ทำให้ใช้เส้นเชื่อมน้อย
                แต่แลกมากับการอ่านและเขียนจะทำทีละตัวไม่ได้
                แต่ต้องทำกับทุกตัวที่อยู่ในเส้นเดียวกัน หรือใสเซลล์เดียวกัน
                แนนแฟลชจึงมีความเร็วในการอ่านและเขียนข้อมูลที่ช้ากว่านอร์แฟลช
                แต่จะมีความจุที่สูงกว่าและมีราคาที่ถูกกว่า
              </p>
              <p class="rem2">
                อย่างไรก็ตามในการผลิตจะมีการรวมเอฟจีมอสเป็นกลุ่ม เรียกว่าเซลล์
                (cell) โดยการอ่านและเขียน จะต้องกระทำทีละเซลล์
                โดยขนาดของเซลล์จะมีผลกับประสิทธิภาพการทำงาน
              </p>
              <p class="rem2">
                ถ้ากำหนดให้เซลล์ที่มีขนาดเล็ก จะต้องใช้สายสัญญาณจำนวนมาก
                ทำให้แฟลชมีความจุน้อย แต่อ่านเขียนได้เร็ว และอายุการใช้งานยาวนาน
                เพราะการลบหรือเขียนข้อมูลที่ไม่จำเป็นเกิดได้น้อย
              </p>
              <p class="rem2">
                การกำหนดให้เซลล์มีขนาดใหญ่ จะใช้สายสัญญาณจำนวนน้อย
                ทำให้แฟลชมีความจุมาก แต่การอ่านเขียนจะช้า
                และอายุการใช้งานจะสั้นลง
                การแก้ไขข้อมูลในตำแหน่งที่ต้องการไม่สามารถทำได้โดยตรงหากมีการแก้ไข
                จะต้องทำทั้งเซลล์
                จึงส่งผลให้เกิดการลบหรือเขียนข้อมูลที่ไม่จำเป็นขึ้นมาก
              </p>
              <p class="rem2">
                ปัจจุบันมีแฟลชที่วางจำหน่ายอยู่ 3 รูปแบบคือ 1 บิตต่อเซลล์
                (Single-Level-Cell: SLC) 2 บิตต่อเซลล์ (Multi-Level Cell : MLC)
                3 บิตต่อเซลล์ (Triple-Level Cell: TLC) และ 4 บิตต่อเซลล์
                (Quadruple-Level Cell)
                ซึ่งเซลล์แต่ละแบบจะมีอายุการใช้งานที่แตกต่างกัน
              </p>
              <p class="rem5">
                SLC จะมีรอบของการเขียนข้อมูลอยู่ประมาณ 100,000 ครั้ง
              </p>
              <p class="rem5">
                MLC จะมีรอบของการเขียนข้อมูลอยู่ประมาณ 5,000 – 3,000 ครั้ง
              </p>
              <p class="rem5">
                TLC จะมีรอบของการเขียนข้อมูลอยู่ประมาณ 1,000 ครั้ง
              </p>
              <p class="rem5">
                QLC จะมีรอบของการเขียนข้อมูลอยู่ประมาณ 100 ครั้ง
              </p>
              <p class="rem2">
                ในการใช้งาน จะต้องนำหน่วยความจำแฟลชมาเชื่อมต่อกับส่วนควบคุม
                เพื่อให้เชื่อมต่อกับเครื่องคอมพิวเตอร์ได้
                ส่วนควบคุมนี้จะแตกต่างกันไปตามลักษณะการใช้งาน
              </p>
              <br />
              <div class="text-center font-italic col">
                <img src="/img/lesson7/f2.png" width="50%" />
                <p><br />Figure 2 การใช้งานหน่วยความจำแฟลช</p>
              </div>
              <br />
              <br />
              <h4>ยูเอสบีแฟลชไดรฟ์ (USB Flash Drive)</h4>
              <p class="rem2">
                ยูเอสบีแฟลชไดรฟ์
                เป็นอุปกรณ์บันทึกข้อมูลที่มีพื้นฐานมาจากหน่วยความจำแฟลช
                โดยมีส่วนควบคุมทำหน้าที่สื่อสารกับเครื่องคอมพิวเตอร์
                โดยการเชื่อมต่อจะเป็นแบบอุปกรณ์ยูเอสบี (USB Device)
                มีความจุตั้งแต่ 8GB จนถึง 1 TB สามารถเก็บข้อมูลได้ยาวนานถึง 100
                ปี
                และมีรอบของการลบและเขียนข้อมูลขึ้นอยู่กับชนิดของเซลล์ที่ใช้ในการบันทึกข้อมูล
                ส่วนควบคุมถูกออกแบบมาให้ทำงานกับการอ่านเขียนแบบเชิงลำดับ
                (Sequential Read /Write) จึงเหมาะกับการใช้สำรองข้อมูล
                เก็บข้อมูลถาวร หรือใช้ในการเคลื่อนย้ายข้อมูลระหว่างเครื่อง
                ไม่เหมาะกับงานที่มีการอ่านเขียนแบบสุ่ม
                ตัวอย่างเช่นการตัดต่อวิดิทัศน์ที่ต้องอ่านข้อมูลตำแหน่งที่อยู่ห่างๆกัน
                หรือใช้สำหรับการติดตั้งโปรแกรม
                เนื่องจากการอ่านข้อมูลแบบนี้จะทำได้ช้า
              </p>
              <br />
              <div class="text-center font-italic col">
                <img src="/img/lesson7/3.png" width="50%" />
                <p><br />รูป 3 ตัวอย่างยูเอสบีแฟลชไดรฟ</p>
              </div>
              <br />
              <p class="rem2">
                การใช้งานสามารถเชื่อมต่อกับพอร์ทยูเอสบีได้โดยตรง
                เนื่องจากระบบปฏิบัติการสมัยใหม่ จะมีไดรเวอร์ติดรวมมาให้อยู่แล้ว
                ยูเอสบีในส่วนของโฮสต์ (Host USB) หรือฝั่งของคอมพิวเตอร์จะมีอยู่
                2 แบบคือยูเอสบีรุ่น 2.0 มักจะมีสีดำ และรุ่น 3.0
                ซึ่งมักจะมีสีน้ำเงิน เพื่อให้การเชื่อมต่อมีประสิทธิภาพสูงสุด
                ผู้ใช้ควรเลือกใช้ให้ตรงกับรุ่นยูเอสบีของแฟลชไดรฟ์
                ตัวอย่างเช่นหากแฟรชไดรฟ์มีการเชื่อมต่อแบบยูเอสบี 3.0
                ก็ให้เชื่อมกับคอมพิวเตอร์ทางช่องสีฟ้า แต่หากไม่สามารถทำได้
                ก็สามารถเชื่อมกับช่องสีดำได้เช่นกัน
                แต่ความเร็วในการอ่านและเขียนข้อมูลจะลดลง
              </p>
              <br />
              <div class="text-center font-italic col">
                <img src="/img/lesson7/4.png" width="50%" />
                <p><br />รูป 4 ยูเอสบีรุ่น 3.0 และยูเอสบีรุ่น 2.0</p>
              </div>
              <br />
              <p class="rem2">
                สมาร์ทโฟนที่รองรับยูเอสบีโอทีจี
                ก็สามารถจะเชื่อมต่อกับแฟลชไดรฟ์ได้เช่นกัน
                แต่ต้องเชื่อมต่อผ่านอุปกรณ์เสริมยูเอสบีโอทีจีอะแดปเตอร์
                (USB-on-the-go: OTG) เพื่อแปลงพอร์ทยูเอสบีแบบมินิ
                ให้เป็นยูเอสบีแบบชนิดเอ (type A)
              </p>
              <br />
              <div class="text-center font-italic col">
                <img src="/img/lesson7/5.png" width="50%" />
                <p><br />รูป 5 อุปกรณ์เสริมยูเอสบีโอทีจีอะแดปเตอร์</p>
              </div>
              <p class="rem2">
                เนื่องจากแฟลชไดรฟ์ถูกออกแบบมาสำหรับการเข้าถึงข้อมูลแบบเชิงลำดับดังนั้นในการอ่านหรือเขียนแฟ้มข้อมูล
                ดังนั้นจึงไม่ควรอ่านหรือเขียนแฟ้มข้อมูลพร้อม ๆกัน
                หากขณะนั้นมีการอ่านหรือเขียนข้อมูลอยู่
                ให้ผู้ใช้รอจนกว่างานก่อนหน้าจะเสร็จ
                จึงเริ่มการอ่านหรือเขียนแฟ้มข้อมูลชุดใหม่
              </p>
              <p class="rem2">
                แฟลชไดรฟ์เป็นอุปกรณ์บันทึกข้อมูลที่มีขนาดเล็ก
                สามารถพกพาไปได้ทุกที มีความทนทานสูง ตัวแฟลชไดรฟ์เองไม่กันน้ำ
                แต่ถ้าเปียกน้ำแล้วทิ้งไว้จนแห้งสนิทก็สามารถนำกลับมาใช้งานได้
                นอกจากนั้นยังทนทานต่อการร่วงหล่นจากที่สูงอีกด้วย
                แต่อย่างไรก็ตามเนื่องจากแฟลชไดรฟ์มีขนาดเล็ก
                จึงสามารถหล่นหายหายได้ง่าย
                นอกจากนั้นผู้ใช้งานควรระวังการลืมเสียบทิ้งไว้บนเครื่องคอมพิวเตอร์สาธารณะ
                เนื่องจากแฟลชไดรฟ์ไม่มีระบบรักษาความปลอดภัยของข้อมูลดังนั้นผู้ที่ได้ไปจึงสามารถเข้าถึงข้อมูลได้หมด
                ดังนั้นหากข้อมูลมีความสำคัญ
                ก็ควรตั้งรหัสป้องกันการเข้าถึงไว้อีกชั้น
                ตัวอย่างเช่นการบันทึกเอกสารของไมโครซอฟต์ออฟฟิต
                ควรกำหนดรหัสผ่านสำหรับเปิดแฟ้มและแก้ไขแฟ้มข้อมูลเอาไว้ด้วย
              </p>
              <p class="rem2">
                หากพบแฟลชไดรฟ์ที่ไม่รู้ที่มาที่ไปถูกวางทิ้งไว้
                ก็ไม่ควรเสี่ยงนำเข้าสู่ระบบคอมพิวเตอร์ เนื่องจากอาจมีไวรัส
                หรือซอฟต์แวร์ที่เป็นอันตรายต่อระบบคอมพิวเตอร์อยู่ภายใน
                นอกจากนั้นยังมีอุปกรณ์ยูเอสบีสำหรับทำลายเครื่องคอมพิวเตอร์ (usb
                killer) ที่มีรูปร่างเหมือนกับแฟลชไดรฟ์
                ซึ่งภายในมีวงจรสร้างไฟฟ้าแรงดันสูง
                แฮ๊กเกอร์มักวางอุปกรณ์นี้ทิ้งไว้ตามที่สาธารณะ
                หากมีผู้หยิบไปต่อเข้ากับเครื่องคอมพิวเตอร์ก็จะทำให้เครื่องคอมพิวเตอร์เสียหายทันที
              </p>
              <br />
              <div class="text-center font-italic col">
                <img src="/img/lesson7/6.png" width="50%" />
                <p><br />รูป 6 ตัวอย่าง USB Killer</p>
              </div>
              <!-- ---------------------------------->
              <br />
              <br />
              <br />
              <br />
              <div class="container">
                <div class="row">
                  <div class="col-auto mr-auto">
                    <router-link to="/lesson6_1" title="Lesson6_1 Page">
                      <div class="btn-wrapper">
                        <base-button
                          tag="a"
                          target="_blank"
                          rel="noopener noreferrer"
                          class="mb-3 mb-sm-0"
                          outline
                          type="info"
                          icon="fa fa-chevron-left"
                          >Previous</base-button
                        >
                      </div>
                    </router-link>
                  </div>
                  <div class="col-auto">
                    <router-link to="/lesson7_2" title="Lesson7_2 Page">
                      <div class="btn-wrapper">
                        <base-button
                          tag="a"
                          target="_blank"
                          rel="noopener noreferrer"
                          class="mb-3 mb-sm-0"
                          outline
                          type="info"
                        >
                          Next
                          <i class="fa fa-chevron-right" aria-hidden="true"></i>
                        </base-button>
                      </div>
                    </router-link>
                  </div>
                </div>
              </div>
              <div class="text-center mt-5">Page 1/3</div>
            </div>
          </div>
        </div>
      </section>

      <!-- Author -->
      <hr />
      <div class="col-lg-center">
        <div class="pt-4 text-center">
          <h5 class="title">
            <span class="d-block mb-1">Author | Dr. Paween Khoenkaw</span>
            <small class="h6 text-black">Lecturer in the Computer Science Division at Maejo
              University</small>
          </h5>
        </div>
      </div>
      <hr />
    </div>
  </div>
</template>

<script>
import { BCarousel } from "bootstrap-vue/esm/components/carousel/carousel";
import { BCarouselSlide } from "bootstrap-vue/esm/components/carousel/carousel-slide";
export default {
  name: "home",
  components: {
    BCarousel,
    BCarouselSlide,
  },
};
</script>
