<template>
  <div>
    <div class="position-relative">
      <section class="section-shaped my-0">
        <div class="shape shape-style-1 shape-default">
          <span></span>
          <span></span>
          <span></span>
          <span></span>
          <span></span>
          <span></span>
          <span></span>
          <span></span>
          <span></span>
        </div>

        <div class="container shape-container d-flex">
          <div class="col px-0"></div>
        </div>
      </section>

      <section class="section section-shaped my-0 overflow-hidden">
        <div class="container pt-lg pb-80">
          <div class="row justify-content-center">
            <div class="fontx col-lg-10">
              <!-- -------------------------------- -->
              <h4>ผลกระทบด้านจริยธรรมและสังคมของระบบสารสนเทศ</h4>
              <p class="rem2 text-justify">
                ระบบข้อมูลสารสนเทศนั้น
                จำเป็นอย่างยิ่งที่จะต้องมีการดูแลรักษาความปลอดภัยของข้อมูล
                รวมทั้งสภาพแวดล้อมที่เกี่ยวข้องด้วย
                แผนกสารสนเทศเพื่อการจัดการมีนโยบายที่แน่นอนในการจัดการข้อมูลให้เกิดความปลอดภัย
                ใช้อย่างถูกต้อง และเป็นประโยชน์
                ซึ่งเราจะกล่าวถึงรายละเอียดในบทนี้
                จริยธรรมก็เป็นสิ่งสำคัญของผู้ที่ทำงานและผู้ที่เกี่ยวข้องกันเทคโนโลยีสารสนเทศ
                ซึ่งถือว่าเป็นสิ่งที่ต้องตระหนักไว้และให้ความสำคัญ
              </p>
              <br />
              <h4>
                ความเข้าใจประเด็นด้านจริยธรรมและด้านสังคมที่เกี่ยวข้องกับระบบสารสนเทศ
              </h4>
              <p class="rem2 text-justify">
                จริยธรรม (Ethics) หมายถึง
                ความถูกต้องหรือไม่ถูกต้องที่เป็นตัวแทนศีลธรรมที่เป็นอิสระในการเลือกที่จะชักนำพฤติกรรมบุคคล
                เนื่องจากเทคโนโลยีสารสนเทศ [Information Technology (IT)]
                และระบบสารสนเทศ [Information Systems (IS)]
                ทำให้เกิดปัญหาความแตกต่างกันระหว่างบุคคลและสังคม
                เพราะทั้งสองสิ่งนี้ทำให้เกิดการเปลี่ยนแปลงทางด้านสังคม
                ในบางครั้งการเปลี่ยนแปลงทางด้านสังคมนำมาซึ่งสิ่งที่เรียกว่าความรับผิดชอบต่อสังคม
                แต่อย่างไรก็ตามการใช้เทคโนโลยีสารสนเทศ (IT) ใหม่ ๆ
                สามารถทำให้เกิดการกระจายอำนาจให้องค์การการบุกรุกสิทธิส่วนบุคคลขอผู้อื่นหรือของคู่แข่งขัน
                การตกงาน การประกอบอาชญากรรมข้อมูล ตลอดจนการเกิดนวัตกรรมใหม่ ๆ
                เป็นต้น
              </p>
              <p class="rem2 text-justify">
                เทคโนโลยีสารสนเทศ [Information Technology (IT)
                ทำให้เกิดการเปลี่ยนแปลงทางสังคม เทคโนโลยีสารสนเทศ (IT)
                มีอิทธิพลอย่างมากในเรื่องการกระจายอำนาจ ทรัพย์สิน สิทธิ
                และความรับผิด (Obligation) การพัฒนาเทคโนโลยีสารสนเทศ (IT)
                ทำให้เกิดผู้แพ้ ผู้ชนะ ผู้ได้ประโยชน์
                จากภาวะเช่นนี้ทำให้เกิดการกระทำที่เป็นความรับผิดชอบด้านจริยธรรมและด้านสังคมขึ้น
              </p>
              <br />
              <h4>ข้อควรพิจารณาเกี่ยวกับจริยธรรมของผู้ใช้คอมพิวเตอร์</h4>
              <p class="rem2 text-justify">
                การพิจารณาถึงจริยธรรมของผู้ใช้คอมพิวเตอร์ (Ethical
                considerations)
                จริยธรรมของนักคอมพิวเตอร์หรือผู้ใช้คอมพิวเตอร์ทั้งหลายนั้นจะเป็นเรื่องเกี่ยวกับความชอบธรรม
                เพราะคนเราย่อมรู้ว่าอะไรผิดอะไรถูกหาก
                ไม่มีความเที่ยงธรรมหรือซึ่งสัตย์ในเรื่องของข้อมูลข่าววารแล้วย่อมล่อแหลมต่อความเสียหายในองค์กรมีตัวอย่าง
                เช่น
                พนักงานในองค์กรได้ขายข้อมูลสำคัญของบริษัทโดยที่เขาไม่ได้คำนึงหรือรับรู้ถึงลำดับชั้นความลับข้อมูลขององค์กร
                และก็ไม่ได้คิดที่จะปกป้องข้อมูลขององค์กร
                จำเป็นอย่างยิ่งที่พนักงานคนดังกล่าวจะต้องมีจิตสำนึกในเรื่องการรักษาข้อมูลขององค์กรที่ตนสังกัดอยู่
                ด้วยเหตุนี้จริยธรรมของผู้ใช้คอมพิวเตอร์จึงมีความสำคัญ
                แต่ทั้งนี้ไม่ได้หมายความว่าคนที่ไม่มีจริยธรรมทั้งหมดจะต้องทำผิดกฎเกณฑ์การใช้ข้อมูลเสมอไป
                ลองพิจารณาดูตัวอย่างดังต่อไปนี้ประกอบ
              </p>
              <p class="rem5">
                (1)
                ผู้ใช้ทรัพยากรข้อมูลคอมพิวเตอร์ไม่จำเป็นต้องก่ออาชญากรรมข้อมูลเสมอไป
                ในประเด็นนี้มีคำถามเสมอว่าผู้ใช้มีจริยธรรมมากน้อยแค่ไหน เช่น
                ใครบางคนใช้ซอฟต์แวร์โดยที่ตัวเองไม่ได้เป็นเจ้าของ
                คือเดียงแต่ลองใช้ดูก่อนที่จะซื้อเท่านั้น
                ในขณะที่ผู้ขายไม่ต้องที่จะให้ใครลองใช้ก่อนซื้อ เป็นต้น
              </p>
              <p class="rem5">
                (2)
                การที่นักศึกษาได้ลองเข้าไปดูข้อมูลบางอย่างในระบบคอมพิวเตอร์ขนาดใหญ่
                (Mainframe) ของมหาวิทยาลัยโดยไม่ได้ตั้งใจ
                และไม่ได้คิดที่จะขโมยข้อมูลใด ๆ
                ในลักษณะนี้อาจจะถือได้ว่าเป็นการขาดจริยธรรมการใช้ข้อมูลใช่หรือไม่
              </p>
              <p class="rem5">
                (3) ซอฟต์แวร์ระบบใหม่ที่ผลิตขึ้นโดยบริษัทใด ฟ
                แต่ทำไม่สมบูรณ์ไม่อาจทดสอบและส่งมอบให้ได้ภายในเวลาที่สัญญาไว้
                หรือส่งให้ได้แต่มีข้อผิดพลาด
                การที่ผู้พัฒนาผลิตซอฟต์แวร์ได้รุ่นที่ไม่สมบูรณ์เช่นนี้จำเป็นต้องบอกลูกค้าให้ชัดเจนใช้หรือไม่
              </p>
              <br />
              <h4>
                ความสัมพันธ์ระหว่างคอมพิวเตอร์และปัญหาด้านจริยธรรม
                (Computer-related ethical issues)
              </h4>
              <p class="rem2">สิ่งที่ต้องคำนึงถึงและถือว่าเป็นมิติของจรรยาบรรณสำหรับผู้ทำงานกับระบบข้อมูลข่าวสารสามารถแบ่งออกได้เป็น 4 ส่วนด้วยกัน คือ</p>
              <p class="rem2">
                1. ความเป็นส่วนตัว (Privacy)
                เป็นความเกี่ยวข้องกับการรวบรวมและใช้ข้อมูลสำหรับส่วนบุคคล และ
                เก็บไว้ในระบบคอมพิวเตอร์
                โดยทังไปชาวอเมริกันถือว่าในเรื่อสิทธิ์ความเป็นส่วนตัวมาก
                โดยเฉพาะข้อมูลข่าวสารต่าง ๆ
                หากไม่ได้รับอนุญาตแล้วจะเข้ามาสังเกตและเรียกใช้ข้อมูลไม่ได้
                ทรัพยากรข้อมูลที่มีอยู่ถือว่าเป็นความลับส่วนบุคคลทีเดี่ยวซึ่งตรงกันข้ามกับวัฒนธรรมของชาวญี่ปุ่นจะให้ความสำคัญในเรื่องนี้น้อยกว่าชาวอเมริกันมาก
              </p>
              <p class="rem2">
                2. ความถูกต้อง (Accuracy)
                การทำงานในองค์กรนั้นขึ้นอยู่กับข้อมูลข่าวสารเป็นสำคัญ
                การเก็บฐานข้อมูลไว้ในรูปข้อมูลอิเล็กทรอนิกส์นั้นอาจมีข้อผิดพลาดได้
                อาจจะเก็บรวบรวมข้อมุมูลที่ไม่ถูกดต้อง
                หรือมีการแอบเข้ามาแก้ไขข้อมูลที่ถูกต้องก็ได้
              </p>
              <p class="rem2">
                3. ความเป็นเจ้าของ (Property)
                เนื่องจากในปัจจุบันข้อมูลอิเล็กทรอนิกส์สามารถแพร่กระจายไปได้ในรูปของสื่อสารแบบต่าง
                ๆ
                สิทธิ์ในการเป็นเจ้าของข้อมูลและโปรแกรมอย่างถูกต้องนั้นยังเป็นคำถามที่ยาต่อการตอบในเชิงจริยธรรมเป็นอย่างยิ่ง
                กฎหมายทรัพย์สินทางปัญญาได้มีผลคุ้มครองต่อความถูกต้องของวิชาชีพและนักเขียนโปรแกรมคอมพิวเตอร์
                ถึงแม้ว่าทรัพย์สินทางปัญญาของเขาจะมีลักษณะแตกต่างจากทรัพย์สินชนิดอื่น
                ๆ เช่น บ้าน รถยนต์
                อย่างไรก็ตามการพิจารณาในเรื่องข้อมูลข่าวสารและองค์ความรู้มักเป็นเรื่องที่ชี้ชัดให้เกิดความกระจ่างได้ยาก
              </p>
              <p class="rem2">
                4. การเข้าถึงข้อมูล (Access)
                ธรรมชาติขิงผู้ใช้ในการเข้าถึงข้อมูลหรือใช้ข้อมูลนั้น
                จะพิจารณาถึงความสามารถที่ใช้คือเอาข้อมูลจากฐานข้อมูลขององค์กรมาใช้ได้อย่างเหมาะสมซึ่งข้อมูลจะถูกจัดลำดับความสำคัญไว้ในระดับที่แตกต่างกันไป
                ข้อมูลที่มีอิทธิพลต่อการแข่งขันจำเป็นต้องใช้รหัสพิเศษก่อนที่ผู้ใช้จะมีสิทธิใช้งาน
                และ สามารถใช้ได้อย่างจำกัดดังตัวอย่าง
                บริษัทที่มีประวัติข้อมูลลูกค้าทั้งในอดีตและปัจจุบัน
                เจ้าของบริษัทสามารถเปลี่ยนแปลงข้อมูลของลูกค้าเหล่านั้นหรือไม่
                และบริษัทดังกล่าวจะขายรายชื่อลูกค้าพร้อมกับรายละเอียดส่วนตัวให้กับบริษัทอื่นได้หรือไม่
                คำถามเหล่านี้ล้วนเกี่ยวข้องกับจริยธรรมของผู้ครอบครองข้อมูลทั้งสิ้น
              </p>
              <br />
              <h4>
                แนวทางทั่วไปสำหรับการเผชิญกับการแก้ปัญหาทางด้านจริยธรรมข้อมูล
                (General guidelines for resolving ethical dilemmas)
              </h4>
              <p class="rem2">
                ในเรื่องของจริยธรรมของผู้ใช้งานในระบบคอมพิวเตอร์นั้นยังไม่ได้มีการกำหนดไว้
                แน่นนอนตายตัวว่ามีอะไรบ้าง
                หากแต่ผู้ใช้และนักวิชาชีพคอมพิวเตอร์ต้องตระหนักและมีจิตสำนึก
                ตลอดจนหยั่งรู้ถึงความรับผิดชอบต่อการใช้ข้อมูลอย่างเหมาะสม
                อย่างไรก็ตามเราสามารถรวบรวมแนวทางทั่วไปด้านจริยธรรมเมื่อเผชิญกับปัญหาในด้านการใช้ข้อมูลสารสนเทศได้ดังนี้
              </p>
              <p class="rem5">
                (1) การกระทำใด ๆ
                ของเราเกี่ยวกับข้อมูลนี้ได้มีการพิจารณาไตร่ตรองรอบคอบและไม่ขัดต่อกำหลักที่ว่า
                “เราดูแลเอาใจใส่ปฏิบัติต่อคนอื่นเหมือนที่เราต้องการให้เขาปฏิบัติต่อเรา”
                หรือไม่
              </p>
              <p class="rem5">
                (2)
                พิจารณาถึงกลุ่มบุคคลที่จะได้ประโยชน์จากการกระทำของเราเป็นต้นว่าเป็นบุคคลกลุ่มใหญ่บุคคลกลุ่มน้อยหรือได้รับประโยชน์เฉพาะตัวเราเท่านั้น
              </p>
              <p class="rem5">
                (3) การมีนโยบายบริหารและจัดการข้อมูลอย่างคงเส้นคงวาของบริษัท
                ไม่ว่าจะโดยทางตรงหรือทางอ้อมก็ตาม
                ต้องยืดไว้ซึ่งความถูกต้องและยุติธรรม รวมทั้งการไม่รับสินบนใด ๆ
                จากบริษัทผู้ขาย
              </p>
              <p class="rem5">
                (4) การกระทำใด ๆ
                ของบริษัทขัดแย้งกับจริยธรรมของการเขียนรหัสหรือไม่
                แบบจำลองที่แสดงเกี่ยวกับประเด็นด้านจริยธรรม สังคม และการเมือง (A
                model for thinking about ethical. Social, and political issues)
                ทั้งสามประเด็นนี้จะมีความสัมพันธ์กันอย่างมาก
                ภาวะที่คับขันทางด้านจริยธรรมเป็นสิ่งที่ผู้จัดการทุกคนต้องเผชิญ
              </p>
              <br>
              <h4>ทัศนะทางจริยธรรม 5 ประการ ของยุคสารสนเทศ (Five moral dimensions of the information age) มีดังนี้</h4>
                <p class="rem2">1. สิทธิด้านสารสนเทศและพันธะหน้าที่ (Information rights and obligations) สิทธิด้านสารสนเทศอะไรที่องค์การพึงมี และความรับผิดอะไรที่บุคคลและองค์การพึงมี</p>
                <p class="rem2">2. สิทธิของทรัพย์สิน (Property rights) ในสังคมที่ไม่มีความชัดเจนในเรื่องสิทธิของทรัพย์สิน จะต้องพิจารณาสังคมนั้นควรจะมีการปกป้องสิทธิทรัพย์สินทางปัญญาอย่างไร</p>
                <p class="rem2">3. ความรับผิดชอบในหน้าที่และการควบคุม (Accountability and control) การพิจารณาถึงบุคคลที่จะเป็นผู้ที่รับผิดชอบในสิ่งที่เกิดขึ้นที่เป็นอันตรายต่อสิทธิของบุคคล สิทธิของสารสนเทศ และสิทธิของทรัพย์สิน</p>
                <p class="rem2">4. คุณภาพระบบ (System quality) เป็นการพิจารณาว่าระบบควรมีมาตรฐานและคุณภาพ เพื่อการปกป้องสิทธิส่วนบุคคล และความปลอดภัยของสังคม</p>
                <p class="rem2">5. คุณภาพชีวิต (Quality of life) เป็นการพิจารณาว่าค่านิยมใดที่ควรจะรักษาไว้ในสังคมที่ใช้ข่าวสารการมีความรู้พื้นฐาน สถาบันใดที่ควรจะได้รับการปกป้องให้พ้นจากการละเมิดฝ่าฝืน การละเมิดค่านิยม และความประพฤติด้านสังคม การประพฤติเชิงสังคมอย่างไรที่ควรจะได้รับการสนับสนุนจากระบบสารสนเทศ [Information systems (IS)] ใหม่ ๆ</p>
            <br>
            <h4>จริยธรรมในสังคมสารสนเทศ</h4>
                <p class="rem2">จริยธรรมในสังคมสารสนเทศ (Ethics in an information society) เป็นเรื่องเกี่ยวกับทางเลือกของบุคคล เมื่อต้องเผชิญในการปฏิบัติ ซึ่งจะต้องพิจารณาว่าอะไรเป็นทางเลือกที่ถูกต้องตามหลักจริยธรรม</p>
                <p class="rem2">แนวคิดพื้นฐาน : ความรับผิดชอบ ภาระหน้าที่ และภาระผูกพันการชำระหนี้ (Basic concepts : Responsibility, Accountability and liability) ประกอบด้วย</p>
                <p class="rem5">1. ความรับผิดชอบ (Responsibility) เป็นลักษณะเฉพาะของบุคคล และเป็นองค์ประกอบหลักในการกระทำใน</p>
                <p class="rem5">2. ภาระหน้าที่ (Accountability) เป็นลักษณะของระบบและสถาบันทางสังคม ซึ่งเป็นกลไกที่เป็นตัวกำหนดว่าใครจะเป็นผู้รับผิดชอบในการกระทำ ระบบและสถาบันที่อยู่ในสภาพที่หาคนรับผิดชอบไม่ได้ ก็จะเป็นการยากที่จะวิเคราะห์ด้านจริยธรรม</p>
                <p class="rem5">3. ภาระความรับผิด (Liability) เป็นลักษณะของระบบทางการเมือง หมายถึงข้อกำหนดตามกฎหมายที่ให้บุคคลชดใช้ค่าเสียหายที่เกิดขึ้นกับบุคคลอื่น รวมถึงระบบ และองค์การด้วย</p>
                <p class="rem5">4. กระบวนการในการยื่นอุทธรณ์ (Due process) เป็นลักษณะที่เกี่ยวข้องกับสังคมที่ใช้กฎหมายในการปกครอง หมายถึงกระบวนการทางกฎหมายที่ถูกใช้จนเป็นที่รู้จัก และเป็นขบวนการตามขั้นตอนที่ทำให้บุคคลสามารถยื่นอุทธรณ์กับเจ้าหน้าที่ระดับสูงเพื่อตรวจสอบว่าได้มีการใช้กฎหมายอย่างถูกต้อง</p>
            <br>
            <h4> กฎหมายเทคโนโลยีสารสนเทศ</h4>
            <p class="rem2">ถึงแม้ว่าในปัจจุบันบางประเทศที่พัฒนาแล้วจะมีกฎหมายควบคุมสื่ออินเทอร์เน็ต ก็ยังไม่สามารถควบคุมภัยล่อลวงต่าง ๆ จากสื่ออินเทอร์เน็ตได้อย่างมีประสิทธิภาพอย่างเด็ดขาดเต็มที่โดยเฉพาะควบคุมดูแลการเผยแพร่ข้อมูลข่าวสารบนสื่ออินเทอร์เน็ตนั้นก็ยังเป็นปัญหา โดยเฉพาะการเผยแพร่สื่อสารลามกหรือบ่อนการพนัน</p>
            <p class="rem2">ซึ่งปัญหาดังกล่าว นอกจากจะเกี่ยวข้องกับสิทธิส่วนบุคคลในการเข้าถึงข้อมูล การก้าวก่ายสิทธิเสรีภาพในการแสดงออก ซึ่งเป็นสิทธิพื้นฐานของประชาชน ยังอาจจะขัดต่อกฎหมายรัฐธรรมนูญของประเทศอีกด้วย อีกทั้งลักษณะพิเศษของข้อมูลต่าง ๆ ที่อยู่ในเครือข่ายอินเทอร์เน็ต เป็นเครือข่ายที่มีลักษณะเป็นใยแมงมุม ซึ่งระบบกระจายความรับผิดชอบไม่มีศูนย์กลางของระบบ และเป็นเครือข่ายข้อมูลระดับโลกยากต่อการควบคุม และเป็นสื่อที่ไม่มีตัวตน หรือแหล่งที่มาที่ชัดเจน ทั้งผู้ส่งข้อมูล หรือผู้รับข้อมูล</p>
            <p class="rem2">ดังนั้นกฎหมายที่จะมากำกับดูแล หรือควบคุมสื่ออินเทอร์เน็ต จะต้องเป็นกฎหมายลักษณะพิเศษ เป็นที่ยอมรับในระดับสากล แต่ความแตกต่างในระบบการเมือง สังคม และวัฒนธรรม ในแต่ละประเทศยังเป็นปัญหาอุปสรรค ในการร่างกฎหมายดังกล่าวซึ่งปัจจุบันยังไม่ปรากฏผลเป็นกฎหมายยังคงอยู่ในระยะที่กำลังสร้างกฎเกณฑ์กติกาขึ้นมากำกับบริการอินเทอร์เน็ต</p>
            <br>

            <h4> สิทธิทางด้านทรัพย์สิน : ทรัพย์สินทางปัญญา</h4>
            <p class="rem2">ระบบสารสนเทศ [Information Systems (IS)] ได้ท้าทายกฎหมายให้คุ้มครองในเรื่องทรัพย์สินทางปัญญา เพราะเนื่องจากมีการขโมยและการลักลอบเลียนแบบซอฟต์แวร์</p>
            <p class="rem2">ทรัพย์สินทางปัญญา (Intellectual property) เป็นทรัพย์สินที่จับต้องไม่ได้ ถูกสร้างโดยบุคคล หรือบริษัท และอยู่ภายใต้การคุ้มครองของกฎหมาย 3 ประการ ดังนี้ (1) ความลับทางการค้า (Trade secrets) (2) ลิขสิทธิ์ (Copyright) (3) สิทธิบัตร (Patents) การคุ้มครองทั้ง 3 แบบ เป็นแบบการคุ้มครองที่แตกต่างกันในเรื่องของ ซอฟต์แวร์ (Software)</p>
            <p class="rem2">ระบบความปลอดภัย (Security systems) เนื่องจากว่าระบบข้อมูลข่าวสารเป็นหัวใจสำคัญในการบริหารงานในปัจจุบัน และยังเป็นอาวุธสำคัญในการแข่งขัน เพราะข้อมูลข่าวสารช่วยทำให้เราชิงความได้เปรียบในเชิงธุรกิจ ในเมื่อข้อมูลสารสนเทศมีความสำคัญมากเช่นนี้ เราจะดูแลและรักษาความปลอดภัยของข้อมูลดังกล่าวนั้นอย่างไร แท้จริงแล้วคำว่า ระบบความปลอดภัยในที่นี้จะหมายความถึงการป้องกันการลักลอบขโมยและทำลายทรัพยากรที่เกี่ยวข้องกับระบบคอมพิวเตอร์ เช่น ฮาร์ตแวร์ ซอฟต์แวร์ ข้อมูล วีการดำเนินงานและบุคลากรทางด้านคอมพิวเตอร์</p>
            <p class="rem2">ระบบความปลอดภัยสำหรับคอมพิวเตอร์ และข้อมูลสารสนเทศนั้นมีขึ้นมากเป็นลำดับ จากคอมพิวเตอร์ขนาดใหญ่ ซึ่งเป็นแบบรวมศูนย์ ต่อมาการติดต่อแลกเปลี่ยนข้อมูลกับคอมพิวเตอร์ลูกข่ายมีมากขึ้น เนื่องจากลูกข่ายมีลักษณะงานจำเพาะแตกต่างกันออกไป องค์กรขนาดใหญ่บางองค์การใช้ระบบ EDI กับลูกข่ายด้วย ดังนั้นการควบคุมรักษาความปลอดภัยของข้อมูลจากส่วนกลาง ไม่สามารถทำได้อย่างทั่วถึง อุปสรรค์ในการรักษาความปลอดภัยมีเพิ่มมากขึ้นพร้อม ๆ กับการขยายตัวขององค์กร</p>
            <br>
            <h4>ประเทศไทยกับการพัฒนากฎหมายเทคโนโลยีสารสนเทศและอินเทอร์เน็ต</h4>
            <p class="rem2">กฎหมายเทคโนโลยีสารสนเทศของประเทศไทยเริ่มมีตั้งแต่ปี 2541 โดยคณะ กรรมการเทคโนโลยีสารสนเทศแห่งชาติ และมีการใช้ พระราชบัญญัติ (พ.ร.บ.) ว่าด้วยการกระทำความผิดเกี่ยวกับคอมพิวเตอร์ พ.ศ.2560 เพื่อการใช้ออนไลน์อย่างถูกกฎหมาย สำหรับสาระสำคัญที่หลายคนควรพึงระวังใน พ.ร.บ.ว่าด้วยกระทำความผิดเกี่ยวกับคอมพิวเตอร์ พ.ศ. 2560 หรือ พ.ร.บ.คอมพิวเตอร์ ฉบับ 2มีสาระสำคัญจำง่ายๆ ดังนี้</p>
            <p class="rem5">1. การฝากร้านใน Facebook, IG ถือเป็นสแปม ปรับ 200,000 บาท</p>
            <p class="rem5">2. ส่ง SMS โฆษณา โดยไม่รับความยินยอม ให้ผู้รับสามารถปฏิเสธข้อมูลนั้นได้ ไม่เช่นนั้นถือเป็นสแปม ปรับ 200,000 บาท</p>
            <p class="rem5">3. ส่ง Email ขายของ ถือเป็นสแปม ปรับ 200,000 บาท</p>
            <p class="rem5">4. กด Like ได้ไม่ผิด พ.ร.บ.คอมพ์ฯ ยกเว้นการกดไลค์ เป็นเรื่องเกี่ยวกับสถาบัน เสี่ยงเข้าข่ายความผิดมาตรา 112 หรือมีความผิดร่วม</p>
            <p class="rem5">5. กด Share ถือเป็นการเผยแพร่ หากข้อมูลที่แชร์มีผลกระทบต่อผู้อื่น อาจเข้าข่ายความผิดตาม พ.ร.บ.คอมพ์ฯ โดยเฉพาะที่กระทบต่อบุคคลที่ 3</p>
            <p class="rem5">6. พบข้อมูลผิดกฎหมายอยู่ในระบบคอมพิวเตอร์ของเรา แต่ไม่ใช่สิ่งที่เจ้าของคอมพิวเตอร์กระทำเอง สามารถแจ้งไปยังหน่วยงานที่รับผิดชอบได้ หากแจ้งแล้วลบข้อมูลออกเจ้าของก็จะไม่มีความผิดตามกฎหมาย เช่น ความเห็นในเว็บไซต์ต่าง ๆ รวมไปถึงเฟซบุ๊ก ที่ให้แสดงความคิดเห็น หากพบว่าการแสดงความเห็นผิดกฎหมาย เมื่อแจ้งไปที่หน่วยงานที่รับผิดชอบเพื่อลบได้ทันที เจ้าของระบบเว็บไซต์จะไม่มีความผิด</p>
            <p class="rem5">7.สำหรับ แอดมินเพจ ที่เปิดให้มีการแสดงความเห็น เมื่อพบข้อความที่ผิด พ.ร.บ.คอมพ์ฯ เมื่อลบออกจากพื้นที่ที่ตนดูแลแล้ว จะถือเป็นผู้พ้นผิด</p>
            <p class="rem5">8. ไม่โพสต์สิ่งลามกอนาจาร ที่ทำให้เกิดการเผยแพร่สู่ประชาชนได้</p>
            <p class="rem5">9. การโพสเกี่ยวกับเด็ก เยาวชน ต้องปิดบังใบหน้า ยกเว้นเมื่อเป็นการเชิดชู ชื่นชม อย่างให้เกียรติ</p>
            <p class="rem5">10. การให้ข้อมูลเกี่ยวกับผู้เสียชีวิต ต้องไม่ทำให้เกิดความเสื่อมเสียเชื่อเสียง หรือถูกดูหมิ่น เกลียดชัง ญาติสามารถฟ้องร้องได้ตามกฎหมาย</p>
            <p class="rem5">11. การโพสต์ด่าว่าผู้อื่น มีกฏหมายอาญาอยู่แล้ว ไม่มีข้อมูลจริง หรือถูกตัดต่อ ผู้ถูกกล่าวหา เอาผิดผู้โพสต์ได้ และมีโทษจำคุกไม่เกิน 3 ปี ปรับไม่เกิน 200,000 บาท</p>
            <p class="rem5">12. ไม่ทำการละเมิดลิขสิทธิ์ผู้ใด ไม่ว่าข้อความ เพลง รูปภาพ หรือวิดีโอ</p>
            <p class="rem5">13. ส่งรูปภาพแชร์ของผู้อื่น เช่น สวัสดี อวยพร ไม่ผิด ถ้าไม่เอาภาพไปใช้ในเชิงพาณิชย์ หารายได้</p>
                <br>
            <p class="rem2 font-italic">นี่เป็นเพียงส่วนหนึ่งของ พ.ร.บ.คอมพิวเตอร์ 2560 ที่มีผลบังคับใช้แล้ว ซึ่งยังมีอีกหลายประเด็นที่ส่งผลกระทบต่อการใช้งานสื่อสังคมออนไลน์ ดังนั้นจึงควรรู้กฎกติกาการใช้งานไว้ก่อน  และยังมี พระราชบัญญัติ การ รักษา ความ มั่นคง ปลอดภัย ไซเบอร์ พ.ศ.2562 สามารถ ตามรายละเอียด พ.ร.บ. </p>

              <!-- -------------------------------- -->
              <br />
              <br />
              <br />
              <br />
              <div class="container">
                <div class="row">
                  <div class="col-auto mr-auto">
                    <router-link to="/lesson6_3" title="Lesson6_3 Page">
                      <div class="btn-wrapper">
                        <base-button
                          tag="a"
                          target="_blank"
                          rel="noopener noreferrer"
                          class="mb-3 mb-sm-0"
                          outline
                          type="info"
                          icon="fa fa-chevron-left"
                          >Previous</base-button
                        >
                      </div>
                    </router-link>
                  </div>
                  <div class="col text-center">
                         <div class="btn-wrapper">
                          <base-button
                          id="back-to-top"
                          href="#"
                          role="button"
                          tag="a"
                          rel="noopener noreferrer"
                          class="btn  back-to-top"
                          
                          outline type="info"
                        >
                          <i class="fa fa-chevron-up" aria-hidden="true"></i>
                        </base-button>
                      </div>
                  </div>
                  <div class="col-auto">
                      <router-link to="/lesson7_1" title="Lesson7_1 Page">
                    <div class="btn-wrapper">
                      <base-button
                        tag="a"
                        target="_blank"
                        rel="noopener noreferrer"
                        class="mb-3 mb-sm-0"
                        outline
                        type="info"
                      >
                        Continue
                        <i class="fa fa-chevron-right" aria-hidden="true"></i>
                      </base-button>
                    </div>
                    </router-link>
                  </div>
                </div>
              </div>
              <div class="text-center mt-5">Page 4/4</div>
            </div>
          </div>
        </div>
      </section>

      <hr />
      <div class="col-lg-center">
        <div class="pt-4 text-center">
          <h5 class="title">
            <span class="d-block mb-1">Author | Dr. Piyawan Siriprasertsil</span>
            <small class="h6 text-black"
              >Lecturer in The Business Administration at Maejo University</small
            >
          </h5>
        </div>
      </div>
      <hr />
    </div>
  </div>
</template>

<script>
export default {
  name: "home",
  components: {},
};
</script>

<style></style>
