<template>
  <div>
    <div class="position-relative">
      <section class="section-shaped my-0">
        <div class="shape shape-style-1 shape-default">
          <span></span>
          <span></span>
          <span></span>
          <span></span>
          <span></span>
          <span></span>
          <span></span>
          <span></span>
          <span></span>
        </div>

        <div class="container shape-container d-flex">
          <div class="col px-0"></div>
        </div>
      </section>

      <section class="section section-shaped my-0 overflow-hidden">
        <div class="container pt-lg pb-80">
          <div class="row justify-content-center">
            <div class="fontx col-lg-10">
              <!-- -------------------------------- -->
              <h4>
                #คีย์ลัดที่ใช้บ่อยในโปรแกรมไมโครซอฟต์เวิร์ด
                <br />
                <br />
              </h4>
              <div class="container">
                <div class="row">
                  <div class="col">
                    <!-- table#1 -->
                    <table class="table">
                      <thead class="thead-light">
                        <tr>
                          <th scope="col">คำสั่ง</th>
                          <th scope="col">คีย์ลัด</th>
                        </tr>
                      </thead>
                      <tbody>
                        <tr>
                          <td>เปิด</td>
                          <td>Ctrl + O</td>
                        </tr>
                        <tr>
                          <td>บันทึก</td>
                          <td>Ctrl + S</td>
                        </tr>
                        <tr>
                          <td>ปิด</td>
                          <td>Ctrl + W</td>
                        </tr>
                        <tr>
                          <td>ตัด</td>
                          <td>Ctrl + X</td>
                        </tr>
                        <tr>
                          <td>คัดลอก</td>
                          <td>Ctrl + C</td>
                        </tr>
                        <tr>
                          <td>วาง</td>
                          <td>Ctrl + V</td>
                        </tr>
                        <tr>
                          <td>เลือกทั้งหมด</td>
                          <td>Ctrl + A</td>
                        </tr>
                        <tr>
                          <td>ตัวหนา</td>
                          <td>Ctrl + B</td>
                        </tr>
                        <tr>
                          <td>ตัวเอียง</td>
                          <td>Ctrl + I</td>
                        </tr>
                        <tr>
                          <td>ขีดเส้นใต้</td>
                          <td>Ctrl + U</td>
                        </tr>
                        <tr>
                          <td>ลดขนาดฟอนต์ลง 1 พอยต์</td>
                          <td>Ctrl + [</td>
                        </tr>
                        <tr>
                          <td>เพิ่มขนาดฟอนต์ขึ้น 1 พอยต์</td>
                          <td>Ctrl + ]</td>
                        </tr>
                        <tr>
                          <td>จัดข้อความกึ่งกลาง</td>
                          <td>Ctrl + E</td>
                        </tr>
                        <tr>
                          <td>จัดข้อความชิดซ้าย</td>
                          <td>Ctrl + L</td>
                        </tr>
                        <tr>
                          <td>จัดข้อความชิดขวา</td>
                          <td>Ctrl + R</td>
                        </tr>
                        <tr>
                          <td>ยกเลิก</td>
                          <td>ESC</td>
                        </tr>
                        <tr>
                          <td>เลิกทำ</td>
                          <td>Ctrl + Z</td>
                        </tr>
                        <tr>
                          <td>ทำซ้ำ</td>
                          <td>Ctrl + Y</td>
                        </tr>
                        <tr>
                          <td>จัดข้อความให้ชิดซ้ายและชิดขวา</td>
                          <td>Ctrl + J</td>
                        </tr>
                        <tr>
                          <td>สั่งพิมพ์เอกสาร</td>
                          <td>Ctrl + P</td>
                        </tr>
                        <tr>
                          <td>สร้างตารางข้อมูล</td>
                          <td>Alt + Shift + O</td>
                        </tr>
                      </tbody>
                    </table>
                  </div>
                  <div class="col">
                    <table class="table">
                      <thead class="thead-light">
                        <tr>
                          <th scope="col">คำสั่ง</th>
                          <th scope="col">คีย์ลัด</th>
                        </tr>
                      </thead>
                      <tbody>
                        <tr>
                          <td>สลับไปยังหน้าก่อนหน้านี้</td>
                          <td>Alt + Shift + Tab</td>
                        </tr>
                        <tr>
                          <td>สลับไปยังหน้าต่อไป</td>
                          <td>Alt + Tab</td>
                        </tr>
                        <tr>
                          <td>แทรกตัวแบ่งหน้า</td>
                          <td>Ctrl + Enter</td>
                        </tr>
                        <tr>
                          <td>ขีดเส้นใต้แบบ 2 เส้น</td>
                          <td>Ctrl + Shift + D</td>
                        </tr>
                        <tr>
                          <td>เปิดหน้าต่างแบบอักษร</td>
                          <td>Ctrl + Shift + F</td>
                        </tr>
                        <tr>
                          <td>แบ่งหน้าต่างเอกสารออกเป็น 2 ส่วน</td>
                          <td>Alt + Ctrl + S</td>
                        </tr>
                        <tr>
                          <td>ยกเลิกแบ่งหน้าต่างเอกสารออกเป็น 2 ส่วน</td>
                          <td>Alt + Shift + C</td>
                        </tr>
                        <tr>
                          <td>เรียกใช้สัญลักษณ์แสดงหัวข้อย่อย</td>
                          <td>Ctrl + Shift + L</td>
                        </tr>
                        <tr>
                          <td>นับจำนวนคำหรือตัวอักษรทั้งหมดในเอกสาร</td>
                          <td>Ctrl + Shift + G</td>
                        </tr>
                        <tr>
                          <td>เปิดหน้าต่างค้นหาและแทนที่</td>
                          <td>Ctrl + H</td>
                        </tr>
                        <tr>
                          <td>สร้างเอกสารใหม่</td>
                          <td>Ctrl + N</td>
                        </tr>
                        <tr>
                          <td>
                            แทรกคำอธิบายเพิ่มเติมลงไปตรงข้อความที่ต้องการอธิบาย(Endnote)
                          </td>
                          <td>Alt + Ctrl + D</td>
                        </tr>
                        <tr>
                          <td>
                            แทรกคำอภิบายเพิ่มเติมลงทางด้านล่างของหน้ากระดาษ(Footnote)
                          </td>
                          <td>Alt + Ctrl + F</td>
                        </tr>
                        <tr>
                          <td>แทรกเวลาปัจจุบันลงในเอกสาร</td>
                          <td>Alt + Shift + T</td>
                        </tr>
                        <tr>
                          <td>วางเฉพาะข้อความอย่างเดียว</td>
                          <td>Ctrl + Shift + V</td>
                        </tr>
                      </tbody>
                    </table>
                  </div>
                </div>
              </div>
              <hr />
              <h4>
                #เทคนิคง่ายๆ ของโปรแกรมไมโครซอฟต์เวิร์ด
                <br /><br />
              </h4>
              <h5>- รหัสผ่านป้องกันเอกสารการทำงาน</h5>
              <p>
                ถ้างานที่คุณพิมพ์ในโปรแกรมไมโครซอฟต์เวิร์ดเป็นเอกสารที่เป็นความลับหรือค่อนข้างสำคัญ
                เราสามารถใส่รหัสป้องกันได้ด้วยการคลิก แฟ้ม > ข้อมูล >
                ป้องกันเอกสาร > เข้ารหัสลับด้วยรหัสผ่าน > ใส่รหัสผ่าน > ตกลง
              </p>
              <div class="text-center">
                <img src="/img/lesson1/6.png" width="50%" />
              </div>
              <br />
              <br />
              <h5>- การใส่ลายน้ำ</h5>
              <p>
                ลายน้ำคือข้อความ อักษร
                หรืออาจจะเป็นรูปภาพที่ปรากฏอยู่ด้านหลังข้อความบนหน้าเอกสาร
                ซึ่งจะเพิ่มความน่าสนใจของเอกสารมากยิ่งขึ้น ไปที่
                เค้าโครงหน้ากระดาษ > ลายน้ำ > เลือกแบบตามตัวอย่างหรือกำหนดเอง
                <br />
              </p>
              <div class="text-center">
                <img src="/img/lesson1/7.png" width="50%" />
              </div>
              <br />
              <br />
              <h5>- การใส่ลายน้ำ</h5>
              <p></p>
              เริ่มจากไปที่เมนู มุมมอง > แมโคร > ตั้งชื่อ แมโคร (ใช้ภาษาอังกฤษ
              ห้ามเว้นวรรค สามารถใช้ขีดล่างได้) > กดปุ่มสร้าง >
              ในหน้าพิมพ์คำสั่ง แมโคร โดยให้ลบโค้ดเก่าออกให้หมด >
              พิมพ์โค้ดด้านล่างนี้แทน > กดปุ่มบันทึก
              <br />
              <br />
              <div class="container">
                <div class="row">
                  <div class="col">
                    Sub arabictothai()
                    <br />For i = 0 To 9 <br />With Selection.Find
                    <p style="color:red">.Text = Chr(48 + i)</p>
                    .Replacement.Text = Chr(240 + i)
                    <br />.Wrap = wdFindContinue <br />End With
                    <br />Selection.Find.Execute Replace:=wdReplaceAll
                    <br />Next <br />End Sub
                    <br />
                    <hr />
                  </div>
                  <div class="col">
                    Sub thaitoarabic()
                    <br />For i = 0 To 9 <br />With Selection.Find
                    <p style="color:red">.Text = Chr(240 + i)</p>
                    .Replacement.Text = Chr(48 + i) <br />.Wrap = wdFindContinue
                    <br />End With <br />Selection.Find.Execute
                    Replace:=wdReplaceAll <br />Next <br />End Sub
                    <br />
                    <br />
                  </div>
                </div>
              </div>
              <p>
                โดยเวลาเรียกใช้งาน ให้ไปที่ มุมมอง > แมโคร อีกครั้งจะเจอเมนู
                arabictothai กับ thaitoarabic
                ก็สามารถเลือกรูปแบบที่เราต้องการจากนั้นกดปุ่ม เรียกใช้
                ตัวเลขบนเอกสารทั้งหมดก็จะเปลี่ยนทั้งหมด
                <br />
                <br />
              </p>
              <h5>
                - การใช้คำสั่ง Selection หรือการเลือก แบบต่างๆ
                บนเอกสารโปรแกรมไมโครซอฟต์เวิร์ด
              </h5>

              แบบที่ 1 ลากและคลุมข้อความ :
              วิธีนี้เป็นพื้นฐานในการเลือกข้อความหรือ selection
              <br />แบบที่ 2 ดับเบิลคลิก : เลือกข้อความเป็นคำๆ
              โดยดับเบิลคลิกที่คำนั้น ซึ่งคำนั้นก็จะถูกเลือกแบบอัตโนมัติ
              ซึ่งสังเกต ได้จากการมีแถบสีดำปรากฏขึ้นที่คำนั้น <br />แบบที่ 3
              ทริปเปิ้ลคลิก (กดสามครั้งเนื่องกัน) : ใช้สำหรับในกรณีที่เราต้องการ
              เลือกทั้งพารากราฟ หรือทั้งย่อหน้า <br />แบบที่ 4 คลิกหน้าประโยค :
              คลิกหน้าประโยค หรือบรรทัดที่เราต้องการ
              ซึ่งมีวิธีที่หลากหลายดังต่อไปนี้

              <p style="text-indent: 5em;">
                - คลิกหนึ่งครั้ง หมายถึง เลือกทั้งประโยค
              </p>

              <p style="text-indent: 5em;">
                - คลิกสองครั้ง (ต่อเนื่อง) หมายถึง เลือกทั้งย่อหน้า
              </p>

              <p style="text-indent: 5em;">
                - คลิกสามครั้ง (ต่อเนื่อง) หมายถึง การเลือกทั้งเอกสาร (ทั้งหมด)
              </p>

              แบบที่ 5 ใช้ปุ่ม Ctrl : กดปุ่ม CTRL ค้างไว้ จากนั้น
              ถ้าต้องการคลิกคำใด ก็สามารถดับเบิลคลิกที่คำนั้นได้
              <br />แบบที่ 6 ใช้ปุ่ม Shift : กดปุ่ม Shift ค้างไว้ จากนั้น
              คลิกตำแหน่งเริ่มต้น
              และคลิกอีกครั้งที่ปลายข้อความที่ต้องการหรือจะกดปุ่มลูกศรซ้าย/ขวา
              จะเป็นการเลือกประโยคข้อความนั้น
              <br />
              <br />

              <h5>- การใส่ Style ให้กับหัวเรื่อง (Heading)</h5>
              <p>
                เมื่อเราใส่ Style ให้กับหัวเรื่องแล้ว
                โปรแกรมจะรู้ว่าเป็นหัวข้อของข้อความที่เราต้องการ
                และจะมีประโยชน์ในการทำสารบัญต่อไป
                โดยเลือกหัวข้อที่เราต้องการพร้อมๆ กัน โดยการกด Ctrl ค้างไว้
              </p>
              <p style="text-indent: 2.5em;">
                a. ถ้าต้องการให้หัวข้อนั้นเป็นหัวข้อหลักให้กด Ctrl + Alt + 1
              </p>
              <p style="text-indent: 2.5em;">
                b. ถ้าต้องการให้หัวข้อนั้นเป็นหัวข้อย่อยของหัวข้อหลักให้กด Ctrl
                + Alt + 2
              </p>
              <p>
                จากนั้นหัวข้อหลักและหัวข้อย่อยจะแสดงที่บานหน้าต่างนำทาง
                (Navigation pane)
              </p>
              <br />
              <div class="text-center">
                <img src="/img/lesson1/8.png" width="80%" />
              </div>
              <br />
              <p>
                ดังนั้นเมื่อเราได้กำหนดหัวเรื่องแล้วเราสามารถทำสารบัญได้
                โดยการเลือก การอ้างอิง > สารบัญ > เลือกรูปแบบสารบัญที่เราต้องการ
                จะได้รูปแบบตามรูปด้านล่างนี้
              </p>
              <div class="text-center">
                <img src="/img/lesson1/9.png" width="100%" />
              </div>
              <br />
              <br />
              <h5>
                - การบันทึกข้อมูลแบบอัตโนมัติ (Auto Save)
                ในโปรแกรมไมโครซอฟต์เวิร์ด
              </h5>
              <p>
                เป็นการตั้งให้โปรแกรมไมโครซอฟต์เวิร์ดการบันทึกข้อมูลแบบอัตโนมัติ
                เพื่อช่วยบันทึกข้อมูลที่ผู้ใช้งานกำลังดำเนินการอยู่และยังไม่ได้บันทึก
                รวมถึงในกรณีที่โปรแกรมเกิดความผิดพลาด
                โปรแกรมจะดำเนินการกู้คืนข้อมูลแบบอัตโนมัติ โดยเลือก แฟ้ม >
                ตัวเลือก > บันทึก >
                กำหนดเวลาและตำแหน่งที่เก็บไฟล์ข้อมูลในการบันทึกข้อมูลแบบอัตโนมัติ
                <br />
              </p>
              <div class="text-center">
                <img src="/img/lesson1/10.png" width="80%" />
              </div>
              <br />
              <br />
              <h5>- ภาพหน้าจอ (Screen shot)</h5>
              <p>
                เป็นการทำการตัดภาพบนหน้าจอมาแทรกรูปภาพนั้นบนเอกสาร โดยเลือก แทรก
                > ภาพหน้าจอ > การคลิปหน้าจอ > จากนั้น Capture
                รูปภาพหน้าจอที่เราต้องการ > รูปภาพจะมาปรากฏบนเอกสาร
              </p>
              <br />
              <br />
              <div class="text-center">
                <img src="/img/lesson1/11.png" width="80%" />
              </div>
              <br />
              <br />
              <h5>- การแทรกตาราง</h5>
              <p style="text-indent: 2.5em;">
                ขั้นตอนการแทรกตาราง มีดังนี้ เลือกเมนูแทรก > ตาราง >
                เลือกขนาดของตาราง /p>
              </p>
              <p style="text-indent: 5em;">
                - แนวตั้ง = คอลัมน์ (column) หรือ สดมภ์
              </p>
              <p style="text-indent: 5em;">- แนวนอน = โรล (row) หรือ แถว</p>
              <br />
              <h5>- การแปลงตัวเลขให้เป็นข้อความจำนวนเงินด้วย baht text</h5>
              <p style="text-indent: 2.5em;">
                เป็นเทคนิคการแสดงตัวเลขจำนวนเงินให้เป็นข้อความ ซึ่งมีวิธีดังนี้
              </p>
              <p style="text-indent: 5em;">
                - ใช้สูตร (fx) ในแถบเค้าโครงภายใต้เครื่องมือตาราง
              </p>
              <div class="text-center">
                <img src="/img/lesson1/12.png" width="100%" />
              </div>
              <br />
              <br />
              <p style="text-indent: 2.5em;">
                โดยนำเคอร์เซอร์ (Cursor) ไปวางในเซลล์ (Cell) : C1 จากนั้นไปที่
                เครื่องมือตาราง > เค้าโครง > สูตร > พิมพ์สูตร : =b1\*bahttext
              </p>
              <br />
              <br />
              <h5>- แก้ไขระยะห่างระหว่างบรรทัด</h5>
              <p style="text-indent: 2.5em;"></p>
              <p style="text-indent: 2.5em;">
                วิธีลัด : เมื่อต้องการแก้ไขระยะห่างระหว่างบรรทัด
                เราสามารถทำได้โดยการคลุมแถบบรรทัดที่เราต้องกำหนดระยะห่าง
                จากนั้นกดคีย์ลัด ดังนี้
              </p>
              <p>Ctrl + 1 : เปลี่ยนระยะห่างบรรทัดเดียว</p>
              <div class="text-center">
                <img src="/img/lesson1/13.png" width="30%" />
              </div>
              <p>Ctrl + 2 : เปลี่ยนระยะห่างเป็น 2 บรรทัด</p>
              <div class="text-center">
                <img src="/img/lesson1/14.png" width="30%" />
              </div>
              <br /><br />
              <h4 class="text-center">
                การจัดการข้อมูลและเอกสารแบบออนไลน์ด้วย
              </h4>
              <h4 class="text-center">
                กูเกิลเอกสาร (Google Docs) และกูเกิลฟอร์ม (Google Form)
              </h4>
              <br />
              <p style="text-indent: 2.5em;">
                จากการพัฒนาของระบบอินเตอร์เน็ตที่เป็นไปอย่างก้าวกระโดดจึงทำให้ในปัจจุบันเทคโนโลยีดิจิทัลได้เข้ามามีบทบาทสำคัญในวิถีชีวิตของคนทั้งโลก
                ดังจะเห็นได้จากการทำงานแทบทั้งหมดในปัจจุบันล้วนอยู่บนคอมพิวเตอร์และระบบอินเตอร์เน็ต
                รวมถึงงานและกิจกรรมต่างๆ
                ที่ยังคงดำเนินการในแบบเดิมได้มีแนวโน้มที่จะปรับไปในทิศทางที่เข้าสู่ความเป็นดิจิทัลอย่างต่อเนื่อง
                ในส่วนของงานด้านข้อมูลและเอกสารก็ถูกปรับเปลี่ยนรูปแบบจากการพิมพ์จากเครื่องพิมพ์ดีดลงบนกระดาษ
                กลายมาเป็นการพิมพ์งานผ่านเครื่องคอมพิวเตอร์หรือแม้แต่โทรศัพท์เคลื่อนที่อย่างที่เราคุ้นเคยกันดีในช่วงไม่กี่ปีมานี้
                พร้อมกันนี้เพื่อบริหารทรัพยากรและเวลาให้มีประสิทธิภาพมากที่สุด
                หลายองค์กรเริ่มปรับตัวให้ลักษณะการทำงานของพนักงานสามารถกระทำได้ได้โดยไม่ขึ้นอยู่กับสถานที่
                สามารถติดต่อประสานงานหรือทำงานได้ทุกที่เพียงแค่มีอินเตอร์เน็ต
                ด้วยเหตุดังกล่าว โปรแกรมต่างๆ ที่เราเคยใช้
                จึงถูกปรับไปเป็นลักษณะของการให้บริการแบบออนไลน์กันมากขึ้น
                โดยมีสองบริษัทใหญ่ที่ได้นำเสนอชุดบริการเพื่อตอบสนองรูปแบบการทำงานที่เปลี่ยนไปเหล่านั้น
                คือ กูเกิล (Google) ที่ได้นำเสนอจีสูท (G-Suite) และไมโครซอฟต์
                (Microsoft) ที่ได้นำเสนอออฟฟิศ 365 (Office 365)
                ซึ่งบริการของทั้งคู่ตั้งอยู่บนการให้บริการผ่านอินเตอร์เน็ตเพื่อให้บุคคลหรือองค์กรต่างๆ
                สามารถจัดการงานเอกสาร อีเมล งานนำเสนอ ฯลฯ ได้อย่างมีประสิทธิภาพ
              </p>
              <p style="text-indent: 2.5em;">
                จากความสำคัญและประโยชน์ของบริการที่กล่าวมาข้างต้น
                ในหัวข้อต่อไปนี้จึงได้หยิบยกเอาบริการสองบริการที่น่าสนใจและใกล้ตัวจากกูเกิล
                ประกอบด้วย กูเกิลเอกสาร (Google Docs) และกูเกิลฟอร์ม (Google
                Form) มานำเสนอ
                ซึ่งผู้อ่านสามารถนำไปใช้ให้เกิดประโยชน์และช่วยเพิ่มศักยภาพในการทำงานของตนเอง
                ได้ในอนาคต
              </p>
              <br />

              <h5>1. ทำความรู้จักกับ กูเกิล</h5>
              <p style="text-indent: 2.5em;">
                กูเกิล (Google Inc.)
                เป็นบริษัทขนาดใหญ่ที่ให้บริการเกี่ยวกับข้อมูลและมีบริการหลากหลายประเภท
                ครอบคลุมประเทศทั่วทั้งโลก (ตัวอย่างบริการต่างๆ ดังแสดงในรูปที่
                1)
                โดยมีพันธกิจหลักคือการจัดระเบียบข้อมูลในโลกนี้และทำให้เข้าถึงได้ง่ายในทุกที่และมีประโยชน์
                [1]
                ซึ่งบริการที่เป็นที่รู้จักในวงกว้างและสร้างชื่อเสียงให้กับกูเกิลคือการให้บริการเครื่องมือการค้นหาข้อมูลในเครือข่ายอินเตอร์เน็ตและการให้บริการอีเมลล์
                ซึ่งบริการส่วนใหญ่ไม่เก็บค่าบริการ โดยทุกๆ
                บริการของกูเกิลจะสามารถเข้าถึงได้ผ่านบัญชีของกูเกิล (Google
                Account) ดังนั้นหากต้องการใช้บริการของกูเกิลแล้ว
                ผู้ใช้จำเป็นที่จะต้องลงทะเบียนเพื่อขอบัญชีของกูเกิลเป็นอันดับแรก
                (ซึ่งไม่มีค่าใช้จ่ายเช่นกัน)
                นอกจากนี้กูเกิลยังได้พัฒนาบริการที่สามารถช่วยจัดการเรื่องข้อมูลและเอกสารแบบออนไลน์ได้
                โดยเราจะเข้าสู่รายละเอียดของบริการดังกล่าวในหัวข้อถัดไป
              </p>
              <br />
              <div class="text-center font-italic">
                <img src="/img/lesson1/p1.png" width="80%" />
                <p><br />รูปที่ 1 ตัวอย่างบริการต่างๆ ของกูเกิล</p>
              </div>
              <br />
              <h5>
                2.
                ชุดเครื่องมือจากกูเกิลที่ใช้สำหรับจัดการงานด้านข้อมูลและเอกสารแบบออนไลน์
              </h5>
              <p style="text-indent: 2.5em;">
                ชุดเครื่องมือจากกูเกิลที่ใช้สำหรับจัดการงานด้านเอกสารและข้อมูลจะเป็นการให้บริการแบบออนไลน์แทนที่การติดตั้งโปรแกรมประมวลผลคำลงบนเครื่องคอมพิวเตอร์
                ด้วยเหตุนี้เองการประมวลผลโดยส่วนใหญ่จึงถูกดำเนินการที่เครื่องเซิร์ฟเวอร์
                (Server) ของผู้ให้บริการ
                จึงทำให้แม้แต่อุปกรณ์ขนาดเล็กที่มีกำลังการประมวลผลต่ำอย่างแทปเล็ตหรือสมาร์ทโฟนสามารถใช้งานการประมวลผลคำหรือจัดการเกี่ยวกับข้อมูลต่างๆ
                ของผู้ใช้ได้อย่างง่ายดายเสมือนหนึ่งดำเนินการบนคอมพิวเตอร์แบบตั้งโต๊ะ
                ซึ่งในชุดเครื่องมือที่ใช้ดำ
                เนินการด้านเอกสารและข้อมูลของกูเกิลประกอบด้วย 4
                แอปพลิเคชันหลักที่สามารถดำเนินการกับข้อมูลและเอกสารในรูปแบบที่แตกต่างกันได้
                มีดังต่อไปนี้ (รูปไอคอนของแอปพลิเคชันแสดงในรูปที่ 2)
              </p>
              <div class="text-center font-italic">
                <img src="/img/lesson1/p2.png" width="80%" />
                <p>
                  <br />รูปที่ 2
                  ไอคอนของแอปพลิเคชันที่ใช้สำหรับจัดการเอกสารของกูเกิล
                </p>
              </div>
              <br />
              <p style="text-indent: 2.5em;">
                1) กูเกิลเอกสาร (Google Docs)
                เป็นเครื่องมือที่มีไว้สำหรับประมวลผลคำ
                สามารถสร้างและแก้ไขเอกสารและข้อความทั่วไป
                ซึ่งเทียบเคียงได้กับโปรแกรมไมโครซอฟต์เวิร์ดของบริษัทไมโครซอฟต์
              </p>
              <p style="text-indent: 2.5em;">
                2) กูเกิลชีต (Google Sheets) เป็นเครื่องมือที่มีไว้สำหรับสร้าง
                แก้ไข จัดการเสปรดชีต (Spreadsheets)
                เพื่อการดำเนินการบนข้อมูลต่างๆ โดยเฉพาะด้านตัวเลข
                ที่จะสามารถควบคุมการแสดงผลด้วยสูตรทางคณิตศาสตร์ได้
                ซึ่งเทียบเคียงได้กับโปรแกรมไมโครซอฟต์เอ็กเซลของบริษัทไมโครซอฟต์
              </p>
              <p style="text-indent: 2.5em;">
                3) กูเกิลสไลด์ (Google Slides) เป็นเครื่องมือที่มีไว้สำหรับสร้าง
                แก้ไข จัดการการนำเสนอ
                ซึ่งเทียบเคียงได้กับโปรแกรมไมโครซอฟต์เพาเวอร์พอยต์ของบริษัทไมโครซอฟต์
              </p>
              <p style="text-indent: 2.5em;">
                4) กูเกิลฟอร์ม (Google Forms) เป็นเครื่องมือที่มีไว้สำหรับสร้าง
                แก้ไข จัดการแบบฟอร์ม แบบทดสอบ แบบสอบถาม หรือคำเชิญต่างๆ เป็นต้น
                นอกจากนี้ยังสามารถแชร์แบบฟอร์มกับผู้อื่นได้อย่างง่ายดาย
              </p>
              <br />
              <p class="text-decoration-underline" style="text-indent: 2.5em;">
                ในการใช้งานเครื่องมือต่างๆ ของกูเกิล
                หากผู้ใช้มีหรือลงทะเบียนบัญชีผู้ใช้ของกูเกิลแล้วสามารถการเข้าใช้งานเครื่องมือต่างๆ
                ของกูเกิล โดยมีขั้นตอนดังนี้
              </p>
              <p style="text-indent: 2.5em;">
                1) เปิดเว็บเว็บเบราว์เซอร์ในเครื่องคอมพิวเตอร์
                (หากต้องการใช้งานผ่านสมาร์ทโฟนสามารถดาวน์โหลดแอปพลิเคชันที่ต้องการมาติดตั้งบนสมาร์ทโฟน
                และเข้าใช้งานผ่านบัญชีกูเกิลของตนเองได้ทันที)
              </p>
              <p style="text-indent: 2.5em;">
                2) พิมพ์ www.google.com ลงในช่อง URL.
              </p>
              <p style="text-indent: 2.5em;">
                3) ลงชื่อเข้าใช้ด้วยการคลิกที่ ปุ่ม “ลงชื่อเข้าสู่ระบบ”
                ดังแสดงในรูปที่ 3 (ในส่วน A)
              </p>
              <p style="text-indent: 2.5em;">
                4) เปิดตัวเลือกแอปพลิเคชันโดยการคลิกที่ ปุ่มแสดงแอปพลิเคชัน
                ดังแสดงในรูปที่ 3 (ในส่วน B)
              </p>
              <p style="text-indent: 2.5em;">
                5) จากนั้นเลือกแอปพลิเคชันที่ต้องการเข้าใช้งาน
                (ซึ่งกูเกิลเอกสารและกูเกิลฟอร์มจะปรากฏอยู่ในส่วนนี้ด้วย
                และหากไม่ปรากฏ สามารถกดปุ่ม “เพิ่มเติมจาก Google”
                เพื่อค้นหาแอปพลิเคชันที่ต้องการได้)
              </p>
              <div class="text-center font-italic">
                <img src="/img/lesson1/p3.png" width="80%" />
                <p>
                  <br />รูปที่ 3 การลงชื่อเข้าใช้บัญชีกูเกิล (A) และการเปิดตัวเลือกแอปพลิเคชัน (B)
                </p>
              </div>
              <br />
              <p style="text-indent: 2.5em;">
                โดยชุดเครื่องมือจากกูเกิลที่ใช้สำหรับจัดการงานด้านเอกสารแบบออนไลน์ มีข้อดีหลายประการ อาทิ 
              </p>
              <p style="text-indent: 2.5em;">
                1)	ใช้งานได้ฟรีโดยไม่มีค่าใช้จ่ายเพียงมีบัญชีของกูเกิล (โดยบัญชีของกูเกิลจะมาพร้อมกับพื้นที่เก็บข้อมูลบนบริการกูเกิลไดรฟ์ฟรีขนาด 15 กิกะไบต์ ซึ่งเพียงพอต่อการใช้งานในเบื้องต้น) 
              </p>
              <p style="text-indent: 2.5em;">
                2)	สามารถจัดการเอกสารได้ด้วยเว็บเบราว์เซอร์ผ่านเครือข่ายอินเตอร์เน็ต โดยไม่ต้องติดตั้งโปรแกรมลงบนเครื่องคอมพิวเตอร์
              </p>
              <p style="text-indent: 2.5em;">
                3)	สามารถจัดการเอกสารบนสมาร์ทโฟนได้ เสมือนหนึ่งดำเนินการบนเครื่องคอมพิวเตอร์ 
              </p>
              <p style="text-indent: 2.5em;">
                4)	สามารถทำงานร่วมกันหลายบัญชีผู้ใช้ ได้ และสามารถแชร์งานระหว่างผู้อื่นได้อย่างง่ายดาย โดยสามารถกำหนดสิทธิ์ของผู้ใช้แต่ละคนได้หลากหลายรูปแบบ เช่น สามารถเข้าดูได้เพียงอย่างเดียว หรือ สามารถแก้ไขได้ หรือสามารถดาวน์โหลดงานได้เป็นต้น 
              </p>
              <p style="text-indent: 2.5em;">
                5)	มีความสามารถในการควบคุมเวอร์ชัน (Version control) ของเอกสาร ทำให้สามารถเรียกคืนเอกสารเวอร์ชันใดๆ ที่ต้องการมาใช้งานได้ 
              </p>
              <br>
              <h5>3.	กูเกิลเอกสาร</h5>
              <h6 style="text-indent: 2.5em;">3.1.	ภาพรวม องค์ประกอบและเครื่องมือต่างๆ ของกูเกิลเอกสาร</h6>
              <p style="text-indent: 2.5em;">กูเกิลเอกสารเป็นบริการ/เครื่องมือในการจัดการเอกสารและประมวลผลคำที่สามารถสร้างและแก้ไขเอกสารได้อย่างยืดหยุ่น หลากหลายที่มาพร้อมกับความสามารถที่โดดเด่นในด้านการทำงานร่วมกันแบบออนไลน์
                 โดยจะทำงานภายใต้การจัดการไฟล์ผ่านกูเกิลไดรฟ์ ซึ่งจะเป็นการเก็บข้อมูลไว้บนคลาวน์ของกูเกิลเอง </p>
              <div class="text-center font-italic">
                <img src="/img/lesson1/p4.png" width="80%" />
                <p>
                  <br />รูปที่ 4 ภาพรวมและองค์ประกอบของกูเกิลเอกสาร
                </p>
              </div>
              <br />





              <hr />
              <br />
              <br />
              <br />
              <!-- -------------------------------- -->
              <div class="container">
                <div class="row">
                  <div class="col-auto mr-auto">
                    <router-link to="/lesson1_1" title="Lesson1_1 Page">
                      <div class="btn-wrapper">
                        <base-button
                          tag="a"
                          target="_blank"
                          rel="noopener noreferrer"
                          class="mb-3 mb-sm-0"
                          outline
                          type="info"
                          icon="fa fa-chevron-left"
                          >Previous</base-button
                        >
                      </div>
                    </router-link>
                  </div>
                  <div class="col-auto">
                    <div class="btn-wrapper">
                      <base-button
                        tag="a"
                        target="_blank"
                        rel="noopener noreferrer"
                        class="mb-3 mb-sm-0"
                        outline
                        type="info"
                      >
                        Next
                        <i class="fa fa-chevron-right" aria-hidden="true"></i>
                      </base-button>
                    </div>
                  </div>
                </div>
              </div>
            </div>
          </div>
        </div>
      </section>

      <hr />
      <div class="col-lg-center">
        <div class="pt-4 text-center">
          <h5 class="title">
            <span class="d-block mb-1">Author | Assis.Prof. Panuwat Mekha</span>
            <small class="h6 text-black"
              >Lecturer in the Computer Science Division at Maejo
              University</small
            >
          </h5>
        </div>
      </div>
      <hr />
    </div>
  </div>
</template>

<script>
export default {
  name: "home",
  components: {},
};
</script>

<style></style>
