<template>
  <div>
    <div class="position-relative">
      <section class="section-shaped my-0">
        <div class="shape shape-style-1 shape-default">
          <span></span>
          <span></span>
          <span></span>
          <span></span>
          <span></span>
          <span></span>
          <span></span>
          <span></span>
          <span></span>
        </div>

        <div class="container shape-container d-flex">
          <div class="col px-0"></div>
        </div>
      </section>

      <section class="section section-shaped my-0 overflow-hidden">
        <div class="container pt-lg pb-80">
          <div class="row justify-content-center">
            <div class="fontx col-lg-10">
              <!-- -------------------------------- -->
              <h4 class="rem2">
                3.4 การจัดการเรื่องความเป็นส่วนตัว (Privacy management)
              </h4>
              <p class="rem5">
                ความสามารถใช้ดุลยพินิจในการแชร์ข้อมูลของตนเองและผู้อื่นโดยคำนึงถึงความเป็นส่วนตัว
                ในสิ่งที่สำคัญของผู้ใช้สื่อสังคมออนไลน์คือ
                พื้นที่ที่เรารู้สึกว่าเป็นพื้นที่ส่วนตัวจริงๆ
                แล้วมีความเป็นสาธารณะทับซ้อนอยู่ ดังนั้น
                ผู้ใช้สารจะต้องระลึกเสมอว่าเมื่อสิ่งใดทีนำเสนอบนโลกออนไลน์โดยเฉพาะในสื่อสังคมออนไลน์จะเป็นเรื่องสาธารณะ
                ดังนั้น
                การเลือกเรื่องว่าเรื่องไหนควรนำเสนอต่อที่สาธารณะเรื่องไหนที่ควรเก็บไว้เป็นส่วนตัวจึงถือว่าสำคัญมาก
                เพราะสิ่งนี้จะเชื่อมกับการบริหารจัดการข้อมูลที่ผู้ใช้งานมีการทิ้งไว้ร่องรอยบนโลกออนไลน์
                (Digital footprint) เวลาท่านสื่อสารคำพูด การกระทำ ภาพ
                หรือวิดีโอใดบนโลกออนไลน์
                ถูกนำเสนอผ่านทางโลกโซเชียลจะไม่มีความเป็นส่วนตัวหรือเป็นความลับอีกต่อไป
                การคิดวิเคราะห์ก่อนสื่อสารสิ่งใดออกไปจึงสำคัญอย่างยิ่ง และ
                การรักษาความปลอดภัยของตนเอง (Cybersecurity management)
                ยังทำให้ท่านสามารถจัดการเรื่องความเป็นส่วนตัวได้ดีบนโลกออฟไลน์อีกด้วย
              </p>
              <br />
              <h4 class="rem2">
                3.5 การคิดวิเคราะห์อย่างมีวิจารณญาณ (Critical Thinking)
              </h4>
              <p class="rem5">
                ความสามารถในการวิเคราะห์แยกแยะระหว่างข้อมูลที่ถูกต้องและข้อมูลที่ผิด
                เนื้อหาที่ดีและเนื้อหาที่อันตราย
                ข้อมูลติดต่อออนไลน์ที่น่าเชื่อถือและที่น่าสงสัย
                รวมถึงการคิดวิเคราะห์ว่าข้อมูลใดที่สามารถนำไปใช้ในการพัฒนาตนเองเกิดเป็นประโยชน์สูงสุด
                ถือเป็นสิ่งที่สำคัญที่สุดของการเป็นพลเมืองที่มีคุณภาพในยุคดิจิทัล
                เพราะเมื่อท่านต้องเผชิญสถานการณ์ต่างๆ
                บนโลกออนไลน์ท่านต้องใช้ทักษะในการคิดวิเคราะห์และนำไปสู่การตัดสินใจอย่างถูกต้องสูงมาก
                ในกรณีที่ต้องเผชิญกับข้อมูลอย่างมากมายมหาศาลเราจะแยกแยะได้อย่างไรว่าอันไหนจริงอันไหนปลอม
                เพื่อนำไปสู่การตัดสินใจเลือกใช้ข้อมูลแที่เหมาะสมและการส่งต่อข้อมูลสำหรับบุคคลอื่น
                การคิดวิเคราะห์หรือการมีวิจารณญาณในการใช้สื่อดิจิทัลจึงถือเป็นหัวใจที่สำคัญที่สุด
                การคิดวิเคราะห์ไม่ใช่การท่องจำแต่เริ่มต้นจากการตั้งคำถามกับทุกสถานการณ์ที่เผชิญบนโลกออนไลน์
                ซึ่งมีผู้คนหลากหลาย มีข้อมูลมากมาย
                แล้วนำมาประกอบกับการหาข้อมูลเพิ่มเติม
                และจัดการกับปัญหาหรือสถานการณ์ตรงหน้าด้วยสติ
                อันจะนำไปสู่ทางออกอย่างเหมาะสม หรือมีความรู้เท่าทันสื่อดิจิทัล
                (Digital Literacy) นั่นเอง
              </p>
              <p class="rem2 font-weight-bold">
                ท่านจะทำอย่างไรเมื่อมีการติดต่อโดยคนแปลกหน้า
              </p>
              <p class="rem5">
                การติดต่อโดยคนแปลกหน้าดูจะเป็นเรื่องธรรมดาในสื่อเครือข่ายสังคมออนไลน์
                แต่ตอนจบอาจลงเอยด้วยอันตรายที่เกิดขึ้นจริงกับตัว เช่น
                การคุกคามทางเพศ การทำร้ายร่างกาย แต่ก่อนที่จะไปถึงตรงนั้น
                เรามีแนวทางในการยืนยันอัตลักษณ์ของคนที่มาติดต่อเราและค้นหานักต้มตุ๋นออนไลน์
                ดังนี้
              </p>
              <p class="rem7">
                • รูปโปรไฟล์ดูน่าสงสัยหรือไม่:
                เราควรสงสัยคนที่ใช้รูปโปรไฟล์เบลอหรือเห็นไม่ชัดไว้ก่อน
                หรือคนที่แอบเอารูปของคนอื่นที่มีตัวตนจริงๆ มาใช้เป็นรูปโปรไฟล์
              </p>
              <p class="rem7">
                • ชื่อที่แสดงตรงกับบัญชีผู้ใช้หรือเปล่า:
                เราตรวจสอบได้ว่าชื่อที่ใช้แสดงตรงกับชื่อที่ปรากฏในยูอาร์แอลหรือไม่
              </p>
              <p class="rem7">
                • มีรายละเอียดประวัติส่วนบุคคลหรือไม่:
                บัญชีปลอมโดยมากมักจะไม่ค่อยใส่รายละเอียดข้อมูลเกี่ยวกับตัวเองเท่าไหร่
                แต่ถ้ามีรายละเอียด
                ก็ควรตรวจสอบว่ารายละเอียดเหล่านั้นดูเป็นจริงขนาดไหน
              </p>
              <p class="rem7">
                • มีการเปิดใช้บัญชีมานานแค่ไหน:
                บัญชีปลอมมักจะไม่ค่อยมีการโพสต์และปฏิสัมพันธ์มากนัก
                หรือการใช้การวิเคราะห์ในการแยกแยะอันไหนข่าวจริงหรืออันไหนข่าวลวง
              </p>
              <p class="rem7">
                จะเห็นได้ว่าทุกกระบวนการคิดอย่างมีวิจารณญานจะเริ่มต้นด้วยการตั้งคำถาม
                ไม่หลงเชื่อง่ายๆ แล้วแสวงหาข้อมูลหรือรายละเอียดเพิ่มเติม
                แล้วนำข้อมูลทั้งหมดมาประมวล
                วิเคราะห์ด้วยเหตุและผลจนได้ทางออกว่าจะทำอย่างไรกับสถนการณ์ที่เกิดขึ้น
              </p>
              <br />
              <p class="rem2 font-weight-bold">
                ท่านจะทำอย่างไรในการวิเคราะห์ว่าข่าวสารที่ได้รับจริงหรือปลอม
              </p>
              <div class="text-center font-italic">
                <img src="/img/lesson4/5.png" width="60%" />
                <p><br />ภาพที่ 5 how to spot fake news</p>
              </div>
              <br />

              <p class="rem2">
                บ่อยครั้งที่เราจะได้รับข่าวสารผ่านสื่อสังคมออนไลน์
                และมีข้อสงสัยว่าข่าวที่เราได้รับนั้นน่าเชื่อหรือไม่ ? จากข้อมูล
                How to Spot Fake News ของ The International Federation of
                Library Associations and Institutions (IFLA)
                ได้ให้ข้อแนะนำในการตรวจสอบว่าข่าวไหนจริงหรือข่าวไหนปลอมว่าสิ่งแรกที่ต้องทำคือการหยุดคิดพิเคราะห์และตรวจสอบที่มาที่ไป
                อย่าพึ่งหลงเชื่อ
                แต่จะต้องถามกับตัวเองก่อนว่าข่าวที่เห็นนั้นจริงหรือปลอมแน่
                โดยเช็คเข้าไปดูเว็บไซต์หรือข้อมูลที่เกี่ยวข้อง
                หรือเข้าไปตรวจสอบการ comments ต่างๆ ให้หลากหลาย
                ต่อมาคือการพิจารณาเนื้อหาโดยภาพรวมว่าน่าเชื่อถือหรือไม่
                ใครคือผู้เขียน มีตัวตนจริงหรือเปล่า
                และหากเข้าไปสืบค้นข้อมูลที่ลึกมีคนพูดถูกผู้เขียนคนนี้อย่างไร
                เคยมีผลงานอื่นๆ หรือไม่
                มีลิงก์ที่เกี่ยวข้องที่สามารถตรวจสอบเนื้อหาข่าว
                ตรวจสอบวันที่เผยแพร่
                จะต้องดูว่าข่าวนั้นเป็นข่าวที่ล้อเล่นเป็นข่าวทีมีคุณค่า
                หรือเป็นข่าวที่ใช้
              </p>
              <p class="rem2">
                ในการกลั่นแกล้งเยาะเย้ยหรือเสียดสีคนที่ถูกทำให้เป็นข่าวหรือไม่
                และเป็นความจริงหรือไม่ ประการสำคัญที่สุดคือ
                การตรวจสอบอคติของเราต่อบุคคลที่เป็นข่าว
                บางครั้งการแชร์หรือการโพสต์อาจจะเกิดจากความไม่ชอบเป็นการส่วนตัว
                หรือด้วยอารมณ์ความรู้สึก
                ซึ่งไม่ได้เป็นที่มาของการตรวจสอบข้อมูลอย่างชัดเจนก็แชร์ออกไปแบบผิด
                ๆ และอาจจะเป็นการไปตัดสินผู้อื่นอย่างไม่เป็นธรรม
                หากที่สุดแล้วไม่แน่ใจก็อาจจะตรวจสอบอีกครั้งกับผู้รู้หรือผู้เชี่ยวชาญในเรื่องนั้นๆ
                ทั้งนี้เพื่อความถูกต้อง และไม่เป็นการชี้นำในทางที่ผิด
                อีกทั้งยังเป็นความยุติธรรมของผู้ที่ถูกนำข้อมูลมาทำเป็นข่าวปลอมด้วย
              </p>
              <p class="rem2">
                นี่คือตัวอย่างของการคิดแบบมีวิจารณญานในการใช้สื่อออนไลน์
                นอกจากการมองในทางที่เป็นข้อมูลทางลบ
                ในโลกออนไลน์แม้เราจะพบสถานการณ์ที่เป็นความเสี่ยง
                ถือว่าเป็นโจทย์สำคัญในการที่เราสามารถสร้างกระบวนการเรียนรู้ได้ด้วยตนเอง
                การพัฒนาการตั้งคำถามหรือการคิดเชิงวิพากษ์ (Critical Thinking)
                การคิดวิเคราะห์ (Analytical thinking)
                การพัฒนาทักษะการจัดการปัญหา (Problem Solving Skills)
                เพื่อหาแนวทางในการแก้ปัญหาที่เหมาะสม
                และการเรียนรู้ในการตัดสินใจบนข้อมูลที่ถูกต้องบนเหตุและผล
                ถือว่าเป็นทักษะสำคัญอย่างยิ่งสำหรับการเป็นพลเมืองในยุคดิจิทัล
              </p>
              <br />
              <h4 class="rem2">
                3.6 การบริหารจัดการข้อมูลที่ผู้ใช้งานมีการทิ้งไว้บนโลกออนไลน์
                (Digital footprint)
              </h4>
              <p class="rem5">
                เป็นความสามารถในการเข้าใจธรรมชาติของการใช้ชีวิตในโลกดิจิทัล
                นั่นคือทุกอย่างที่เราทำไว้บนโลกออนไลน์จะหลงเหลือร่องรอยข้อมูลทิ้งไว้เสมอ
                รวมถึงการเข้าใจผลลัพธ์ที่อาจจะเกิดขึ้นเพื่อการดูแลสิ่งเหล่านี้อย่างมีความรับผิดชอบ
                Digital Footprint คือ ร่องรอยการกระทำต่าง ๆ
                ที่ฝังหรือตามได้ในโลก Digital ไม่ว่าจะเป็นข่าวที่พูดถึงเรา หรือ
                Blog, การโพสเว็บบอร์ด และ Digital Profile ต่าง ๆ อย่าง Twitter,
                Instagram และ Facebook ซึ่งหลาย ๆ อย่างนั้นเราเปิดเป็นสาธารณะ
                Public และทำให้คนต่าง ๆ
                เข้ามาดูได้และรับรู้ว่าเราเป็นอย่างไรผ่านทาง Digital Footprint
                พวกนี้ ในด้านความปลอดภัยนั้นทำให้เหล่าแฮกเกอร์ (Hacker)
                นั้นสามารถมาเรียนรู้และเดาเรื่องต่าง ๆ หรือสืบเรื่องต่าง ๆ
                ได้ไม่ยาก และเข้าไปเจาะเอาข้อมูลต่าง ๆ เพิ่มเติมมาได้มากมาย
                จนสร้างความเสียหายให้กับคนที่ข้อมูลรั่วได้ เช่น
                การเจาะเข้าไปในข้อมูลทางธนาคารต่าง
                หรือการเจาะเข้าไปในอีเมล์เพื่อสืบหาข้อมูลส่วนตัว ทั้งนี้การสืบ
                Digital Footprint
                นั้นเป็นวิธีการหนึ่งที่องค์กรในยุคใหม่นี้ใช้ทำอะไรหลาย ๆ
                อย่างที่เราคาดไม่ถึงอย่างเช่น การสมัครงานที่หลาย ๆ
                ครั้งนั้นผู้สมัครไม่รู้เลยว่าเมื่อยื่นใบสมัครไปแล้ว HR
                หรือฝ่ายบุคคลหรือคนที่ดูแลเรื่องการรับบุคคลนั้น ๆ
                จะเอาชื่อเราไปค้นหาผ่านทาง Google เพื่อดูว่าคน ๆ นั้นเป็นอย่างไร
                และทัศนคติเป็นอย่างไรเพื่อประกอบการเรียกหรือไม่เรียกสัมภาษณ์
                และการตัดสินใจรับหรือไม่รับเข้าทำงาน
              </p>
              <div class="text-center font-italic">
                <img src="/img/lesson4/6.png" width="80%" />
                <p>
                  <br />ภาพที่ 6 Digital footprint มีผลอย่างไรกับชีวิตของเรา
                </p>
              </div>
              <br />
              <p class="rem5">
                จากภาพด้านบนได้อธิบายว่าการที่เราทำอะไรไว้บนโลกออนไลน์อาจจะโดยไม่ได้ยั้งคิดจะทิ้งร่องรอยต่างๆ
                ไว้เสมอ หากข้อมูลนั้นได้ถูกกลับนำมาตรวจสอบพฤติกรรมของเราอีกครั้ง
                ไม่ว่าจะเป็น
                ชื่อเสียงหรือภาพลักษณ์บนโลกออนไลน์และบนโลกของความเป็นจริง
                พฤติกรรมที่เราแสดงออกบนโลกออนไลน์ยังส่งผลต่อความสัมพันธ์ของเรากับเพื่อน
                ครอบครัว รวมถึงบุคคลอื่นๆที่เกี่ยวข้อง
                และอาจจะส่งผลถึงชื่อเสียงของครอบครัว เพื่อน
                หรือสถาบันการศึกษาที่เราศึกษาอยู่
                รวมถึงญาติมิตรที่มีความเกี่ยวข้องกับเราอีกด้วย
              </p>
              <div class="text-center font-italic">
                <img src="/img/lesson4/7.png" width="40%" />
                <p><br />ภาพที่ 7 คำอธิบายร่องรอยดิจิทัล</p>
              </div>
              <br />

              <p class="rem5">
                จากภาพด้านบนอธิบายรูปแบบของ Digital Footprint
                หรือร่องรอยดิจิทัลมีสองรูปแบบ คือ ร่องรอยดิจิทัลแบบบแพสซีพ
                (passive digital footprint)
                เป็นร่องรอยที่ผู้ใช้สื่อได้ทิ้งไว้โดยไม่ได้ตั้งใจ เช่น
                การเข้าไปท่องเว็บไซต์ต่างๆ ส่วนร่องรอยแบบแอคทีฟ (active digital
                footprint) คือ ร่องรอยที่ทิ้งไว้โดยตั้งใจ ดังนั้น การส่งอีเมล์
                หรือ การโพสต์เรื่องราวส่วนตัวบนอินสตาแกรม หรือแฟสบุ๊ก
                การเข้าไปกด like หรือแชร์ข้อความหรือเนื้อหาต่างๆ
                ซึ่งสิ่งเหล่านี้อาจจะส่งผลกระทบต่อการทำงานและการดำเนินชีวิตของเราในอนาคตหากเราไม่ยั้งคิดในเรื่องการสื่อสาร
              </p>
              <br />

              <p class="rem5 font-italic font-weight-bold">
                *** ดังนั้น เมื่อความเป็นส่วนตัวเปลี่ยนไปในโลกยุคใหม่
                พลเมืองดิจิทัลจึงต้องทำความเข้าใจกับประเด็นนี้
                และเรียนรู้วิธีคุ้มครองความเป็นส่วนตัวของเรา
                หลักการทั่วไปมีดังนี้ ***
              </p>
              <br />

              <p class="rem7">
                • คิดยาวๆ ก่อนโพสต์:
                ทุกสิ่งที่เราโพสต์ในโลกออนไลน์จะทิ้งร่องรอยดิจิทัลเอาไว้
                ซึ่งสิ่งเหล่านี้อาจแพร่กระจายไปถึงคนนับหมื่นนับแสนได้
                และถูกค้นพบได้แม้เวลาจะผ่านไปนานแค่ไหนก็ตาม
                ดังนั้นถ้าเราไม่อยากให้คนเห็นสิ่งที่โพสต์ในอนาคต
                เราก็อย่าโพสต์มันในวันนี้
              </p>
              <p class="rem7">
                • อย่าแชร์ข้อมูลส่วนบุคคล:
                เรียนรู้ว่าข้อมูลอะไรที่ควรเก็บเอาไว้ในพื้นที่ส่วนตัว เช่น
                ที่อยู่ เบอร์โทรศัพท์ วันเกิด
              </p>
              <p class="rem7">
                • อ่านนโยบายความเป็นส่วนตัวและเรียนรู้วิธีการตั้งค่า:
                บริการออนไลน์แต่ละแห่งนั้นมีนโยบายและวิธีตั้งค่าความเป็นส่วนตัวแตกต่างกัน
                เราควรอ่านนโยบายและเรียนรู้วิธีตั้งค่าให้ละเอียดก่อนใช้งาน
              </p>
              <p class="rem7">
                • คำนึงอยู่เสมอว่าอินเทอร์เน็ตเป็นพื้นที่สาธารณะ (public)
                มากกว่าเป็นพื้นที่ส่วนตัว (private):
                กระทั่งข้อมูลที่เป็นส่วนตัวก็สามารถถูกลอกเลียน ทำซ้ำ ปรับเปลี่ยน
                และส่งต่อไปสู่พื้นที่สาธารณะได้
                รวมถึงเครื่องมือค้นหาอันก้าวหน้ายังทำให้ใครก็ตามสามารถสืบค้นข้อมูลดังกล่าวได้
              </p>
              <p class="rem7">
                • เคารพความเป็นส่วนตัวของผู้อื่น: การโพสต์ถึงคนอื่น
                การแชร์ข้อความของเขา หรือการแท็กชื่อในภาพ
                อาจกระทบกับความเป็นส่วนตัวของผู้อื่นได้ ดังนั้นหากไม่แน่ใจ
                ให้สอบถามผู้อื่นก่อนว่าพวกเขารู้สึกอย่างไร
              </p>

              <p class="rem2">
                โดยเฉพาะในโลกปัจจุบัน การแสดงความคิดเห็น
                แสดงตัวตนบนโลกออนไลน์นั้นสะท้อนถึงทัศนคติ การแก้ไขปัญหา
                การควบคุมอารมณ์ พฤติกรรมที่อาจจะส่อไปในทางก้าวร้าว
                หรือพฤติกรรมที่หมิ่นเหม่ต่อศีลธรรม ดังนั้นก่อนที่จะดำเนินการใดๆ
                บนโลกออนไลน์จะต้องมีการคิดวิเคราะห์ แยกแยะ
                และใช้สติในการดำเนินชีวิตบนโลกออนไลน์ที่ไม่ใช่แค่ปลอดภัยแต่ควรเป็นไปในทางสร้างสรรค์เพื่อประโยชน์ของตัวเราเองและผู้อื่นด้วย
              </p>

              <p class="rem2 font-weight-bold">
                ความสำคัญของการเอาใจเขามาใส่ใจเรา
              </p>
              <p class="rem5">
                • การเห็นอกเห็นใจผู้อื่น
                ทำให้คนเราสามารถเข้าใจและปรองดองกับคนอื่นได้
                และเป็นวิธีที่ช่วยให้เราตอบสนองต่อสถานการณ์ทางสังคมได้อย่างเหมาะสม
              </p>
              <p class="rem5">
                • หากเราเข้าใจผู้อื่น เราก็สามารถควบคุมอารมณ์ของตัวเองได้
                ในกรณีของสถานการณ์การรังแกกันบนโลกออนไลน์
                ในการที่เราเป็นผู้ถูกกระทำ เรามองเห็นการกระทำ
                หรือการที่เรากำลังตัดสินใจกระทำ หากเราเข้าใจในสถารณ์ที่เกิดขึ้น
                เราไปถึงความรู้สึกของผู้อื่น เข้าใจที่มาของปัญหาของการกระทำนั้นๆ
                ก็จะทำให้เราได้หยุดทบทวน
                หันมาใช้สติในการแก้ไขปัญหามากกว่าใช้อารมณ์ในการตอบโต้
                ความสามารถในการควบคุมอารมณ์ของตัวเองจะช่วยให้คนเราผ่านสถานการณ์ตึงเครียดได้
                และสามารถหาทางออกในทางสร้างสรรค์ได้อีกด้วย
              </p>
              <p class="rem5">
                • เราจะช่วยเหลือผู้อื่นได้มากขึ้น
                ไม่เพียงแต่เราจะทำความเข้าใจอารมณ์ของคนอื่นได้แล้ว
                เรายังสามารถเข้าใจปัญหาและหยิบยื่นมือช่วยเหลือคนอื่นได้ด้วย
                ข้อนี้เป็นมากกว่าทักษะการเข้าสังคมเพื่อช่วยเหลือตัวเอง
                แต่เป็นการเข้าใจผู้อื่นเพื่อช่วยเหลือมนุษย์ด้วยกัน
              </p>
              <p class="rem2">
                การเห็นอกเห็นใจ
                และการเอาใจเขามาใส่ใจจึงควรเป็นพื้นฐานสำคัญของพลเมืองในยุคดิจิทัล
                เพราะหากเราอยู่ด้วยความเห็นอกเห็นใจโดยผสมผสานกับกระบวนการคิดอย่างมีเหตุมีผลก็ทำให้การใช้สื่อออนไลน์ไปในทางที่เป็นประโยชน์และพัฒนาให้เกิดพลเมืองที่มีคุณภาพในยุคดิจิทัล
              </p>
              <br />

              <h4 class="rem2">สรุป</h4>
              <p class="rem5">
                ในยุคดิจิทัลที่ทุกอย่างเป็นไปอย่างเร็วแรงและทันทีทันใด
                การใช้สติและการคิดได้อย่างรวดเร็วถือว่าสำคัญอย่างยิ่ง
                ซึ่งจะต้องมาจากความเข้าใจต่อหลักการพื้นฐานของสื่อดิจิทัล
                การสร้างกระบวนพัฒนาบนโลกออนไลน์
                หรือสร้างพลเมืองยุคใหม่ที่เป็นนักสื่อสารดิจิทัลที่มีคุณภาพ
                สิ่งสำคัญคือ
                การดำเนินชีวิตบนโลกออฟไลน์หรือการเรียนรู้บนโลกที่เป็นจริงก็ต้องได้รับการฝึกฝนให้ดีควบคู่กันไป
                โดยหลักการสำคัญได้แก่
              </p>
              <p class="rem5">
                1. การสื่อสารและปฏิสัมพันธ์ (Communication and Interactive)
                ทักษะพื้นฐานสำคัญที่ถูกมองข้ามเสมอ
                แต่นี่คือทักษะที่จำเป็นของพลเมืองดิจิทัล
                เพราะยิ่งพวกเขาอยู่ในโลกดิจิทัลมากเท่าไหร่
                ทักษะเหล่านี้ก็ยิ่งขาดมากขึ้นเท่านั้น
                หรือถ่ายทอดสิ่งที่คิดไปยังผู้อื่นได้อย่างชัดเจนและเหมาะสม
                การสื่อสารตรงประเด็น ถูกต้อง เคารพความหลากหลาย
                สื่อสารกันด้วยเหตุผล และปราศจากความรุนแรง หรือการทำร้ายผู้อื่น
                สื่อสารด้วยการหนุนเสริมแรงบวก ให้กำลังใจกัน (Digital
                Empowerment)
                ถือว่าเป็นหัวใจสำคัญยิ่งในการสื่อสารที่ทรงอิทธิพลและสร้างนิเวศน์ที่ดีในยุคดิจิทัล
              </p>
              <p class="rem5">
                2. ทักษะการแก้ไขปัญหา (Problem Solving)
                การแก้ปัญหาของเด็กในโลกออนไลน์กับชีวิตจริงมีความแตกต่างกันมาก
                ยกตัวอย่าง เมื่อมีการทะเลาะกันบนโลกออนไลน์อาจจะบล็อกกัน
                หรืออาจทะเลาะกันผ่านคีย์บอร์ด แต่ในโลกชีวิตจริงทำแบบนั้นไม่ได้
                เพราะฉะนั้น ต้องฝึกใช้ไหวพริบในการจัดการกับปัญหาที่เกิดขึ้น
                รวมไปถึงการแก้ปัญหาเฉพาะหน้า การคิดวิเคราะห์
                และการเผชิญกับความจริง
                ก็จะทำให้เกิดการเรียนรู้และพัฒนาทักษะการจัดการปัญหาได้ดีมากขึ้น
                ในกรณีที่ไม่สามารถจัดการปัญหาตัวเองได้หลังจากได้พยายามแล้วจึงควรเลือกที่จะปรึกษาผู้ทีมีความเชี่ยวชาญหรือผู้ที่สามารถชี้แนะทางออกที่ดีให้ได้
                การเผชิญสถานการณ์ด้วยตนเองและเลือกวิธีการในการจัดการปัญหาที่สร้างสรรค์
                ซึ่งเป็นคุณลักษณะที่พึงประสงค์ในยุคดิจิทัล
              </p>
              <p class="rem5">
                3. ความคิดสร้างสรรค์ (Creativity) ความคิดสร้างสรรค์
                เป็นทักษะสำคัญแห่งศตวรรษที่ 21
                เป็นทักษะที่นำมาซึ่งผลงานการคิดค้นสิ่งใหม่ นวัตกรรมใหม่ๆ
                และเป็นสิ่งที่ทำให้มนุษย์เราแตกต่างจากหุ่นยนต์ที่กำลังจะเข้ามาแทนที่
                การเรียนรู้สิ่งใหม่บนโลกออนไลน์
                หรือแม้แต่การพยายามจัดการความท้าทายบางอย่างที่ต้องเผชิญบนโลกออนไลน์และออฟไลน์โดนปราศจากความกลัวหรือเกรงว่าแก้ไขแล้วจะผิด
                การลองผิดลองถูกจะเป็นการฝึกการวิเคราะห์ การค้นหาคำตอบ ทดลอง
                ซึ่งถือเป็นพื้นฐานในการสร้างสรรค์และพัฒนาสิ่งใหม่ๆ อีกด้วย
              </p>
              <p class="rem5">
                4. การเรียนรู้ด้วยตนเอง (Growth Mindset)
                เพราะความรู้ใหม่เกิดขึ้นตลอดเวลา ถ้าหยุดการเรียนรู้
                ก็เท่ากับหยุดพัฒนาตัวเอง
                และความรู้ในยุคนี้ไม่ได้จำกัดอยู่แค่ห้องเรียนเท่านั้น
                มนุษย์ทุกคนถ้าไม่อยากถูกเทคโนโลยีกลืนหายไป
                จำเป็นต้องมีทักษะในการเรียนรู้สิ่งใหม่ ๆ ด้วยตนเอง
                ในความเป็นจริงโลกออนไลน์ได้ให้โอกาสในการพัฒนากระบวนการเรียนรู้ตลอดชีวิตได้เป็นอย่างดีทั้งทักษะในการค้นคว้าหาข้อมูล
                ทักษะในการแก้ไขปัญหาต่างๆ จากสถานการณ์บนโลกออนไลน์
                หรือการเห็นต้นแบบเพื่อพัฒนาไปสู่การพัฒนาตนเองอย่างไม่มีที่สิ้นสุด
                การได้แก้ไขปัญหาบ่อยๆ
                พบเจอกับงานที่ยุ่งยากและมีพลังใจในการแก้ไขปัญหาที่อาจจะท้าทายอย่างต่อเนื่องจะเป็นพลังสำคัญในการทำให้เกิดการอยากเรียนรู้ด้วยตนเองอย่างไม่มีที่สิ้นสุด
                ยิ่งหากได้การเสริมแรงจากคนรอบข้างการให้กำลังใจจะทำให้ข้ามผ่านเรื่องยากๆ
                ไปให้ได้
                ก็จะเป็นพื้นฐานในการพัฒนาการเรียนรู้ด้วยตนเองยิ่งแข็งแกร่งมากขึ้น
              </p>
              <br />

              <p class="rem2 font-italic">
                หากพลเมืองในยุคดิจิทัลมีคุณสมบัติต่างๆ
                ตามที่กล่าวไปข้างต้นก็จะนำไปสู่การใช้สื่อดิจิทัลให้เกิดประโยชน์
                การนำมาใช้ในการเพิ่มโอกาสพัฒนาตนเองและสังคม และแก้ไขปัญหาต่างๆ
                อย่างสร้างสรรค์
                หากผู้ใช้เทคโนโลยีเป็นผู้มีความชาญฉลาดและมีมนุษยธรรม
                เปี่ยมไปด้วยการใช้สติปัญญาและมีความเห็นอกเห็นใจคนอื่น
                เทคโนโลยีดิจิทัลก็จะถูกนำมาใช้พัฒนาให้เกิดคุณประโยชน์อันอเนกอนันต์แก่มวลมนุษยชาติอย่างแน่นอน
              </p>
              <!-- -------------------------------- -->
              <br />
              <br />
              <br />
              <br />
              <div class="container">
                <div class="row">
                  <div class="col-auto mr-auto">
                    <router-link to="/lesson4_2" title="Lesson4_2 Page">
                      <div class="btn-wrapper">
                        <base-button
                          tag="a"
                          target="_blank"
                          rel="noopener noreferrer"
                          class="mb-3 mb-sm-0"
                          outline
                          type="info"
                          icon="fa fa-chevron-left"
                          >Previous</base-button
                        >
                      </div>
                    </router-link>
                  </div>
                  <div class="col-auto">
                      <router-link to="/lesson5_1" title="Lesson5_1 Page">
                    <div class="btn-wrapper">
                      <base-button
                        tag="a"
                        target="_blank"
                        rel="noopener noreferrer"
                        class="mb-3 mb-sm-0"
                        outline
                        type="info"
                      >
                        Continue
                        <i class="fa fa-chevron-right" aria-hidden="true"></i>
                      </base-button>
                    </div>
                    </router-link>
                  </div>
                </div>
              </div>
              <div class="text-center mt-5">Page 3/3</div>
            </div>
          </div>
        </div>
      </section>

      <hr />
      <div class="col-lg-center">
        <div class="pt-4 text-center">
          <h5 class="title">
            <span class="d-block mb-1">Author | Dr.Sujittra Kaewseenuald</span>
            <small class="h6 text-black"
              >Lecturer in the Digital Communications at Maejo University</small
            >
          </h5>
        </div>
      </div>
      <hr />
    </div>
  </div>
</template>

<script>
export default {
  name: "home",
  components: {},
};
</script>

<style></style>
