<template>
  <div>
    <div class="position-relative">
      <section class="section-shaped my-0">
        <div class="shape shape-style-1 shape-default">
          <span></span>
          <span></span>
          <span></span>
          <span></span>
          <span></span>
          <span></span>
          <span></span>
          <span></span>
          <span></span>
        </div>

        <div class="container shape-container d-flex">
          <div class="col px-0"></div>
        </div>
      </section>

      <section class="section section-shaped my-0 overflow-hidden">
        <div class="container pt-lg pb-80">
          <div class="row justify-content-center">
            <div class="fontx col-lg-10">
              <!-- -------------------------------- -->
                <h4>ลักษณะของหุ่นยนต์</h4>
              <p class="rem2">หุ่นยนต์อาจถูกแบ่งออกเป็น 2 ประเภทตามลักษณะการใช้งาน คือ</p>
              <p
                class="rem5"
              >1. หุ่นยนต์ชนิดที่ติดตั้งอยู่กับที่ (fixed robot) เป็นหุ่นยนต์ที่ไม่สามารถเคลื่อนที่ไปไหนได้ด้วยตัวเอง มีลักษณะเป็นแขนกล สามารถขยับและเคลื่อนไหวได้เฉพาะแต่ละข้อต่อ ภายในตัวเองเท่านั้น มักนำไปใช้ในโรงงานอุตสาหกรรม เช่นโรงงานประกอบรถยนต์</p>
              <p
                class="rem5"
              >2. หุ่นยนต์ชนิดที่เคลื่อนที่ได้ (mobile robot) หุ่นยนต์ประเภทนี้จะแตกต่างจากหุ่นยนต์ที่ติดตั้งอยู่กับที่ เพราะสามารเคลื่อนที่ไปไหนมาไหนได้ด้วยตัวเอง โดยการใช้ล้อหรือการใช้ขา ซึ่งหุ่นยนต์ประเภทนี้ปัจจุบันยังเป็นงานวิจัยที่ทำการศึกษาอยู่ภายในห้องทดลอง เพื่อพัฒนาออกมาใช้งานในรูปแบบต่าง ๆ เช่นหุ่นยนต์สำรวจดาวอังคาร ขององค์การนาซ่า หุ่นยนต์ที่สามารถเคลื่อนที่ได้ด้วยตัวเอง แบ่งได้เป็น 4 ประเภท คือ</p>

              <p
                class="rem7"
              >2.1 หุ่นยนต์เคลื่อนที่ด้วยขา หุ่นยนต์ประเภทนี้ต้องมีโครงสร้างขาแข็งแรงพอที่จะรองรับน้ำหนักตัวของหุ่นยนต์เอง และมีข้อต่อและกลไกที่ดีสำหรับการเดิน หรือกี่ระโดดได้ หุ่นยนต์ เคลื่อนที่ขาสามารถแบ่งได้หลายชนิด เช่น หุ่นยนต์ที่มีเพียงขาเดี่ยว หุ่นยนต์ที่มี 2 ขา</p>
              <p
                class="rem7"
              >2.2 หุ่นยนต์เคลื่อนที่ด้วยล้อมีโครงสร้างที่ง่ายและสามารถเคลื่อนที่ไปบนพื้นผิวได้หลายรูปแบบ ส่วนใหญ่มักใช้สำรวจบนพื้นที่ที่เข้าไปสำรวจยาก ตัวอย่างเช่น หุ่นยนต์สำรวจบนดาวอังคาร</p>
              <p
                class="rem7"
              >2.3 หุ่นยนต์เคลื่อนที่ใต้น้ำ ประกอบด้วย ตัวขับเคลื่อนที่ทำให้หุ่นยนต์สามารถเคลื่อนที่ในน้ำได้สะดวก และระบบโซนาร์ที่ทำหน้าที่รับข้อมูลจากสภาพแวดล้อมภายนอก หรือสามารถติดต่อสื่อสารระหว่างหุ่นยนต์ด้วยกันได้ มักจะนำมาใช้สำรวจพื้นที่ใต้น้ำที่อันตราย หรือพื้นที่ที่มนุษย์ไม่สามารถเข้าถึงได้ ตัวอย่างเช่น หุ่นยนต์สำรวจใต้น้ำ</p>
              <p
                class="rem7"
              >2.4 หุ่นยนต์เคลื่อนที่ทำงอากาศ หุ่นยนต์ที่สามารถเคลื่อนที่ทำงอากาศได้ จะจำลองมาจากยานพาหนะทางอากาศ เช่น เครื่องบิน และเฮลิคอปเตอร์ จุดเด่นของหนุ่นยนต์ชนิดนี้คือสามารถนำไปใช้สำรวจพื้นที่ทางอากาศ หรือนำมาใช้สำหรับปฏิบัติการช่วยเหลือกรณีพิเศษต่าง ๆ ตัวอย่างเช่นหุ่นยนต์เครื่องบิน หุ่นยนต์เฮลิคอปเตอร์</p>
              <p
                class="rem7"
              >2.5 หุ่นยนต์ประเภทอื่น ๆ เช่น หุ่นยนต์ที่สามารถปรับเปลี่ยนตัวเองได้ เป็นหุ่นยนต์ที่สามารถกำหนดรูปร่างของตัวเองให้เหมาะสมกับสภาพแวดล้อมหรือการทำงานได้ เช่น หุ่นยนต์ Super Bot</p>
              <br />
              <h4>การเคลื่อนที่ของหุ่นยนต์</h4>
              <p
                class="rem2"
              >โครงการสารานุกรมไทยสำหรับเยาวชน โดยพระราชประสงค์ในพระบาทสมเด็จพระเจ้าอยู่หัว. (2554). ได้กล่าวถึง การเคลื่อนที่ของหุ่นยนต์ ไว้ดังนี้</p>
              <p
                class="rem2"
              >การเคลื่อนที่(locomotion) หมายถึง การกระทำด้วยกำลัง เพื่อให้เกิดการเคลื่อนที่จากที่หนึ่งไปยังอีกที่หนึ่ง ส่วนใหญ่แล้วการเคลื่อนที่ของหุ่นยนต์จะพิจารณาออกแบบตามวัตถุประสงค์ของการใช้งาน และสภาพการทำงานของหุ่นยนต์เป็นสำคัญ หากหุ่นยนต์ใช้ในโรงงานอุตสาหกรรม ซึ่งงานส่วนใหญ่เป็นงานที่ทำในขอบเขตจำกัด การเคลื่อนที่ของหุ่นยนต์ก็ไม่มีความจำเป็น จึงออกแบบให้มีลักษณะเป็นแขนกลชนิดติดตั้งอยู่กับที่แต่หากเป็นงานเชิงสำรวจงานตรวจการณ์ หรือมีขอบเขตการทำงานกว้าง และต้องเคลื่อนที่ไปยังตำแหน่งต่าง ๆ ก็จะออกแบบหุ่นยนต์ให้สามารถเคลื่อนที่ได้</p>
              <p
                class="rem2"
              >ความสามารถในการเคลื่อนที่(mobility) หมายถึง ความสามารถของระบบขับเคลื่อนที่จะนำพาหุ่นยนต์ให้เคลื่อนที่ไปบนพื้นผิว และผ่านสิ่งกีดขวางต่าง ๆ</p>
              <br />
              <h4>ประเภทการเคลื่อนที่ของหุ่นยนต์</h4>
              <p
                class="rem2"
              >1) การเคลื่อนที่โดยใช้ล้อ (Wheel-drive locomotion) คือหุ่นยนต์ที่ใช้ล้อในการเคลื่อนที่เหมาะสำหรับหุ่นยนต์ทั่วไปที่ใช้งานบนพื้นราบ ซึ่งมีข้อดี คือ หุ่นยนต์สามารถเคลื่อนที่ได้อย่างรวดเร็ว มีการควบคุมง่าย ดังนั้นส่วนใหญ่หุ่นยนต์จึงถูกสร้างให้เคลื่อนที่โดยใช้ล้อแต่ข้อจำกัดของการเคลื่อนที่ในลักษณะนี้คือหุ่นยนต์ไม่สามารถไปในพื้นที่ต่างระดับได้ และการเดินทางในพื้นที่ขรุขระเป็นไปอย่างยากลำบาก</p>
              <p
                class="rem2"
              >2) การเคลื่อนที่โดยใช้ล้อสายพาน (Track-drive locomotion)คือหุ่นยนต์ที่ใช้ล้อสายพานในการเคลื่อนที่เหมาะสำหรับหุ่นยนต์ที่ใช้งานในพื้นที่ขรุขระ หรือพื้นที่ที่มีความต่างระดับ ส่วนการควบคุมสามารถทำได้ง่ายเหมือนหุ่นยนต์ที่ใช้ล้อทั่วไป แต่มีข้อจำกัดคือไม่สามารถเคลื่อนที่ด้วยความเร็วสูง และอาจก่อให้เกิดความเสียหายต่อพื้นผิวบริเวณที่หุ่นยนต์เคลื่อนที่ไปเนื่องจากการตะกุยของล้อสายพาน</p>
              <p
                class="rem2"
              >3) การเคลื่อนที่โดยใช้ขา (Legged locomotion) คือหุ่นยนต์ที่ใช้ขาในการเคลื่อนที่โดยเลียนแบบจากสิ่งมีชีวิต เช่น หุ่นยนต์เดิน 4 ขาหรือหุ่นยนต์เดิน 2 ขา ข้อดี คือหุ่นยนต์สามารถไปได้ในทุกที่หรือทุกสภาพพื้นผิว สามารถก้าวข้ามผ่านสิ่งกีดขวางต่าง ๆ ได้ และมีความสามารถในการเคลื่อนที่ดีกว่าล้อส่วนข้อจำกัดคือการเคลื่อนที่ช้า การควบคุมทำได้ยากลำบากกว่าการเคลื่อนที่แบบใช้ล้อมาก และการรักษาสมดุลเป็นสิ่งที่จำเป็นมากสำหรับหุ่นยนต์ประเภทนี้ โดยเฉพาะหุ่นยนต์ที่ใช้ 2 ขาในการเคลื่อนที่</p>
              <p
                class="rem2"
              >4) การเคลื่อนที่โดยการบิน (Flight locomotion) คือหุ่นยนต์ที่ใช้ปีก หรือใบพัดในการเคลื่อนที่หรือเรียกว่า หุ่นยนต์บิน ข้อดีของหุ่นยนต์ บินคือเคลื่อนที่ได้รวดเร็ว และสามารถเข้าไปในพื้นที่เสี่ยงภัย หรือพื้นที่ที่เข้าถึงได้ยาก ซึ่งงานส่วนใหญ่ของหุ่นยนต์ประเภทนี้คือการสำรวจ หรือการตรวจการณ์ แต่มีข้อควรระวังคือเนื่องจากหุ่นยนต์ บินมีระยะในการปฏิบัติงานได้ค่อนข้างไกล การควบคุมจากระยะไกลจึงเข้ามามีบทบาทอย่างมากหากมีระบบการควบคุมไม่ดีพออาจทำให้เกิดความเสียหายต่อหุ่นยนต์ได้</p>
              <p class="rem2">
                5) การเคลื่อนที่ในน้ำ (Swimming locomotion) คือหุ่นยนต์ที่ใช้ใบพัดหรือครีบในการเคลื่อนที่และมีถังอับเฉาใช้ในการควบคุมการลอยตัวของหุ่นยนต์ ได้แก่ หุ่นยนต์ปลา และหุ่นยนต์เรือดำน้ำ ซึ่งส่วนใหญ่ใช้ในงานสำรวจ แต่เนื่องจากการควบคุมของการเคลื่อนที่ในน้ำนั้น ไม่สามารถใช้ภาพในการนำทางได้ จึงต้องใช้อุปกรณ์ ตรวจรู้อย่างอื่นมานำทางแทน เช่น ระบบการสะท้อนกลับของคลื่นเสียง ทำให้การควบคุมต้องมีความระมัดระวังเป็นอย่างมาก
                หุ่นยนต์เคลื่อนที่บนผิวน้ำ ในการเคลื่อนที่ของหุ่นยนต์ต้องคำนึงถึงวิธีการหรือรูปแบบของการเคลื่อนที่ด้วยเหตุผลหลายประการเช่น เพื่อให้เกิดการใช้พลังงานในการเคลื่อนที่ต่ำที่สุด เพื่อให้หุ่นยนต์มีความสามารถในการหลบหลีกสิ่งกีดขวางหรือเพื่อให้เกิดเสถียรภาพในขณะเคลื่อนที่
              </p>
              <p
                class="rem2"
              >6) การเคลื่อนที่รูปแบบอื่น (Other locomotion) คือหุ่นยนต์ที่ไม่ใช้ขาและล้อในการเคลื่อนที่เช่น หุ่นยนต์งูจะใช้การรวมแรงลัพธ์ที่เกิดจากการบิดเคลื่อนที่ไปมาในแต่ละข้อ ขับดันให้เคลื่อนที่ไปข้างหน้า ข้อดีของหุ่นยนต์ประเภทนี้คือสามารถไปได้ในทุกสภาพพื้นผิว ทั้งยังสามารถขึ้นที่สูง และเข้าไปในที่แคบ ๆ ได้ จึงสามารถปฏิบัติงานได้อย่างหลากหลาย และข้อดีอีกอย่างคือในแต่ละข้อต่อของหุ่นยนต์ที่ประกอบกันจะเหมือนกันดังนั้นถ้าข้อต่อใดเกิดความเสียหายขึ้น จะสามารถทดแทนด้วยข้อต่ออื่นได้ทันที</p>
              <br />
              <h4>การรับรู้และการกระท้าของหุ่นยนต์</h4>
              <p class="rem2">หุ่นยนต์จะสามารถทำงานด้วยตนเองได้ จะต้องมีส่วนประกอบสำคัญ 3 ส่วน คือ</p>
              <p class="rem5">1. ส่วนการรับรู้ข้อมูลด้วย (Sensor)</p>
              <p class="rem5">2. ส่วนของการกระทำด้วย (Effector)</p>
              <p class="rem5">3. ส่วนระบบควบคุม (Control System)</p>

              <br />
              <br />
              <p
                class="rem2"
              >1. ส่วนการรับรู้ข้อมูลด้วย (Sensor) เป็นส่วนที่ทำให้หุ่นยนต์สามารถรับรู้ จากสภาพแววดล้อมภายนอกขณะนั้นได้ หุ่นยนต์สามารถรับรู้ข้อมูลจากสภาพแวดล้อมด้วย Sensor โดยลักษณะการรับรู้ของหุ่นยนต์ได้ต้นแบบมาจากพื้นฐานการรับรู้ของมนุษย์ 5</p>
              <table class="table">
                <thead>
                  <tr>
                    <th scope="col">ประเภทของการรับรู้</th>
                    <th scope="col">Sensor ของหุ่นยนต์</th>
                  </tr>
                </thead>
                <tbody>
                  <tr>
                    <th scope="row">การมองเห็น (Vision)</th>
                    <td>กล้อง กล้องอินฟราเรด และSensor ตรวจจับรังสี</td>
                  </tr>
                  <tr>
                    <th scope="row">การได้ยิน (Audition)</th>
                    <td>ไมโครโฟน</td>
                  </tr>
                  <tr>
                    <th scope="row">การรับรส (Gustation)</th>
                    <td>Sensor ตรวจจับเคมี</td>
                  </tr>
                  <tr>
                    <th scope="row">การดมกลิ่น (Olfaction)</th>
                    <td>Sensor ตรวจจับเคมี</td>
                  </tr>
                  <tr>
                    <th scope="row">การสัมผัส (Tactition)</th>
                    <td>Sensor ตรวจจับการกระทบ</td>
                  </tr>
                </tbody>
              </table>
              <br />
              <p
                class="text-center font-italic"
              >ตาราง : ความสัมพันธ์ระหว่างประเภทการรับรู้กับ Sensor ของหุ่นยนต์</p>
              <br />
              <p
                class="rem2"
              >2. ส่วนของการกระท้าด้วย Effector เป็นส่วนที่แสดงการกระทำของหุ่นยนต์ เพื่อตอบสนองกลับไปยังสภาพแวดล้อมได้ทันที หุ่นยนต์สามารถกระทำ (Act) เพื่อตอบสนองกลับไปยังสภาพแวดล้อมได้ โดยผ่านEffector ที่หลากหลาย ซึ่งขึ้นอยู่กับวัตถุประสงค์ของหุ่นยนต์แต่ลประเภท เช่น มือหุ่นยนต์ สามารถกระทำการหยิบจับ ทุบุหรือปล่อย เป็นต้น</p>
              <p
                class="rem2"
              >3. ส่วนระบบควบคุม (Control System) เป็นส่วนควบคุมการทำงานภายในหุ่นยนต์ ทั้งหมด ระบบควบคุม จะทำหน้าที่แทนความคิดและตัดสินในของหุ่นยนต์ โดยจะต้องรับข้อมูลจากสภาพแวดล้อมภายนอก ผ่านส่วนที่เป็น Sensor ก่อนนำมาคิดประมวลผล หรือตัดสินใจว่าควรตอสนองอะไรกลับไปยังสภาพแวดล้อมก่อนที่จะส่งไปยัง Effector เพื่อกระทำต่อไป และหุ่นยนต์จะสามารถทาบผลของการกระทำของตัวเองผ่าน Sensor และนำไปคิดตัดสินใจต่อไปได้ไม่มีที่สิ้นสุด โดยกระบวนการดังกล่าวเรียกว่า “Closed Loop”</p>
              <br />
              <div class="text-center font-italic col">
                <img src="/img/lesson9/i8.png" width="80%" />
                <p>
                  <br />Closed Loop บนแนวคิดกระบวนการ Closed
                </p>
              </div>
              <br />
              <h4>ระบบควบคุมหุ่นยนต์ปัจจุบันจะมีสถาปัตยกรรมการควบคุม พื้นฐาน 2 ประเภท</h4>
              <p
                class="rem2"
              >1) Reactive Control เป็นรูปแบบสถาปัตยกรรมการควบคุมที่ง่ายที่สุด โดยไม่ได้ นำเทคนิคปัญญาประดิษฐ์มาใช้ ระบบควบคุมจะตอบสนองผ่าน Effector ทันทีที่ได้รับข้อมูลมา จาก Sensor โดยผ่านตัวควบคุมที่มีชื่อว่า Sensor/Effector Mapping เช่น กรณีหุ่นยนต์มองเห็น ทางข้างหน้า หากพบว่ามีหลุมบ่อ หุ่นยนต์อาจจะหยุดหรือเดินหลีกเลี่ยงหาเส้นทางอื่นเดินต่อไป</p>

              <h5>ข้อดีของรูปแบบสถาปัตยกรรมแบบนี้</h5>
              <p
                class="rem2"
              >คือ เป็นวิธีที่ง่ายและตอบสนองกลับอย่างง รวดเร็ว เนื่องจากหุ่นยนต์รับข้อมูลจาก Sensor โดยตรงแล้วนำไปกระทำเพื่อตอบสนองกลับไปยัง สภาพแวดล้อมทันที โดยไม่มีการเก็บบันทึกข้อมูลที่รับมาก่อนหน้านี้ ทำให้สามารถรองรับกับ สภาพแวดล้อมที่เป็นแบบ Dynamic ได้อย่างดี ส่วนข้อเสียคือ ไม่มีกระบวนการคิด ความฉลาดดเข้า มาควบคุม และไม่มีการเก็บข้อมูลที่รับมา</p>
              <p
                class="rem2"
              >2) Subsumption รูปแบบสถาปัตยกรรมที่นำเทคนิคปัญญาประดิษฐ์ต่างๆ มาใช้ เช่น การเรียนรู้ การวางแผน เทคนิคการค้นหา ตรรกะคลุมเครือ โครงข่ายใยประสาท และขั้นตอนเชิง วิธีพันธุกรรม เป็นต้น เพื่อให้ตัวควบคุมสามารถคิด วางแผน และแก้ปัญหาเฉพาะหน้าได้ จึงทำให้การ ตอบสนองมีประสิทธิภาพมากขึ้น รวมทั้งจะเก็บบันทึกข้อมูลที่ได้รับจากสภาพแวดล้อมเดิมไว้ด้วย เช่น หุ่นยนต์สามารถวางแผนเส้นทางเดินจากจุดเริ่มต้นไปยังเป็นเป้าหมายที่สั้นที่สุด หรือใช้ทรัพยากรที่ น้อยที่สุด เป็นต้น</p>
              <h5>ข้อดีของรูปแบบสถาปัตยกรรมนี้</h5>
              <p
                class="rem2"
              >คือ หุ่นยนต์สามารถตัดสินใขแก้ปัญหาได้ด้วยตนเอง เป้าหมายของการกระทำที่ออกมาจะมีประสิทธิภาพมากกว่าแบบ Reactive Control แต่เนื่องจาก ต้องเก็บข้อมูลเดิมไว้เพื่อนำมารวบรวมเป็นประสบการณ์เรียนรู้ให้กับหุ่นยนต์ จึงควรมีพื้นที่ของ หน่วยความจำสำหรับรองรับข้อมูลดังกล่าวไว้มากพอด้วย</p>

              <h5>ภาษาที่ใช้พัฒนาหุ่นยนต์</h5>
              <p class="rem2">
                ส่วนสำคัญที่ช่วยทำให้หุ่นยนต์เกิดความฉลาด คือ ระบบควบคุม (Control System) โดย
                ผู้พัฒนาหุ่นยนต์จะใช้ “ภาษาสำหรับโปรแกรมหุ่นยนต์ (Robotic Programming Language)” มา
                สร้างความคิด การตัดสินใจ และกำหนดพฤติกรรมให้กับหุ่นยนต์ ในปี ค.ศ. 1990 Rodney Allen
                Brooks ได้พัฒนาภาษา Behavior Language เป็นภาษาที่ใช้ฐานกฎ (Rule-Based) มาควบคุมการ
                ทำงานของหุ่นยนต์แบบ Real-Time โดย Brooks นำภาษาดังกล่าวมาพัฒนากับหุ่นยนต์ที่มี
                สถาปัตยกรรมของระบบควบคุมแบบ Subsumption
              </p>
              <p class="rem2">
                ในปี ค.ศ. 2000 Horswill ได้พัฒนาภาษา Generic Robot Language (GRL) เป็นภาษา
                แบบ Functional Programming สำหรับออกแบบพฤติกรรม โดยภาษาดังกล่าวได้นำมาใช้กับ
                เครื่องจักรกลสถานะจำกัด (Finite State Machine)
              </p>
              <p class="rem2">
                ปี ค.ศ. 2002 Andre และ Russell ได้พัฒนาภาษา Alisp ซึ่งถูกพัฒนาต่อมาจากภาษา Lisp
                โดยเป็นภาษาที่ช่วยให้หุ่นยนต์สามารถตัดสินใจได้ด้วยตนเองจากองค์ความรู้และการเรียนรู้จาก
                สภาพแวดล้อม
              </p>
              <p class="rem2">
                นอกจากนี้ยังมีภาษาอื่น ๆ ที่ถูกพัฒนาขึ้น ได้แก่ ภาษา LAMA (Language for Automatic
                Mechanical Assembly) จากสถาบัน MIT ภาษา RAPT (Robot ART) จากมหาวิทยาลัย Edinburg
                และภาษา Karel ซึ่งต่อมาได้พัฒนาความสามารถให้รองรับภาษาเชิงวัตถุ (Object-Oriented) ได้ จน
                กลายเป็นภาษา Karel++ เป็นต้น
              </p>

              <br />
              <h4>งานวิจัย เทคโนโลยี และนวัตกรรมด้านหุ่นยนต์ในประเทศไทย</h4>
              <p class="rem2">
                โครงการสารานุกรมไทยสำหรับเยาวชน โดยพระราชประสงค์ในพระบาทสมเด็จพระเจ้าอยู่หัว. (2554). เล่มที่ 36 เรื่องที่ 6 ได้รวบรวมนวัตกรรมด้านหุ่นยนต์ในประเทศ ตัวอย่างเช่น
                หุ่นยนต์ในประเทศไทยมีการพัฒนาอย่างต่อเนื่อง ทั้งในรูปของงานวิจัยขั้นพื้นฐาน และที่
                นำไปประยุกต์ใช้ในเชิงอุตสาหกรรม การแพทย์ และการสร้างนวัตกรรมในเชิงสิ่งประดิษฐ์ต่าง ๆ จาก
                การแข่งขันประดิษฐ์หุ่นยนต์ ซึ่งผลงานวิจัยทางด้านหุ่นยนต์ที่น่าสนใจ และถูกบันทึกไว้ คือ
              </p>
              <br />
              <div class="text-center font-italic col">
                <img src="/img/lesson9/doc.png" width="20%" />
                <p>
                  <br />หุ่นยนต์คุณหมอพระราชทาน
                </p>
              </div>
              <br />
              <p
                class="rem2"
              >ใน พ.ศ. ๒๔๙๗ พระบาทสมเด็จพระเจ้าอยู่หัว เสด็จฯ ทรงเปิดงานศิลป์หัตถกรรมนักเรียน ที่ โรงเรียนสวนกุหลาบวิทยาลัย และมีพระราชประสงค์ที่จะสร้าง "หุ่นยนต์คุณหมอพระราชทาน" และ โปรดเกล้าฯ ให้ อาจารย์สนั่น สุมิตร ผู้อำนวยการวิทยาลัยเทคนิคกรุงเทพฯ (ปัจจุบันคือ 129 มหาวิทยาลัยเทคโนโลยีราชมงคลกรุงเทพ) อาจารย์สวัสดิ์ หงส์พร้อมญาติ และคณาจารย์ ของ วิทยาลัยเทคนิคกรุงเทพฯ เป็นผู้รับผิดชอบในการสร้าง โดยทรงพระกรุณาโปรดเกล้าฯ พระราชทาน พระราชทรัพย์ส่วนพระองค์ จำนวน ๒๐,๐๐๐ บาท เมื่อหุ่นยนต์คุณหมอพระราชทานสร้างเสร็จแล้ว พระบาทสมเด็จพระเจ้าอยู่หัว มีพระราชกระแสรับสั่ง ให้น าไปจัดแสดงในงานกาชาด ที่สถานเสาวภา หุ่นยนต์คุณหมอพระราชทาน เป็นหุ่นยนต์ตัวแรกของโลกที่มีรูปร่างคล้ายคน ขนาดเท่าคนจริง และ แต่งกายแบบหมอ สามารถเดิน ยกมือไหว้ พูด ฟัง และโต้ตอบได้ อีกทั้งทำงานหลายอย่างได้เป็นอย่างดี ต่อมา พระบาทสมเด็จพระเจ้าอยู่หัวทรงพระกรุณา โปรดเกล้าฯ พระราชทานหุ่นยนต์คุณหมอนี้ ให้แก่วิทยาลัยเทคนิคกรุงเทพฯ เพื่อใช้ประกอบการเรียนการสอน นับว่าพระราชดำริเรื่อง หุ่นยนต์ คุณหมอพระราชทาน ของพระบาทสมเด็จพระเจ้าอยู่หัว เป็นสิ่งที่มีคุณค่ายิ่ง ในประวัติศาสตร์ของ หุ่นยนต์ไทย</p>
              <br />
              <h5>การแบ่งหุ่นยนต์ จากเทคโนโลยีหลัก (Core Technology) หรือ ประยุกต์การใช้งาน</h5>
              <p class="rem2">1) หุ่นยนต์อุตสาหกรรม (Industrial Robot) เช่น แขนกลในโรงงาน</p>
              <p class="rem2">2) หุ่นยนต์บริการ (Service Robot) เช่น การช่วยเหลือการให้บริการ</p>
              <p class="rem2">3) หุ่นยนต์ทางการแพทย์ (Medical Robot) เช่น อำนวยความสะดวกทางการแพทย์</p>
              <p class="rem2">4) หุ่นยนต์ทางการทหาร (Military Robot)</p>
              <p class="rem2">5) หุ่นยนต์เพื่อการศึกษา (Education Robot)</p>
              <p class="rem2">6) หุ่นยนต์สำรวจ (Survey Robot)</p>
              <p class="rem2">7) หุ่นยนต์เพื่อความบันเทิง (Entertainment and PR Robot)</p>
              <p class="rem2">8) หุ่นยนต์เพื่อการเกษตรและปศุสัตว์ (Agricultural and Livestock Robot)</p>
              <br />
              <h5>การแบ่งหุ่นยนต์ตามรูปร่างลักษณะภายนอก</h5>
              <p class="rem2">1. หุ่นยนต์ฮิวแมนนอยด์ (Humanoid Robot)</p>
              <p class="rem5">• แอนดรอยด์ (Android) คล้ายผู้ชาย</p>
              <p class="rem5">• จีนอยด์ (Gynoid) คล้ายผู้หญิง</p>
              <p class="rem2">2. แอคทรอยด์ (Actroid) หุ่นยนต์เลียนแบบพฤติกรรมมนุษย์</p>
              <p class="rem2">3. นาโนบอท (Nanobot) มีขนาดเล็กเพียง 0.5 – 3 ไมครอน</p>
              <p class="rem2">4. ไซบอร์ก (Cyborg) ครึ่งสิ่งมีชีวิต ครึ่งหุ่นยนต์</p>
              
              <!-- -------------------------------- -->
              <br />
              <br />
              <br />
              <br />
              <div class="container">
                <div class="row">
                  <div class="col-auto mr-auto">
                    <router-link to="/lesson9_6" title="Lesson9_6 Page">
                      <div class="btn-wrapper">
                        <base-button
                          tag="a"
                          target="_blank"
                          rel="noopener noreferrer"
                          class="mb-3 mb-sm-0"
                          outline
                          type="info"
                          icon="fa fa-chevron-left"
                        >Previous</base-button>
                      </div>
                    </router-link>
                  </div>
                  <div class="col text-center">
                         <div class="btn-wrapper">
                          <base-button
                          id="back-to-top"
                          href="#"
                          role="button"
                          tag="a"
                          rel="noopener noreferrer"
                          class="btn  back-to-top"
                          
                          outline type="info"
                        >
                          <i class="fa fa-chevron-up" aria-hidden="true"></i>
                        </base-button>
                      </div>
                  </div>
                  <div class="col-auto">
                    <router-link to="/lesson9_8" title="Lesson9_8 Page">
                      <div class="btn-wrapper">
                        <base-button
                          tag="a"
                          target="_blank"
                          rel="noopener noreferrer"
                          class="mb-3 mb-sm-0"
                          outline
                          type="info"
                        >
                          Next
                          <i class="fa fa-chevron-right" aria-hidden="true"></i>
                        </base-button>
                      </div>
                    </router-link>
                  </div>
                </div>
              </div>
              <div class="text-center mt-5">Page 7/8</div>
            </div>
          </div>
        </div>
      </section>

      <hr />
      <div class="col-lg-center">
        <div class="pt-4 text-center">
          <h5 class="title">
            <span class="d-block mb-1">Author | Dr.Payungsak Kasemsumran</span>
            <small class="h6 text-black">
              Lecturer in the Computer Science Division at Maejo
              University
            </small>
          </h5>
        </div>
      </div>
      <hr />
    </div>
  </div>
</template>

<script>
export default {
  name: "home",
  components: {},
};
</script>

<style></style>
