<template>
  <div>
    <div class="position-relative">
      <section class="section-shaped my-0">
        <div class="shape shape-style-1 shape-default">
          <span></span>
          <span></span>
          <span></span>
          <span></span>
          <span></span>
          <span></span>
          <span></span>
          <span></span>
          <span></span>
        </div>

        <div class="container shape-container d-flex">
          <div class="col px-0"></div>
        </div>
      </section>

      <section class="section section-shaped my-0 overflow-hidden">
        <div class="container pt-lg pb-80">
          <div class="row justify-content-center">
            <div class="fontx col-lg-10">
              <!-- -------------------------------- -->
              <h5>สาระสำคัญของ พ.ร.บ. ฉบับนี้ มี 3 ประเด็นหลัก ดังนี้</h5>
              <p
                class="rem2"
              >1. เจ้าของข้อมูลต้องให้ความยินยอม (Consent) ในการเก็บรวบรวม การใช้ และการเปิดเผยข้อมูลส่วนบุคคลตามวัตถุประสงค์ที่ผู้เก็บรวบรวม ผู้ใช้ แจ้งไว้ตั้งแต่แรกแล้วเท่านั้น กล่าวคือ ต้องขออนุมัติจากเจ้าของข้อมูลก่อน เช่น หากแอปพลิชันหนึ่งจะเก็บข้อมูลบัตรเครดิตของเราไว้ในระบบ ก็ต้องมีข้อความให้เรากดยืนยันเพื่อยินยอม พร้อมแจ้งวัตถุประสงค์ในการเก็บรวบรวม และการใช้ หากเราไม่ยินยอมให้ใช้ข้อมูลบัตรเครดิต ผู้ให้บริการแอปพลิเคชันนั้นก็ไม่สามารถใช้ข้อมูลบัตรเครดิตของเราได้</p>
              <p
                class="rem2"
              >2. ผู้เก็บรวบรวมข้อมูลต้องรักษาความมั่นคงปลอดภัยของข้อมูล ไม่ให้มีการเปลี่ยนแปลงแก้ไข หรือถูกเข้าถึงโดยผู้ที่ไม่เกี่ยวข้องกับข้อมูล เช่น สถานพยาบาลจะต้องเก็บข้อมูลของผู้ป่วยให้เป็นความลับและไม่เปิดเผยให้กับผู้อื่น ธนาคารต้องเก็บรักษาข้อมูลเกี่ยวกับรายการถอน</p>
              <p
                class="rem2"
              >3. เจ้าของข้อมูลมีสิทธิ์ถอนความยินยอม ขอให้ลบหรือทำลายข้อมูลเมื่อใดก็ได้ หากเป็นความประสงค์ของเจ้าของข้อมูล</p>
              <br />
              <h5>หน่วยงานที่เกี่ยวข้อง</h5>
              <p
                class="rem2"
              >1. สำนักงานคณะกรรมการคุ้มครองข้อมูลส่วนบุคคล (ส.ค.ส.) มีหน้าที่กำหนดมาตรฐานในการเก็บรวบรวมข้อมูล การใช้ และการเปิดเผยข้อมูลส่วนบุคคล รวมถึงให้ความรู้และฝึกอบรมเจ้าหน้าที่ภาครัฐ เอกชน และบุคคลทั่วไปให้มีความเข้าใจและสามารถรักษาข้อมูลส่วนบุคคลอย่างปลอดภัย</p>
              <p
                class="rem2"
              >2. คณะกรรมการผู้เชี่ยวชาญ มีหน้าที่พิจารณาเรื่องร้องเรียนเมื่อมีการละเมิด ตรวจสอบผู้ควบคุมข้อมูลส่วนบุคคล หรือผู้ประมวลผลข้อมูลส่วนบุคคลที่ก่อให้เกิดความเสียหายแก่เจ้าของข้อมูลส่วนบุคคล รวมถึงการไกล่เกลี่ยข้อพิพาทต่าง ๆ</p>
              <br />
              <h5>สรุปกฎหมายคุ้มครองข้อมูลส่วนบุคคลดังนี้</h5>
              <p class="rem2">
                1.กฎหมายคุ้มครองข้อมูลส่วนบุคคลของบุคคลธรรมดาเท่านั้น
                ข้อมูลบุคคล เป็นข้อมูลเกี่ยวกับบุคคลซี่งทำให้สามารถระบุตัวบุคคลนั้นได้ไม่ว่าทางตรงหรือทางอ้อม แต่ไม่รวมถึงข้อมูลของผู้ถึงแก่กรรมโดยเฉพาะ ดังนั้นจึงหมายถึงข้อมูลชื่อ นามสกุล ที่อยู่ เบอร์โทรศัพท์ หมายเลขบัตรประชาชน อีเมล์ ลายนิ้วมือ IP address Cookie ฯลฯ ของบุคคลทั่วไป และไม่คุ้มครองถึงข้อมูลของนิติบุคคล และข้อมูลคนตาย
              </p>
              <p class="rem2">
                2. เจ้าของข้อมูลส่วนบุคคลต้องยินยอมก่อน
                การที่เก็บข้อมูลส่วนตัวต่างๆ เพื่อนำไปรวบรวม ใช้ หรือเปิดเผยข้อมูลต่อไปนั้น ต้องเก็บจากเจ้าของข้อมูลโดยตรง และได้รับการยินยอมโดยตรงจากเจ้าของข้อมูลเป็นลายลักษณ์อักษรหรือผ่านระบบออนไลน์ตามรูปแบบที่กำหนด ดังนั้นก่อนที่จะยินยอมเจ้าของมูลต้องอ่านรายละเอียดให้ดีก่อน รวมถึงเก็บข้อมูลว่าได้ยินยอมให้เก็บ ใช้ เปิดเผยข้อมูล ไปกับหน่วยงานใดบ้าง
              </p>
              <p class="rem2">
                3. แจ้งรายละเอียดชัดเจนครบถ้วน
                ผู้เก็บข้อมูลต้องแจ้งวัตถุประสงค์ของการเก็บข้อมูล การใช้ข้อมูล การเปิดเผยข้อมูล ระยะเวลาที่เก็บเงื่อนไขต่าง ๆ ให้เจ้าของข้อมูลอย่างชัดเจน ที่สำคัญข้อมูลรายละเอียดในการขอความยินยอมจากเจ้าของข้อมูลต้องแยกส่วนออกมากจากข้อความอื่นอย่างชัดเจน อ่านเข้าใจง่าย เพื่อให้เจ้าของข้อมูลอ่านและทำความเข้าใจก่อนที่จะยินยอมให้เก็บข้อมูล
              </p>
              <p class="rem2">
                4. ผู้มีสิทธิ์เด็ดขาดคือเจ้าของข้อมูล
                ข้อมูลส่วนบุคคลที่ให้ไว้นั้น เจ้าของข้อมูลสามารถยกเลิกการเก็บข้อมูล การนำไปใช้ แก้ไขและลบข้อมูลออกจากระบบได้ โดยที่ผู้เก็บข้อมูลไม่สามารถปฏิเสธได้ ดังนั้นผู้เก็บข้อมูลต้องเตรียมการให้การยกเลิกทำได้สะดวกเช่นเดียวกับการยอมรับ ซึ่งการคุ้มครองนี้รวมถึงข้อมูลส่วนตัวที่ส่งไปเพื่อสมัครงาน ผู้สมัครสามารถแจ้งให้ทางบริษัทส่งข้อมูลกลับหรือทำลายข้อมูลส่วนตัว เช่น สำเนาบัตรประชาชน สำเนาทะเบียนบ้าน รูปถ่าย เอกสารการศึกษา ฯลฯ หลังจากการสมัคร เพื่อป้องกันไม่ให้ข้อมูลส่วนตัวสำคัญเหล่านี้รั่วไหลออกไป
              </p>
              <p class="rem2">
                5.ผู้เก็บต้องรักษาข้อมูลให้ปลอดภัยเป็นความลับ
                ผู้เก็บรวบรวมข้อมูลส่วนบุคคลจะต้องมีหน้าที่รักษาความมั่นคงปลอดภัยของข้อมูล มิให้มีการแก้ไขเปลี่ยนแปลงข้อมูลโดยผู้ที่ไม่ใช้เจ้าของของมูล หรือเข้าถึงข้อมูลโดยมิชอบ และดูแลไม่ให้เกิดการสูญหาย ซึ่งเรื่องนี้ทางผู้ประกอบการหรือองค์กรที่เก็บข้อมูลต้องมีการวางระบบ วิธีการ คณะทำงาน ทีมงานที่รับผิดชอบ ฯลฯ ในการดูแลข้อมูลให้ปลอดภัยมากที่สุด แต่หากข้อมูลเกิดรั่วไหลหรือถูกขโมยไป ผู้เก็บข้อมูลต้องแจ้งให้เจ้าของข้อมูลทราบใน 72 ชั่วโมงนับแต่ทราบเหตุ
              </p>
              <p class="rem2">
                6. ครอบคลุมผู้เก็บ-ใช้-เปิดเผยข้อมูลทั้งในและนอกประเทศ
                พระราชบัญญัติข้อมูลส่วนบุคคลใช้บังคับกับการเก็บ ใช้ หรือเปิดเผยข้อมูลส่วนบุคคลโดยองค์กรหรือผู้ประกอบการในประเทศ ไม่ว่าการเก็บ การใช้หรือการเปิดเผยข้อมูล จะเกิดขึ้นในประเทศหรือนอกประเทศหากผู้เก็บ ใช้หรือการเปิดเผยข้อมูลอยู่นอกประเทศจะควบคุมเมื่อการมีเสนอสินค้าหรือบริการและการเฝ้าติดตามพฤติกรรมของเจ้าของข้อมูลส่วนตัวที่อยู่ในประเทศไทย
              </p>
              <p class="rem2">
                7.เจ้าหน้าที่คุ้มครองข้อมูลส่วนบุคคล ใช้ Outsource ได้
                เจ้าหน้าที่คุ้มครองข้อมูลส่วนบุคคล ซึ่งมีหน้าที่ให้คำแนะนำในการปฏิบัติ ตรวจสอบการดำเนินการให้ถูกต้อง ประสานงานเมื่อมีปัญหา และรักษาความลับ อาจเป็นพนักงานขององค์กรหรือเป็นผู้รับจ้างให้บริการตามสัญญาก็ได้
              </p>
              <p class="rem2">
                8.ฝ่าฝืนมีโทษถูกจับติดคุก ปรับเงินสูงสุด 5 ล้านบาท
                หากฝ่าฝืนมีโทษทั้งทางอาญา ทางแพ่ง และทางปกครอง สำหรับโทษทางอาญาหากมีการฝ่าฝืนมีโทษจำคุกไม่เกิน 6 เดือนถึง 1 ปีหรือปรับไม่เกิน 500,000 ถึง 1,000,000 บาท หรือทั้งจำทั้งปรับ ส่วนระวางโทษปรับทางปกครองไม่เกิน 500,000 ถึง 5,000,000 บาท
              </p>
              <br />
              <h4>• พ.ร.บ. คอมพิวเตอร์</h4>
              <p
                class="rem2"
              >พ.ร.บ.คอมพิวเตอร์ คือ พระราชบัญญัติที่ว่าด้วยการกระทำผิดเกี่ยวกับคอมพิวเตอร์ ซึ่งคอมพิวเตอร์ที่ว่านี้รวมทั้งคอมพิวเตอร์ตั้งโต๊ะ คอมพิวเตอร์โน้ตบุ๊ค สมาร์ทโฟน รวมถึงระบบต่างๆ ที่ถูกควบคุมด้วยระบบคอมพิวเตอร์ด้วย ซึ่งเป็นพ.ร.บ.ที่ตั้งขึ้นมาเพื่อป้องกัน ควบคุมการกระทำผิดที่จะเกิดขึ้นได้จากการใช้คอมพิวเตอร์ หากใครกระทำความผิดตามพ.ร.บ.คอมพิวเตอร์นี้ ก็จะต้องได้รับการลงโทษตามที่พ.ร.บ.กำหนดไว้ พระราชบัญญัติว่าด้วยการกระทำความผิดเกี่ยวกับคอมพิวเตอร์ได้ถูกกำหนดขึ้นใช้ในปี พ.ศ 2550 และ ได้มีการปรับปรุงแก้ไขพ.ศ. 2560 (ฉบับที่ 2) สามารถอ่านฉบับเต็มได้ที่เว็บไซต์ทางการนี้ ดังนั้นการใช้งานคอมพิวเตอร์และสื่อสังคมออนไลน์ จึงควรรู้กฎกติกาการใช้งานไว้ก่อน ก็จะช่วยป้องกันไม่ให้เราเสี่ยงต่อการทำผิดกฎหมายสามารถสรุปเรื่องที่ห้ามทำผิดกฎหมาย พ.ร.บ.คอมพิวเตอร์ ดังนี้</p>
              <p
                class="rem2"
              >1. การเข้าถึงระบบหรือข้อมูลของผู้อื่นโดยไม่ชอบ หรือเจ้าของข้อมูลไม่ได้อนุญาต เช่นการปล่อยไวรัส มัลแวร์เข้าคอมพิวเตอร์คนอื่น เพื่อเจาะข้อมูลบางอย่าง หรือพวกแฮคเกอร์ ที่เข้าไปขโมยข้อมูลของคนอื่นมีความผิดตาม พ.ร.บ. คอมพิวเตอร์มาตรา 5-8</p>
              <h6 class="rem2">บทลงโทษ</h6>
              <p
                class="rem5"
              >- เข้าถึงระบบคอมพิวเตอร์: จำคุกไม่เกิน 6 เดือน ปรับไม่เกิน 10,000 บาท หรือทั้งจำทั้งปรับ</p>
              <p
                class="rem5"
              >- เข้าถึงข้อมูลคอมพิวเตอร์: จำคุกไม่เกิน 2 ปี ปรับไม่เกิน 40,000 บาท หรือทั้งจำทั้งปรับ</p>
              <p
                class="rem5"
              >- ล่วงรู้มาตรการป้องกันการเข้าถึงระบบคอมพิวเตอร์และนำไปเปิดเผย: จำคุกไม่เกิน 1 ปี ปรับไม่เกิน 20,000 บาท หรือทั้งจำทั้งปรับ</p>
              <p
                class="rem5"
              >- ดักรับข้อมูลคอมพิวเตอร์: จำคุกไม่เกิน 2 ปี ปรับไม่เกิน 40,000 บาท หรือทั้งจำทั้งปรับ</p>
              <br />
              <p
                class="rem2"
              >2. การแก้ไข ดัดแปลง ทำลาย หรือทำให้ข้อมูลหรือระบบคอมพิวเตอร์ผู้อื่นเสียหายโดยมิชอบตามมาตรา 9-10 เช่น การทำร้ายระบบเว็บไซต์ของผู้อื่น</p>
              <h6 class="rem2">บทลงโทษ</h6>
              <p
                class="rem5"
              >- ต้องระวางโทษจำคุกไม่เกิน 5 ปี ปรับไม่เกิน 100,000 บาท หรือทั้งจำทั้งปรับ</p>
              <p
                class="rem5"
              >- แต่ถ้าเป็นกรณีกระทำต่อระบบหรือข้อมูลคอมพิวเตอร์ตามมาตร 12 หรือเข้าถึงระบบ ข้อมูลด้านความมั่นคงโดยมิชอบ จะต้องได้รับโทษจำคุก 1-7 ปี และปรับ 20,000 – 140,000 บาท และถ้าเป็นเหตุให้เกิดอันตรายต่อบุคคลอื่น ต้องได้รับโทษจำคุกไม่เกิน 10 ปี และปรับ 20,000 – 200,000 บาท และถ้าเป็นเหตุให้บุคคลอื่นถึงแก่ความตาย ต้องจำคุก 5-20 ปี และปรับ 100,000 – 400,000 บาท</p>

              <br />
              <p
                class="rem2"
              >3. ส่งข้อมูลหรืออีเมลก่อกวนผู้อื่น หรือส่งอีเมลสแปมก่อให้เกิดความเดือดร้อนรำคาญโดยไม่สามารถบอกเลิกหรือเจ้งยกเลิกได้ เข้าข่ายความผิดพ.ร.บคอมพิวเตอร์ตามมาตรา 11</p>
              <h6 class="rem2">บทลงโทษ</h6>
              <p
                class="rem5"
              >- ถ้าส่งโดยปกปิดหรือปลอมแปลงแหล่งที่มา ปรับไม่เกิน 100,000 บาท และถ้าส่งโดยไม่เปิดโอกาสให้ผู้รับสามารถปฎิเสธได้โดยง่าย ปรับไม่เกิน 200,000 บาท</p>
              <br />
              <p
                class="rem2"
              >4. เข้าถึงระบบ หรือข้อมูลทางด้านความมั่นคงโดยมิชอบ เช่น การโพสต์เกี่ยวกับเรื่องการเมืองที่ส่งผลให้เกิดความเสียหายหรือความมั่นคงต่อประเทศ หรือโพสต์ที่เป็นการก่อกวน หรือการก่อการร้ายขึ้น รวมถึงการโพสต์ข้อความในโลกออนไลน์ที่เข่าข่ายข้อมูลเท็จที่น่าจะเกิดความเสียหายต่อความมั่นคงของประเทศ ความปลอดภัยสาธารณะ หรือทำให้ประชาชนเกิดอาการตื่นตระหนก และล่วงรู้ถึงมาตรการการป้องกันการเข้าถึงระบบคอมพิวเตอร์และนำไปเปิดเผย มีความผิดตาม พ.ร.บ. คอมพิวเตอร์ตามมาตรา 12</p>
              <h6 class="rem2">บทลงโทษ</h6>
              <p class="rem5">- กรณีไม่เกิดความเสียหาย: จำคุก 1-7 ปี และปรับ 20,000 – 140,000 บาท</p>
              <p class="rem5">- กรณีเกิดความเสียหาย: จำคุก 1-10 ปี และปรับ 20,000 – 200,000 บาท</p>
              <p
                class="rem5"
              >- กรณีเป็นเหตุให้ผู้อื่นถึงแก่ความตาย: จำคุก 5-20 ปี และปรับ 100,000 – 400,000 บาท</p>
              <br />
              <p
                class="rem2"
              >5. จำหน่ายหรือเผยแพร่ชุดคำสั่งเพื่อนำไปใช้กระทำมีความผิดตาม พ.ร.บ. คอมพิวเตอร์ตามมาตรา 13</p>
              <h6 class="rem2">บทลงโทษ</h6>
              <p
                class="rem5"
              >- กรณีทำเพื่อเป็นเครื่องมือในการกระทำความผิดทางคอมพิวเตอร์ตามมาตรา 5-11 (หรือข้อ 1-3 ) ต้องจำคุกไม่เกิน 1 ปี ปรับไม่เกิน 20,000 บาท หรือทั้งจำทั้งปรับ หากมีผู้นำไปใช้กระทำความผิด ผู้จำหน่ายหรือผู้เผยแพร่ต้องรับผิดชอบร่วมด้วย</p>
              <p
                class="rem5"
              >- กรณีทำเพื่อเป็นเครื่องมือในการกระทำความผิดทางคอมพิวเตอร์ มาตรา 12 ต้องจำคุกไม่เกิน 2 ปี ปรับไม่เกิน 40,000 บาท หรือทั้งจำทั้งปรับ หากมีผู้นำไปใช้กระทำความผิด ผู้จำหน่ายหรือผู้เผยแพร่ต้องรับผิดชอบร่วมด้วย</p>

              <br />
              <p
                class="rem2"
              >6. นำข้อมูลที่ผิดพ.ร.บ.เข้าสู่ระบบคอมพิวเตอร์ มีความผิดตาม พ.ร.บ. คอมพิวเตอร์มาตรา 14 ซึ่งแบ่งออกเป็น 5 ข้อความผิดด้วยกันคือ</p>
              <p
                class="rem5"
              >- โพสต์ข้อมูลปลอม ทุจริต หลอกลวง เช่น ข่าวปลอม โฆษณาธุรกิจลูกโซ่ที่หลอกลวงเอาเงินลูกค้า และไม่มีการส่งมอบของให้จริงๆ เป็นต้น</p>
              <p class="rem5">- โพสต์ข้อมูลความผิดเกี่ยวกับความมั่งคงปลอดภัย</p>
              <p class="rem5">- โพสต์ข้อมูลความผิดเกี่ยวกับความมั่นคง ก่อการร้าย</p>
              <p
                class="rem5"
              >- โพสต์ข้อมูลลามก ที่ประชาชนเข้าถึงได้เผยแพร่ ส่งต่อข้อมูล ที่รู้แล้วว่าผิด เช่น กด Share ข้อมูลที่มีเนื้อหาเข้าข่ายความผิดพ.ร.บ.คอมพิวเตอร์ก็มีความผิด</p>
              <h6 class="rem2">บทลงโทษ</h6>
              <p
                class="rem5"
              >- หากเป็นการกระทำที่ส่งผลถึงประชาชน ต้องได้รับโทษจำคุกไม่เกิน 5 ปี ปรับไม่เกิน 100,000 บาท หรือทั้งจำทั้งปรับ และหากเป็นกรณีที่เป็นการกระทำที่ส่งผลต่อบุคลใดบุคคลหนึ่ง ต้องได้รับโทษจำคุกไม่เกิน 3 ปี ปรับไม่เกิน 600,000 บาท หรือทั้งจำทั้งปรับ (แต่ในกรณีอย่างหลังนี้สามารถยอมความกันได้)</p>
              <br />
              <p
                class="rem2"
              >7. ให้ความร่วมมือ ยินยอม รู้เห็นเป็นใจกับผู้ร่วมกระทำมีความผิดตาม พ.ร.บ. คอมพิวเตอร์ตามมาตรา 15 เช่น เพจต่างๆ ที่เปิดให้มีการแสดงความคิดเห็น แล้วมีความคิดเห็นที่มีเนื้อหาผิดกฎหมายก็มีความผิด ยกเว้นแอดมินเพจจะลบทิ้งก็จะถือว่าเป็นผู้ที่พ้นผิด ซึ่งผู้ให้บริการมีหน้าที่เก็บข้อมูลการใช้งานไม่น้อยกว่า 90 วัน ในกรณีที่จำเป็น ศาลอาจสั่งให้เก็บข้อมูลเพิ่มได้ไม่เกิน 2 ปี</p>
              <h6 class="rem2">บทลงโทษ</h6>
              <p
                class="rem5"
              >- ถ้าไม่ยอมลบออกต้องได้รับโทษ ถือว่าเป็นผู้กระทำความผิดตามมาตร 14 ต้องได้รับโทษเช่นเดียวกันผู้โพสต์ หรือแสดงความคิดเห็นทางออนไลน์ แต่ถ้าผู้ดูแลระบบพิสูจน์ได้ว่า ตนได้ปฏิบัติตามขั้นตอนการแจ้งเตือนแล้วไม่ต้องรับโทษ</p>
              <br />
              <p
                class="rem2"
              >8. ตัดต่อ เติม หรือดัดแปลงภาพ มีความผิดตามมาตรา 1 ความผิดข้อนี้ แบ่งออกเป็น 2 ประเด็นหลักคือ</p>
              <p
                class="rem5"
              >• การโพสต์ภาพของผู้อื่นที่เกิดจากการสร้าง ตัดต่อ หรือดัดแปลง ที่น่าจะทำให้ผู้อื่นนั้นเสียชื่อเสียง ถูกดูหมิ่นเกลียดชัง อย่างเช่นกรณีที่เอาภาพดาราไปตัดต่อ และตกแต่งเรื่องขึ้นมา จนทำให้บุคคลนั้นเกิดความเสียหาย ก็ถือว่ามีความผิดตามพ.ร.บ.คอมพิวเตอร์</p>
              <p
                class="rem5"
              >• การโพสต์ภาพผู้เสียชีวิต หากเป็นการโพสต์ที่ทำให้บิดามารดา คู่สมรส หรือบุตรของผู้ตายเสียชื่อเสียง ถูกดูหมิ่นเกลียดชัง หรือได้รับความอับอาย</p>
              <h6 class="rem2">บทลงโทษ</h6>
              <p
                class="rem5"
              >- หากทำผิดตามนี้ ต้องได้รับโทษจำคุกไม่เกิน 3 ปี และปรับไม่เกิน 200,000 บาท</p>
              <br />
              <h5>ตัวอย่างการละเมิด พ.ร.บ คอมพิวเตอร์สำหรับนักท่องอินเทอร์เน็ต</h5>
              <p class="rem2">1. ห้ามฝากร้านใน Facebook, IG ถือเป็นสแปม ปรับ 200,000 บาท</p>
              <p class="rem2">
                2. ส่ง SMS โฆษณา โดยไม่รับความยินยอม ให้ผู้รับสามารถปฏิเสธข้อมูลนั้นได้ ไม่เช่นนั้นถือเป็นสแปม ปรับ
                200,000 บาท
              </p>
              <p class="rem2">3. ส่ง Email ขายของ ถือเป็นสแปม ปรับ 200,000 บาท</p>
              <p class="rem2">
                4. กด Like ได้ไม่ผิด พ.ร.บ.คอมพิสเตอร์ ยกเว้นการกดไลค์ เป็นเรื่องเกี่ยวกับสถาบัน เสี่ยงเข้าข่ายความผิดมาตรา
                112 หรือมีความผิดร่วม
              </p>
              <p
                class="rem2"
              >5. กด Share ถือเป็นการเผยแพร่ หากข้อมูลที่แชร์มีผลกระทบต่อผู้อื่น อาจเข้าข่ายความผิดตาม พ.ร.บ คอมพิวเตอร์โดยเฉพาะที่กระทบต่อบุคคลที่ 3</p>
              <p class="rem2">
                6. หากพบข้อมูลผิดกฎหมายอยู่ในระบบคอมพิวเตอร์ของเรา แต่ไม่ใช่สิ่งที่เจ้าของคอมพิวเตอร์กระทำเอง สามารถ
                แจ้งไปยังหน่วยงานที่รับผิดชอบได้ หากแจ้งแล้วลบข้อมูลออกเจ้าของก็จะไม่มีความผิดตามกฎหมาย เช่น ความเห็นในเว็บไซต์ต่าง ๆ รวมไปถึงเฟซบุ๊ก ที่ให้แสดงความคิดเห็น หากพบว่าการแสดงความเห็นผิดกฎหมาย เมื่อแจ้งไปที่หน่วยงานที่รับผิดชอบเพื่อลบได้ทันที เจ้าของระบบเว็บไซต์จะไม่มีความผิด
              </p>
              <p class="rem2">
                7. สำหรับ แอดมินเพจ ที่เปิดให้มีการแสดงความเห็น เมื่อพบข้อความที่ผิด พ.ร.บ.คอมพิวเตอร์ เมื่อลบออกจาก
                พื้นที่ที่ตนดูแลแล้ว จะถือเป็นผู้พ้นผิด
              </p>
              <p class="rem2">8. ไม่โพสต์สิ่งลามกอนาจาร อาวุธ ที่ทำให้เกิดการเผยแพร่สู่ประชาชนได้</p>
              <p
                class="rem2"
              >9. การโพสเกี่ยวกับเด็ก เยาวชน ต้องปิดบังใบหน้า ยกเว้นเมื่อเป็นการเชิดชู ชื่นชม อย่างให้เกียรติ</p>
              <p class="rem2">
                10. การให้ข้อมูลเกี่ยวกับผู้เสียชีวิต ต้องไม่ทำให้เกิดความเสื่อมเสียเชื่อเสียง หรือถูกดูหมิ่น เกลียดชัง ญาติสามารถ
                ฟ้องร้องได้ตามกฎหมาย
              </p>
              <p class="rem2">
                11. การโพสต์ด่าว่าผู้อื่นมีกฏหมายอาญาอยู่แล้ว ไม่มีข้อมูลจริง หรือถูกตัดต่อ ผู้ถูกกล่าวหาเอาผิดผู้โพสต์ได้ และ
                มีโทษจำคุกไม่เกิน 3 ปี ปรับไม่เกิน 200,000 บาท
              </p>
              <p class="rem2">12. ไม่ทำการละเมิดลิขสิทธิ์ผู้ใด ไม่ว่าข้อความ เพลง รูปภาพ หรือวิดีโอ</p>
              <p
                class="rem2"
              >13. ส่งรูปภาพแชร์ของผู้อื่น เช่น สวัสดี อวยพร ไม่ผิด ถ้าไม่เอาภาพไปใช้ในเชิงพาณิชย์ หารายได้</p>

              <br />
              <div class="text-center font-italic col">
                <img src="/img/lesson8/7.png" width="60%" />
                <p>
                  <br />รูปภาพ แสดงการรักษาความปลอดภัยของระบบเครือข่าย
                </p>
              </div>
              <br />

              <!-- -------------------------------- -->
              <br />
              <br />
              <br />
              <br />
              <div class="container">
                <div class="row">
                  <div class="col-auto mr-auto">
                    <router-link to="/lesson8_3" title="Lesson8_3 Page">
                      <div class="btn-wrapper">
                        <base-button
                          tag="a"
                          target="_blank"
                          rel="noopener noreferrer"
                          class="mb-3 mb-sm-0"
                          outline
                          type="info"
                          icon="fa fa-chevron-left"
                        >Previous</base-button>
                      </div>
                    </router-link>
                  </div>
                  <div class="col-auto">
                    <router-link to="/lesson9_1" title="Lesson9_1 Page">
                      <div class="btn-wrapper">
                        <base-button
                          tag="a"
                          target="_blank"
                          rel="noopener noreferrer"
                          class="mb-3 mb-sm-0"
                          outline
                          type="info"
                        >
                          Continue
                          <i class="fa fa-chevron-right" aria-hidden="true"></i>
                        </base-button>
                      </div>
                    </router-link>
                  </div>
                </div>
              </div>
              <div class="text-center mt-5">Page 4/4</div>
            </div>
          </div>
        </div>
      </section>

      <hr />
      <div class="col-lg-center">
        <div class="pt-4 text-center">
          <h5 class="title">
            <span class="d-block mb-1">Author | -</span>
            <small class="h6 text-black">_</small>
          </h5>
        </div>
      </div>
      <hr />
    </div>
  </div>
</template>

<script>
export default {
  name: "home",
  components: {},
};
</script>

<style></style>
