<template>
  <div>
    <div class="position-relative">
      <section class="section-shaped my-0">
        <div class="shape shape-style-1 shape-default">
          <span></span>
          <span></span>
          <span></span>
          <span></span>
          <span></span>
          <span></span>
          <span></span>
          <span></span>
          <span></span>
        </div>

        <div class="container shape-container d-flex">
          <div class="col px-0"></div>
        </div>
      </section>

      <section class="section section-shaped my-0 overflow-hidden">
        <div class="container pt-lg pb-80">
          <div class="row justify-content-center">
            <div class="fontx col-lg-10">
              <!-- -------------------------------- -->
              <h5 class="rem2">
                4.5 การใช้ภาพหรือกราฟิกที่มีคุณภาพประกอบการนำเสนอ (use
                high-quality photos and graphics)
              </h5>
              <p class="rem2">
                การนำเสนอด้วยภาพหรือมีภาพประกอบคำบรรยายจะช่วยดึงดูดใจและสร้างแรงบันดาลใจแก่ผู้ฟัง
                ทำให้เข้าใจในสิ่งที่ต้องการนำเสนอได้ดีขึ้น ดังคำสุภาษิตที่ว่า "A
                picture is worth a thousand words" หรือ
                ภาพหนึ่งภาพแทนคำพูดนับพันคำ นอกจากนี้
                รูปภาพยังช่วยให้ผู้ฟังสามารถจดจำเรื่องราวหรือเนื้อหาที่เรานำเสนอได้
                การใช้ภาพใน PowerPoint เพื่อการนำเสนอที่ดี มีข้อแนะนำ ดังนี้
              </p>
              <p class="rem2">
                1) ในหนึ่งสไลด์ไม่ควรใส่ภาพหลายภาพ ควรใส่ภาพที่มีคุณภาพสูงเพียง
                1 ภาพก็เพียงพอ
              </p>
              <p class="rem2">
                2) ภาพที่ใช้ต้องเกี่ยวข้องสัมพันธ์กับเนื้อหาที่นำเสนอ
                รวมถึงภาพที่ใส่เพื่อเพิ่มความสวยงามของสไลด์ เช่น
                ภาพตกแต่งข้อความ หรือภาพพื้นหลัง
              </p>
              <p class="rem2">
                3) ควรมีการเน้นจุดสำคัญในภาพ เช่น ภาพที่เป็นกราฟ
                หากมีการพูดถึงตัวเลขสถิติควรมีการใช้สีเน้นไปที่ตัวเลขสำคัญๆ
                เป็นต้น
              </p>
              <p class="rem2">
                4) การใช้พื้นหลัง (Background)
                ควรหลีกเลี่ยงการใช้ภาพเป็นพื้นหลังเพราะจะทำให้ตัวหนังสืออ่านยาก
                หรือถ้าต้องการใช้พื้นหลังเป็นรูปภาพ ควรทำภาพให้จางลง (ลด
                Opacity) และใส่เงาให้กับตัวอักษรด้วยเพื่อให้ตัวอักษรเด่นขึ้น
              </p>
              <p class="rem2">
                5) รูปภาพที่นำมาใส่ในงานนำเสนอจะต้องมีขนาดไม่ใหญ่จนเกินไป
                เพราะจะทำให้ขนาดของไฟล์นำเสนอใหญ่ไปด้วย ควรจะทำการลดขนาดของภาพ
                รวมทั้งตกแต่งภาพโดยใช้โปรแกรมจัดการภาพ เช่น Paint, PhotoScape,
                PhotoShop หรือ Lightroom ให้เรียบร้อยก่อนที่นำมาใส่ในงานนำเสนอ
                เพราะหากไปตกแต่งภาพใน PowerPoint จะทำให้ไฟล์นำเสนอมีขนาดใหญ่
              </p>
              <p class="rem2">
                6) ควรใช้ภาพที่ถ่ายเองหรือสร้างขึ้นเอง
                หลีกเลี่ยงการดาวน์โหลดภาพมาจากอินเทอร์เน็ตเพราะปัจจุบันมีกฎหมายลิขสิทธิ์เกี่ยวกับภาพถ่าย
                และบางเว็บไซต์ให้บริการขายรูปภาพ เช่น Shutterstock และ
                Dreamstime แต่มีเว็บไซต์ที่ให้ดาวน์โหลดรูปภาพมาใช้งานได้ฟรี เช่น
                Pixabay, Pexels, Freepik และ Stocksnap เป็นต้น
              </p>
              <p class="rem2">
                7) การใส่รูปภาพลงสไลด์ ควร insert
                ภาพจากไฟล์ที่เป็นไฟล์ขนาดเล็กแต่คุณภาพสูง
                จะช่วยให้ไฟล์สไลด์มีขนาดเล็กด้วย แต่ถ้า copy ภาพจากเว็บมา paste
                ลงสไลด์ จะทำให้สไลด์ PowerPoint มีขนาด File Size ใหญ่
              </p>
              <p class="rem2">
                8) การแต่งภาพด้วยเครื่องมือใน PowerPoint จะทำให้ File Size
                มีขนาดใหญ่ขึ้น ดังนั้น ควรลงภาพอย่างเดียว
                โดยไม่ต้องแก้ไขแต่งเติมบน PowerPoint หากไม่จำเป็น
              </p>
              <p class="rem2">
                การนำภาพมาใส่ในสไลด์ ทำได้โดยใช้คำสั่ง ดังนี้ ไปที่แถบ Insert
                -----> Images คลิกที่ Pictures จากนั้นจะมีกล่องข้อความ Insert
                Picture Form
                ถ้าจะนำเข้าไฟล์ภาพจากเครื่องคอมพิวเตอร์ที่กำลังใช้งานอยู่
                ให้คลิกที่ This Device หากจะนำเข้าจากอินเทอร์เน็ต ให้คลิกที่
                Online Pictures
                นอกจากนี้ยังสามารถจับภาพหน้าจอของโปรแกรมอื่นที่กำลังเปิดใช้งานอยู่บนคอมพิวเตอร์เครื่องนั้นมาให้เลือกใส่ในสไลด์ได้
                ดังแสดงในภาพ
              </p>
              <br />
              <div class="text-center font-italic">
                <img src="/img/lesson3/14.png" width="80%" />
                <p>
                  <br />ภาพที่ 14 ภาพที่ปรากฏบนหน้าจอ จากการใช้คำสั่ง Insert
                  -----> Images Graph
                </p>
              </div>
              <br />
              <div class="text-center font-italic">
                <img src="/img/lesson3/15.png" width="80%" />
                <p>
                  <br />ภาพที่ 15 การนำเข้าภาพจากอินเทอร์เน็ต โดยใช้ keyword
                  ในการค้นหาภาพ
                </p>
              </div>
              <br />
              <div class="text-center font-italic">
                <img src="/img/lesson3/16.png" width="80%" />
                <p><br />ภาพที่ 16 การนำเข้าภาพจาก Screen shot</p>
              </div>
              <br />
              <p class="rem2">
                หากไม่ได้ตกแต่งภาพมาก่อนนำมาจัดทำ presentation
                ผู้ใช้สามารถตกแต่งภาพในโปรแกรม Microsoft PowerPoint ได้ เช่น
                การปรับความเข้ม/สว่าง การลบสีพื้น การใส่ขอบ
                การตัดภาพเป็นรูปทรางต่างๆ เป็นต้น ตัวอย่าง วิธีการตกแต่งภาพใน
                PowerPoint ดังแสดงในภาพที่ 17, 18 และ 19
              </p>
              <br />
              <div class="text-center font-italic">
                <img src="/img/lesson3/17.png" width="80%" />
                <p>
                  <br />ภาพที่ 17 การ double click
                  ที่รูปภาพเพื่อให้แถบเมนูของการแก้ไขรูปภาพปรากฏขึ้นมา
                </p>
              </div>
              <br />
              <div class="text-center font-italic">
                <img src="/img/lesson3/18.png" width="80%" />
                <p>
                  <br />ภาพที่ 18 การคลิกที่แถบ Corrections
                  เพื่อเลือกรูปที่ปรับแก้ความคมชัด/นุ่มนวล และความเข้ม/สว่าง
                </p>
              </div>
              <br />
              <div class="text-center font-italic">
                <img src="/img/lesson3/19.png" width="80%" />
                <p>
                  <br />ภาพที่ 19 – การ crop ภาพเป็นรูปต่างๆ โดยคลิกที่ Crop
                  -----> Crop to Shape
                </p>
              </div>
              <br />
              <p class="rem2">
                การใส่รูปภาพหลาย รูป และการตกแต่ภาพในโปรแกรม PowerPoint
                จะส่งผลให้ไฟล์มีขนาดใหญ่ ผู้ใช้สามารถลดขนาดไฟล์ให้เล็กลง
                ด้วยการบีบอัดภาพ (compress pictures) ในตัว presentation
                หรือในขั้นตอน การ Save ดังนี้
              </p>
              <br />
              <p class="rem2 font-weight-bold ">
                การลดขนาดไฟล์ด้วยการบีบอัดภาพบนสไลด์ ทำได้ดังนี้
              </p>
              <p class="rem2 ">
                - ไปแถบเมนูของการแก้ไขรูปภาพ คลิกที่ Compress Pictures
                จะปรากฏหน้าต่าง Compression options ให้เลือก Resolution
                ที่ต้องการ และสามารถระบุว่าจะลบกรอบที่ตัดออกไปด้วยหรือไม่
                โดยสามารถเลือกบีบอัดและลบส่วนที่ตัดออกเฉพาะภาพนั้นหรือทำทุกภาพพร้อมกัน
              </p>
              <div class="text-center font-italic">
                <img src="/img/lesson3/20.png" width="60%" />
                <p>
                  <br />ภาพที่ 20 – การบันทึกไฟล์ Presentation
                  แบบบีบอัดภาพเพื่อลดขนาดไฟล์การลดขนาดไฟล์ด้วย save
                  ไฟล์แบบบีบอัด
                </p>
              </div>
              <br />
              <p class="rem2 ">
                - ไปที่ File ----> save as ตั้งชื่อภาพแล้วคลิกที่ Tools ----->
                Compress Pictures จะมีกล่อง Compression options ขึ้นมาให้ติกที่
                web (150 ppi) ซึ่งเป็นขนาดที่เหมาะสำหรับ
                การนำเสนอผ่านเว็บไซต์และจอภาพทั่วไป
              </p>
              <br />
              <div class="text-center font-italic">
                <img src="/img/lesson3/21.png" width="60%" />
                <p>
                  <br />ภาพที่ 21 – การบันทึกไฟล์presentation
                  แบบบีบอัดภาพเพื่อลดขนาดไฟล์
                </p>
              </div>
              <br />
              <h5 class="rem2">4.6 การใส่วิดีโอเข้าไปในการนำเสนอ</h5>
              <p class="rem2 ">
                การนำเสนอข้อมูลหรือไอเดียใหม่ๆ
                การนำเสนอด้วยมุมมองที่แตกต่างจะช่วยให้มีความน่าสนใจมากขึ้น เช่น
                เพิ่มการนำเสนอด้วยวิดีโอเข้ามาในสไลด์ที่กำลังนำเสนอ
                การนำเข้าวิดีโอมีวิธีการทำ ดังนี้
              </p>
              <p class="rem2 ">
                - ไปที่ Insert --------> Media จะปรากฏกล่องประเภทของ Media
                ขึ้นมาให้เลือก จากนั้นให้ติกที่ Video
                แล้วเลือกไฟล์วิดีโอที่เตรียมไว้ หรือจากอินเทอร์เน็ต เช่น Youtube
                โดยใส่ URL ของวิดีโอลงไป
              </p>
              <br />
              <div class="text-center font-italic">
                <img src="/img/lesson3/22.png" width="60%" />
                <p><br />ภาพที่ 22 – การใส่วิดีโอเข้าไปในสไลด์ presentation</p>
              </div>
              <br />
              <h5 class="rem2">
                4.7 การทำอินโฟกราฟิกด้วยโปรแกรม Microsoft PowerPoint
              </h5>
              <p class="rem2">
                Infographic ย่อมาจากคำว่า Information Graphic หมายถึง
                การนำข้อมูลหรือสารสนเทศ ที่เป็นตัวเลขหรือไม่เป็นตัวเลข
                มาจัดทำให้เป็นภาพกราฟิกทั้งที่เป็นภาพนิ่งหรือภาพเคลื่อนไหว
                ผู้ดูสามารถที่เข้าใจได้ง่าย ในเวลาอันรวดเร็ว
                ปัจจุบันอินโฟกราฟิกเป็นที่นิยมอย่างมากบน Social Network
              </p>
              <p class="rem2">
                การนำเสนอแบบอินโฟกราฟิกจะช่วยดึงดูดความสนใจของผู้อ่าน
                แต่ผู้นำเสนอจะต้องมีการออกแบบอินโฟกราฟิกในรูปแบบใหม่ๆ อยู่เสมอ
                เพื่อให้มีความน่าสนใจ หากผู้ใช้งาน PowerPoint
                เห็นว่าการทำอินโฟกราฟิกเป็นเรื่องยาก ก็สามารถหาอินโฟกราฟิกฟรีจาก
                Free Infographic Templates in PowerPoint บนอินเทอร์เน็ต
                ที่มีแม่แบบอินโฟกราฟิกที่สามารถดาวน์โหลดมาใช้งานได้
              </p>
              <br />
              <div class="text-center font-italic">
                <img src="/img/lesson3/23.png" width="60%" />
                <p>
                  <br />ภาพที่ 23 ตัวอย่างอินโฟกราฟิกกราฟแท่ง (ด้านซ้าย)
                  เปรียบเทียบกับ กราฟวงแหวน (ด้านขวา)
                </p>
              </div>
              <br />
              <p class="rem2">
                โปรแกรม PowerPoint มีเครื่องมือ เช่น กราฟ รูปทรงเรขาคณิตต่างๆ
                และ SmartArt Graphic ตลอดจนเอฟเฟ็คพิเศษ
                ที่สามารถนำมาใช้ในการสร้างอินโฟกราฟิกได้
                แต่การทำอินโฟกราฟิกให้ดีและน่าสนใจนั้น
                ขึ้นอยู่กับทักษะการใช้โปรแกรม PowerPoint
                และความคิดสร้างสรรค์ของผู้ใช้งาน ขึ้นตอนหลักๆ ในการทำอินโฟกราฟิก
                มีดังต่อไปนี้
              </p>

              <p class="rem2">
                1)
                กำหนดกลุ่มเป้าหมายของสื่ออินโฟกราฟิกหรือผู้ที่เราอยากจะสื่อสารเนื้อหาด้วยอินโฟกราฟิกนั้นให้ชัดเจนตั้งแต่ต้น
                เช่น กลุ่มอาชีพ อายุ เพศ การศึกษา และความชอบ เป็นต้น
                เพื่อจะได้ออกแบบองค์ประกอบของอินโฟกราฟิกหรือใช้ภาษาที่เหมาะสมที่สามารถเข้าถึงกลุ่มเป้าหมายได้มากที่สุด
              </p>
              <p class="rem2">
                2)
                กำหนดวัตถุประสงค์ของอินโฟกราฟิกให้ชัดเจนว่าอยากให้กลุ่มเป้าหมายได้อะไรจากอินโฟกราฟิก
                ได้ความรู้ ทัศนะคติหรือพฤติกรรมอะไร
              </p>
              <p class="rem2">
                3) การจัดเตรียมเนื้อหาและสรุปเนื้อหาที่ต้องการสื่อสาร
                โดยอาจต้องหาข้อมูลจากหลายแหล่งเพื่อความครบถ้วนถูกต้อง
                โดยเฉพาะหากเป็นข้อมูลตัวเลขหรือข้อมูลเชิงสถิติ
                ต้องตรวจสอบความถูกต้องและความน่าเชื่อถือของข้อมูลว่ามาจากแหล่งใด
                น่าเชื่อถือมากน้อยเพียงใด จากนั้นนำมาสรุปเป็นสารสนเทศ อาทิ
                นำมาจัดหมวดหมู่ตามประเด็นที่ต้องการนำเสนอ
                โดยนำข้อมูลที่สำคัญมาใช้ในการแสดงผล
                จากนั้นก็พร้อมที่จะนำมาสร้างเป็น Infographic ที่มีความน่าสนใจ
                และสามารถนำเสนอข้อมูลให้เข้าใจง่าย
              </p>
              <p class="rem2">
                4) ร่างแบบและจัดทำเลย์เอาท์
                นำสาระสำคัญที่สรุปไว้มาจัดทำเป็นกราฟิกตามความคิดสร้างสรรค์
                โดยอาจร่างคร่าวๆ ด้วยมือในกระดาษก่อน
              </p>
              <p class="rem2">
                5) นำแนวคิดที่ร่างไว้มาจัดทำเป็นภาพกราฟิกใน PowerPoint
                โดยใช้ฟอนต์กับขนาดตัวหนังสือที่อ่านง่าย ใช้เทคนิคทางสี
                การจัดวางหรือการซ้อนทับของรูปทรงต่างๆ
                มีการสร้างจุดเน้นจุดเด่นในส่วนที่สำคัญ
                และอาจค้นหารูปที่สื่อความหมายจากอินเทอร์มาประกอบ
                พร้อมทั้งใส่หัวข้อให้ดึงดูดใจ ตัวอย่างการทำอินโฟกราฟิกใน
                PowerPoint ดังภาพที่ 24 - ภาพที่ 31
              </p>
              <br />
              <div class="container">
                <div class="row">
                  <div class="text-center font-italic col">
                    <img src="/img/lesson3/24.png" width="100%" />
                    <p>
                      <br />ภาพที่ 24 - การ insert chart
                      เพื่อทำเป็นกราฟแท่งแบบธรรมดา
                    </p>
                  </div>
                  <br />
                  <div class="text-center font-italic col">
                    <img src="/img/lesson3/25.png" width="100%" />
                    <p>
                      <br />ภาพที่ 25 – การเปลี่ยนกราฟแท่งเป็นกราฟวงกลมแบบโดนัท
                      เพื่อนำไปจัดทำเป็นอินโฟกราฟิก
                    </p>
                  </div>
                  <br />
                  <div class="text-center font-italic col">
                    <img src="/img/lesson3/26.png" width="100%" />
                    <p>
                      <br />ภาพที่ 26 –
                      การปรับเปลี่ยนสีในกราฟเพื่อให้มีความสดใสมากขึ้น
                    </p>
                  </div>
                </div>
                <br />
                <div class="row">
                  <div class="text-center font-italic col">
                    <img src="/img/lesson3/27.png" width="100%" />
                    <p>
                      <br />ภาพที่ 27 -
                      ขั้นตอนการทำอินโฟกราฟิกโดยการนำรูปวงกลมมาซ้อนทำเป็นขอบเพื่อให้ดูมีมิติ
                    </p>
                  </div>
                  <br />
                  <div class="text-center font-italic col">
                    <img src="/img/lesson3/28.png" width="100%" />
                    <p>
                      <br />ภาพที่ 28 – การนำวงกลมสีขาวมาซ้อนทับตรงกลาง
                      และการใช้รูปสี่เหลี่ยมมาซ้อนทับเพื่อสร้างจุดเน้นจุดเด่น
                    </p>
                  </div>
                  <br />
                  <div class="text-center font-italic col">
                    <img src="/img/lesson3/29.png" width="120%" />
                    <p>
                      <br />ภาพที่ 29 - การเพิ่ม label ให้มีทั้งข้อความและตัวเลข
                    </p>
                  </div>
                  <br />
                </div>
                <br />
                <div class="row">
                  <div class="text-center font-italic col">
                    <img src="/img/lesson3/30.png" width="100%" />
                    <p>
                      <br />ภาพที่ 30 –
                      การดาวน์โหลดภาพจากอินเทอร์เน็ตมาใช้ประกอบการทำอินโฟกราฟิก
                    </p>
                  </div>
                  <br />
                  <div class="text-center font-italic col">
                    <img src="/img/lesson3/31.png" width="120%" />
                    <p>
                      <br />ภาพที่ 31
                      –อินโฟกราฟิกนำเสนอข้อมูลสถิติจำนวนชั่วโมงที่คนไทยใช้เวลากับสื่อในแต่ละวันในปี
                      พ.ศ.2563
                    </p>
                  </div>
                  <br />
                </div>
              </div>

              <br />
              <h4>การใช้ SmartArt Graphic ในการทำอินโฟกราฟิก</h4>
              <p class="rem2">
                โปรแกรม Microsoft PowerPoint มีเครื่องมือในชุด SmartArt Graphic
                จัดเป็นหมวดหมู่ที่มีโครงสร้างกราฟิกหลากหลายรูปแบบ
                ที่ผู้ใช้สามารถนำมาประยุกต์ในการสร้างอินโฟกราฟิกที่สวยงามและน่าสนใจได้
              </p>
              <br />
              <div class="text-center font-italic">
                <img src="/img/lesson3/32.png" width="60%" />
                <p>
                  <br />ภาพที่ 32 - โครงสร้างกราฟิกในชุด SmartArt Graphic ของ
                  PowerPoint
                </p>
              </div>
              <br />
              <div class="text-center font-italic">
                <img src="/img/lesson3/33.jpg" width="80%" />
                <p>
                  <br />ภาพที่ 33 - ตัวอย่างอินโฟกราฟิกที่ได้จากการประยุกต์ใช้
                  SmartArt Graphic
                </p>
              </div>
              <br />
              <p class="rem2">
                ผู้ใช้สามารถแปลงข้อความที่จัดหมวดหมู่ไว้ให้เป็นกราฟิกโดยใช้เครื่องมือ
                SmartArt Graphic
                โดยเตรียมข้อความเป็นหมวดหมู่และจัดลำดับหัวข้อใหญ่/หัวข้อย่อย
                ดังตัวอย่างต่อไปนี้
              </p>
              <br />
              <div class="text-center font-italic">
                <img src="/img/lesson3/34.png" width="60%" />
                <p><br />ภาพที่ 34 - จัดเตรียมข้อความที่จะทำเป็นอินโฟกราฟิก</p>
              </div>
              <br />
              <p class="rem2">
                เมื่อเตรียมข้อความเรียบร้อยแล้ว ไปที่ Home ใน Paragraph Group
                คลิกที่ Covert to SmartArt
                เมื่อใช้เม้าส์คลิกไปยังรูปแบบใดรูปแบบหนึ่งจะปรากฏภาพกราฟิกของข้อความในรูปแบบนั้น
                ให้เลือกรูปแบบที่เหมาะสมและตรงตามความต้องการ
                เมื่อเลือกรูปแบบที่ต้องการเลือก
                ผู้ใช้สามารถตกแต่งกราฟิกได้ตามต้องการ เช่น เปลี่ยนธีม
                เปลี่ยนสีตัวอักษร ปรับขนาดของรูปทรงและขนาดของฟอนต์ และ insert
                ภาพเข้าไป เป็นต้น
              </p>
              <br />
              <div class="container">
                <div class="row">
                  <div class="text-center font-italic col">
                    <img src="/img/lesson3/35.png" width="90%" />
                    <p>
                      <br />ภาพที่ 35 – การ convert ข้อความเป็นอินโฟกราฟิกโดยใช้
                      SmartArt
                    </p>
                  </div>
                  <br />
                  <div class="text-center font-italic col">
                    <img src="/img/lesson3/36.png" width="100%" />
                    <p>
                      <br />ภาพที่ 36 –รูปแบบที่เลือก และธีมที่เป็นสีชุดต่าง ๆ
                    </p>
                  </div>
                </div>
              </div>
              <br />
              <p class="rem2">
                หากยังไม่ชอบรูปแบบของอินโฟกราฟิกที่ได้ ผู้ใช้สามารถเปลี่ยน
                Layout ได้อย่างง่ายดาย โดยไปที่ Drawing Tools ------> Layout
                จากนั้นเลือก Layout ที่เห็นว่าเหมาะสมและตรงตามความต้องการ
              </p>
              <br />
              <div class="container">
                <div class="row">
                  <div class="text-center font-italic col">
                    <img src="/img/lesson3/37.png" width="90%" />
                    <p><br />ภาพที่ 37 – ภาพอินโฟกราฟิกหลังจากปรับแต่ง</p>
                  </div>
                  <br />
                  <div class="text-center font-italic col">
                    <img src="/img/lesson3/38.png" width="100%" />
                    <p><br />ภาพที่ 38 – การปรับเปลี่ยน Layout เป็นแบบใหม่</p>
                  </div>
                </div>
              </div>
              <br />
              <h5>สรุป</h5>
              <p class="rem2">
                โปรแกรม Microsoft PowerPoint
                เป็นโปรแกรมสำหรับการสร้างงานนำเสนอที่มีประสิทธิภาพ
                ผู้ใช้สามารถเรียนรู้การใช้งานขั้นพื้นฐานได้ไม่ยาก
                นอกจากนี้ยังมีเครื่องมือ เทคนิคและเอฟเฟ็คต่างๆ
                มากมายให้ผู้ใช้สามารถเลือกนำไปใช้ในการสร้างงานนำเสนอให้มีความน่าสนใจได้ตามความต้องการ
                สามารถนำเสนอได้ทั้งข้อความ ภาพนิ่ง ภาพเคลื่อนไหว เสียงและวิดีโอ
                และที่โดดเด่น คือ
                มีเครื่องมืออย่างหลากหลายสำหรับให้ผู้ใช้นำไปทำอินโฟกราฟิก
                เพื่อการนำเสนอให้มีความน่าสนใจ รวมทั้ง SmartArt
                ที่อำนวยความสะดวกให้ผู้ใช้สามารถทำอินโฟกราฟิกได้อย่างง่ายดาย
                อย่างไรก็ตามการสร้างงานนำเสนอที่มีประสิทธิภาพ
                รวมทั้งการสร้างสรรค์อินโฟกราฟิกที่สวยงาม
                น่าสนใจและสื่อความหมายได้ดีนั้น นอกจากเนื้อหาสาระแล้ว
                ยังขึ้นอยู่กับความสามารถและทักษะการใช้งานโปรแกรม Microsoft
                PowerPoint ตลอดจนความคิดสร้างสรรค์ของผู้สร้างงานนำเสนอ
                ดังนั้นผู้ที่สนใจ ควรมั่นศึกษาหาความรู้และเทคนิคการใช้งานโปรแกรม
                และมั่นฝึกฝนการใช้งานอยู่เสมอ
                เพื่อจะสามารถสร้างงานนำเสนอให้มีความน่าสนใจและมีประสิทธิภาพมากยิ่งขึ้น
              </p>

              <!-- -------------------------------- -->
              <br />
              <br />
              <br />
              <br />
              <div class="container">
                <div class="row">
                  <div class="col-auto mr-auto">
                    <router-link to="/lesson3_1" title="Lesson3_1 Page">
                      <div class="btn-wrapper">
                        <base-button
                          tag="a"
                          target="_blank"
                          rel="noopener noreferrer"
                          class="mb-3 mb-sm-0"
                          outline
                          type="info"
                          icon="fa fa-chevron-left"
                          >Previous</base-button
                        >
                      </div>
                    </router-link>
                  </div>
                  <div class="col-auto">
                    <div class="btn-wrapper">
                      <base-button
                        tag="a"
                        target="_blank"
                        rel="noopener noreferrer"
                        class="mb-3 mb-sm-0"
                        outline
                        type="info"
                      >
                        Next
                        <i class="fa fa-chevron-right" aria-hidden="true"></i>
                      </base-button>
                    </div>
                  </div>
                </div>
              </div>
            </div>
          </div>
        </div>
      </section>

      <hr />
      <div class="col-lg-center">
        <div class="pt-4 text-center">
          <h5 class="title">
            <span class="d-block mb-1">Author | Dr.Udomluk Thampunya</span>
            <small class="h6 text-black"
              >Lecturer in the Digital Communications at Maejo University</small
            >
          </h5>
        </div>
      </div>
      <hr />
    </div>
  </div>
</template>

<script>
export default {
  name: "home",
  components: {},
};
</script>

<style></style>
