<template>
  <div>
    <div class="position-relative">
      <section class="section-shaped my-0">
        <div class="shape shape-style-1 shape-default">
          <span></span>
          <span></span>
          <span></span>
          <span></span>
          <span></span>
          <span></span>
          <span></span>
          <span></span>
          <span></span>
        </div>

        <div class="container shape-container d-flex">
          <div class="col px-0"></div>
        </div>
      </section>

      <section class="section section-shaped my-0 overflow-hidden">
        <div class="container pb-80">
          <div class="row justify-content-center">
            <div class="fontx col-lg-10">
              <!-- -------------------------------- -->

              <h2 class="display-3 text-center">
                การจัดการข้อมูลและเอกสาร<br />
                แบบออนไลน์ด้วย Google Docs & Google Form
              </h2>

              <br />
              <p class=" text-justify" style="text-indent: 2.5em;">
                จากการพัฒนาของระบบอินเตอร์เน็ตที่เป็นไปอย่างก้าวกระโดดจึงทำให้ในปัจจุบันเทคโนโลยีดิจิทัลได้เข้ามามีบทบาทสำคัญในวิถีชีวิตของคนทั้งโลก
                ดังจะเห็นได้จากการทำงานแทบทั้งหมดในปัจจุบันล้วนอยู่บนคอมพิวเตอร์และระบบอินเตอร์เน็ต
                รวมถึงงานและกิจกรรมต่างๆ
                ที่ยังคงดำเนินการในแบบเดิมได้มีแนวโน้มที่จะปรับไปในทิศทางที่เข้าสู่ความเป็นดิจิทัลอย่างต่อเนื่อง
                ในส่วนของงานด้านข้อมูลและเอกสารก็ถูกปรับเปลี่ยนรูปแบบจากการพิมพ์จากเครื่องพิมพ์ดีดลงบนกระดาษ
                กลายมาเป็นการพิมพ์งานผ่านเครื่องคอมพิวเตอร์หรือแม้แต่โทรศัพท์เคลื่อนที่อย่างที่เราคุ้นเคยกันดีในช่วงไม่กี่ปีมานี้
                พร้อมกันนี้เพื่อบริหารทรัพยากรและเวลาให้มีประสิทธิภาพมากที่สุด
                หลายองค์กรเริ่มปรับตัวให้ลักษณะการทำงานของพนักงานสามารถกระทำได้ได้โดยไม่ขึ้นอยู่กับสถานที่
                สามารถติดต่อประสานงานหรือทำงานได้ทุกที่เพียงแค่มีอินเตอร์เน็ต
                ด้วยเหตุดังกล่าว โปรแกรมต่างๆ ที่เราเคยใช้
                จึงถูกปรับไปเป็นลักษณะของการให้บริการแบบออนไลน์กันมากขึ้น
                โดยมีสองบริษัทใหญ่ที่ได้นำเสนอชุดบริการเพื่อตอบสนองรูปแบบการทำงานที่เปลี่ยนไปเหล่านั้น
                คือ กูเกิล (Google) ที่ได้นำเสนอจีสูท (G-Suite) และไมโครซอฟต์
                (Microsoft) ที่ได้นำเสนอออฟฟิศ 365 (Office 365)
                ซึ่งบริการของทั้งคู่ตั้งอยู่บนการให้บริการผ่านอินเตอร์เน็ตเพื่อให้บุคคลหรือองค์กรต่างๆ
                สามารถจัดการงานเอกสาร อีเมล งานนำเสนอ ฯลฯ ได้อย่างมีประสิทธิภาพ
              </p>
              <p style="text-indent: 2.5em;">
                จากความสำคัญและประโยชน์ของบริการที่กล่าวมาข้างต้น
                ในหัวข้อต่อไปนี้จึงได้หยิบยกเอาบริการสองบริการที่น่าสนใจและใกล้ตัวจากกูเกิล
                ประกอบด้วย กูเกิลเอกสาร (Google Docs) และกูเกิลฟอร์ม (Google
                Form) มานำเสนอ
                ซึ่งผู้อ่านสามารถนำไปใช้ให้เกิดประโยชน์และช่วยเพิ่มศักยภาพในการทำงานของตนเอง
                ได้ในอนาคต
              </p>
              <br />

              <h5>1. ทำความรู้จักกับ กูเกิล</h5>
              <p class="text-justify" style="text-indent: 2.5em;">
                กูเกิล (Google Inc.)
                เป็นบริษัทขนาดใหญ่ที่ให้บริการเกี่ยวกับข้อมูลและมีบริการหลากหลายประเภท
                ครอบคลุมประเทศทั่วทั้งโลก (ตัวอย่างบริการต่างๆ ดังแสดงในรูปที่
                1)
                โดยมีพันธกิจหลักคือการจัดระเบียบข้อมูลในโลกนี้และทำให้เข้าถึงได้ง่ายในทุกที่และมีประโยชน์
                
                ซึ่งบริการที่เป็นที่รู้จักในวงกว้างและสร้างชื่อเสียงให้กับกูเกิลคือการให้บริการเครื่องมือการค้นหาข้อมูลในเครือข่ายอินเตอร์เน็ตและการให้บริการอีเมลล์
                ซึ่งบริการส่วนใหญ่ไม่เก็บค่าบริการ โดยทุกๆ
                บริการของกูเกิลจะสามารถเข้าถึงได้ผ่านบัญชีของกูเกิล (Google
                Account) ดังนั้นหากต้องการใช้บริการของกูเกิลแล้ว
                ผู้ใช้จำเป็นที่จะต้องลงทะเบียนเพื่อขอบัญชีของกูเกิลเป็นอันดับแรก
                (ซึ่งไม่มีค่าใช้จ่ายเช่นกัน)
                นอกจากนี้กูเกิลยังได้พัฒนาบริการที่สามารถช่วยจัดการเรื่องข้อมูลและเอกสารแบบออนไลน์ได้
                โดยเราจะเข้าสู่รายละเอียดของบริการดังกล่าวในหัวข้อถัดไป
              </p>
              <br />
              <div
                class="text-center font-italic"
                @click="modals.modal1 = true"
              >
                <img src="/img/lesson1/p1.png" width="80%" />
                <p><br />รูปที่ 1 ตัวอย่างบริการต่างๆ ของกูเกิล</p>
              </div>

              <modal :show.sync="modals.modal1">
                <h6 slot="header" class="modal-title" id="modal-title-default">
                  รูปที่ 1 ตัวอย่างบริการต่างๆ ของกูเกิล
                </h6>
                <img src="/img/lesson1/p1.png" width="100%" />
              </modal>

              <br />
              <h5>
                2.
                ชุดเครื่องมือจากกูเกิลที่ใช้สำหรับจัดการงานด้านข้อมูลและเอกสารแบบออนไลน์
              </h5>
              <p class="text-justify" style="text-indent: 2.5em;">
                ชุดเครื่องมือจากกูเกิลที่ใช้สำหรับจัดการงานด้านเอกสารและข้อมูลจะเป็นการให้บริการแบบออนไลน์แทนที่การติดตั้งโปรแกรมประมวลผลคำลงบนเครื่องคอมพิวเตอร์
                ด้วยเหตุนี้เองการประมวลผลโดยส่วนใหญ่จึงถูกดำเนินการที่เครื่องเซิร์ฟเวอร์
                (Server) ของผู้ให้บริการ
                จึงทำให้แม้แต่อุปกรณ์ขนาดเล็กที่มีกำลังการประมวลผลต่ำอย่างแทปเล็ตหรือสมาร์ทโฟนสามารถใช้งานการประมวลผลคำหรือจัดการเกี่ยวกับข้อมูลต่างๆ
                ของผู้ใช้ได้อย่างง่ายดายเสมือนหนึ่งดำเนินการบนคอมพิวเตอร์แบบตั้งโต๊ะ
                ซึ่งในชุดเครื่องมือที่ใช้ดำ
                เนินการด้านเอกสารและข้อมูลของกูเกิลประกอบด้วย 4
                แอปพลิเคชันหลักที่สามารถดำเนินการกับข้อมูลและเอกสารในรูปแบบที่แตกต่างกันได้
                มีดังต่อไปนี้ (รูปไอคอนของแอปพลิเคชันแสดงในรูปที่ 2)
              </p>
              <div
                class="text-center font-italic"
                @click="modals.modal2 = true"
              >
                <img src="/img/lesson1/p2.png" width="80%" />
                <p>
                  <br />รูปที่ 2
                  ไอคอนของแอปพลิเคชันที่ใช้สำหรับจัดการเอกสารของกูเกิล
                </p>
              </div>
              <modal :show.sync="modals.modal2">
                <h6 slot="header" class="modal-title" id="modal-title-default">
                  ไอคอนของแอปพลิเคชันที่ใช้สำหรับจัดการเอกสารของกูเกิล
                </h6>
                <img src="/img/lesson1/p2.png" width="100%" />
              </modal>
              <br />
              <div style="text-indent: 2.5em;">
                <b>1) กูเกิลเอกสาร (Google Docs)</b>
                เป็นเครื่องมือที่มีไว้สำหรับประมวลผลคำ
                สามารถสร้างและแก้ไขเอกสารและข้อความทั่วไป
                ซึ่งเทียบเคียงได้กับโปรแกรมไมโครซอฟต์เวิร์ดของบริษัทไมโครซอฟต์
              </div>
              <div style="text-indent: 2.5em;">
               <b> 2) กูเกิลชีต (Google Sheets)</b> เป็นเครื่องมือที่มีไว้สำหรับสร้าง
                แก้ไข จัดการเสปรดชีต (Spreadsheets)
                เพื่อการดำเนินการบนข้อมูลต่างๆ โดยเฉพาะด้านตัวเลข
                ที่จะสามารถควบคุมการแสดงผลด้วยสูตรทางคณิตศาสตร์ได้
                ซึ่งเทียบเคียงได้กับโปรแกรมไมโครซอฟต์เอ็กเซลของบริษัทไมโครซอฟต์
              </div>
              <div style="text-indent: 2.5em;">
                <b>3) กูเกิลสไลด์ (Google Slides) </b>เป็นเครื่องมือที่มีไว้สำหรับสร้าง
                แก้ไข จัดการการนำเสนอ
                ซึ่งเทียบเคียงได้กับโปรแกรมไมโครซอฟต์เพาเวอร์พอยต์ของบริษัทไมโครซอฟต์
              </div>
              <div style="text-indent: 2.5em;">
                <b>4) กูเกิลฟอร์ม (Google Forms)</b> เป็นเครื่องมือที่มีไว้สำหรับสร้าง
                แก้ไข จัดการแบบฟอร์ม แบบทดสอบ แบบสอบถาม หรือคำเชิญต่างๆ เป็นต้น
                นอกจากนี้ยังสามารถแชร์แบบฟอร์มกับผู้อื่นได้อย่างง่ายดาย
              </div>
              <br />
              <h5 class="text-decoration-underline" style="text-indent: 2.5em;">
                ในการใช้งานเครื่องมือต่างๆ ของกูเกิล
                หากผู้ใช้มีหรือลงทะเบียนบัญชีผู้ใช้ของกูเกิลแล้วสามารถการเข้าใช้งานเครื่องมือต่างๆ
                ของกูเกิลโดยมีขั้นตอน ดังนี้
              </h5>
              <br>
              <p style="text-indent: 2.5em;">
                1) เปิดเว็บเว็บเบราว์เซอร์ในเครื่องคอมพิวเตอร์
                (หากต้องการใช้งานผ่านสมาร์ทโฟนสามารถดาวน์โหลดแอปพลิเคชันที่ต้องการมาติดตั้งบนสมาร์ทโฟน
                และเข้าใช้งานผ่านบัญชีกูเกิลของตนเองได้ทันที)
              </p>
              <p style="text-indent: 2.5em;">
                2) พิมพ์ www.google.com ลงในช่อง URL
              </p>
              <p style="text-indent: 2.5em;">
                3) ลงชื่อเข้าใช้ด้วยการคลิกที่ ปุ่ม “ลงชื่อเข้าสู่ระบบ”
                ดังแสดงในรูปที่ 3 (ในส่วน A)
              </p>
              <p style="text-indent: 2.5em;">
                4) เปิดตัวเลือกแอปพลิเคชันโดยการคลิกที่ ปุ่มแสดงแอปพลิเคชัน
                ดังแสดงในรูปที่ 3 (ในส่วน B)
              </p>
              <p style="text-indent: 2.5em;">
                5) จากนั้นเลือกแอปพลิเคชันที่ต้องการเข้าใช้งาน
                (ซึ่งกูเกิลเอกสารและกูเกิลฟอร์มจะปรากฏอยู่ในส่วนนี้ด้วย
                และหากไม่ปรากฏ สามารถกดปุ่ม “เพิ่มเติมจาก Google”
                เพื่อค้นหาแอปพลิเคชันที่ต้องการได้)
              </p>
              <div
                class="text-center font-italic"
                @click="modals.modal3 = true"
              >
                <img src="/img/lesson1/p3.png" width="80%" />
                <p>
                  <br />รูปที่ 3 การลงชื่อเข้าใช้บัญชีกูเกิล (A)
                  และการเปิดตัวเลือกแอปพลิเคชัน (B)
                </p>
              </div>
              <modal :show.sync="modals.modal3">
                <h6 slot="header" class="modal-title" id="modal-title-default">
                  รูปที่ 3 การลงชื่อเข้าใช้บัญชีกูเกิล (A)
                  และการเปิดตัวเลือกแอปพลิเคชัน (B)
                </h6>
                <img src="/img/lesson1/p3.png" width="100%" />
              </modal>
              <br />
              <h5 style="text-indent: 2.5em;">
                โดยชุดเครื่องมือจากกูเกิลที่ใช้สำหรับจัดการงานด้านเอกสารแบบออนไลน์
                มีข้อดีหลายประการ อาทิ
              </h5>
              <br>
              <p style="text-indent: 2.5em;">
                1) ใช้งานได้ฟรีโดยไม่มีค่าใช้จ่ายเพียงมีบัญชีของกูเกิล
                (โดยบัญชีของกูเกิลจะมาพร้อมกับพื้นที่เก็บข้อมูลบนบริการกูเกิลไดรฟ์ฟรีขนาด
                15 กิกะไบต์ ซึ่งเพียงพอต่อการใช้งานในเบื้องต้น)
              </p>
              <p style="text-indent: 2.5em;">
                2)
                สามารถจัดการเอกสารได้ด้วยเว็บเบราว์เซอร์ผ่านเครือข่ายอินเตอร์เน็ต
                โดยไม่ต้องติดตั้งโปรแกรมลงบนเครื่องคอมพิวเตอร์
              </p>
              <p style="text-indent: 2.5em;">
                3) สามารถจัดการเอกสารบนสมาร์ทโฟนได้
                เสมือนหนึ่งดำเนินการบนเครื่องคอมพิวเตอร์
              </p>
              <p style="text-indent: 2.5em;">
                4) สามารถทำงานร่วมกันหลายบัญชีผู้ใช้ ได้
                และสามารถแชร์งานระหว่างผู้อื่นได้อย่างง่ายดาย
                โดยสามารถกำหนดสิทธิ์ของผู้ใช้แต่ละคนได้หลากหลายรูปแบบ เช่น
                สามารถเข้าดูได้เพียงอย่างเดียว หรือ สามารถแก้ไขได้
                หรือสามารถดาวน์โหลดงานได้เป็นต้น
              </p>
              <p style="text-indent: 2.5em;">
                5) มีความสามารถในการควบคุมเวอร์ชัน (Version control) ของเอกสาร
                ทำให้สามารถเรียกคืนเอกสารเวอร์ชันใดๆ ที่ต้องการมาใช้งานได้
              </p>
              <br />
              <h5>3. กูเกิลเอกสาร</h5>
              <h6 style="text-indent: 2.5em;">
                3.1. ภาพรวม องค์ประกอบและเครื่องมือต่างๆ ของกูเกิลเอกสาร
              </h6>
              <p style="text-indent: 2.5em;">
                กูเกิลเอกสารเป็นบริการ หรือเครื่องมือในการจัดการเอกสารและประมวลผลคำที่สามารถสร้างและแก้ไขเอกสารได้อย่างยืดหยุ่น
                หลากหลายที่มาพร้อมกับความสามารถที่โดดเด่นในด้านการทำงานร่วมกันแบบออนไลน์
                โดยจะทำงานภายใต้การจัดการไฟล์ผ่านกูเกิลไดรฟ์
                ซึ่งจะเป็นการเก็บข้อมูลไว้บนคลาวน์ของกูเกิลเอง
              </p>
              <div
                class="text-center font-italic"
                @click="modals.modal4 = true"
              >
                <img src="/img/lesson1/p4.png" width="80%" />
                <p><br />รูปที่ 4 ภาพรวมและองค์ประกอบของกูเกิลเอกสาร</p>
              </div>
              <modal :show.sync="modals.modal4">
                <h6 slot="header" class="modal-title" id="modal-title-default">
                  รูปที่ 4 ภาพรวมและองค์ประกอบของกูเกิลเอกสาร
                </h6>
                <img src="/img/lesson1/p4.png" width="100%" />
              </modal>

              <br />
              <p class="rem2">
                จากรูปที่ 4 แสดงให้เห็นถึงหน้าตาภาพรวมและเครื่องมือต่างๆ
                ของกูเกิลเอกสาร
                ซึ่งจะมีความคล้ายคลึงกับโปรแกรมไมโครซอฟต์ออฟฟิศที่ได้นำเสนอเนื้อหาไปก่อนหน้านี้แล้ว
                ในที่นี้จะอธิบายรายละเอียดของเครื่องมือต่างๆ
                ของกูเกิลเอกสารพอสังเขปโดยแยกเป็นส่วนๆ
                และเรียงลำดับปุ่มเครื่องมือต่างๆ จากซ้ายไปขวาดังนี้
              </p>

              <div class="rem2"><b>1) ส่วน A :</b> ส่วนของการจัดการไฟล์งาน</div>
              <p class="rem5">
                • ช่องข้อความ เป็นส่วนของการกำหนดชื่อไฟล์งาน
                โดยสามารถคลิกลงตรงช่อง “เอกสารไม่มีชื่อ”
                จากนั้นพิมพ์ชื่อไฟล์ที่ต้องการตั้งลงไปได้ทันที
              </p>
              <p class="rem5">
                • สัญลักษณ์รูปดาว เป็นส่วนของการติดดาวให้กับไฟล์
                (ใช้เพื่อแยกหมวดหมู่ของไฟล์ในกูเกิลไดรฟ์)
              </p>
              <p class="rem5">
                • ปุ่มย้าย เป็นการย้ายที่เก็บไฟล์ไปยังโฟลเดอร์อื่นๆ ในกูเกิลไดรฟ์
              </p>
              <div class="rem2">
                <b>2) ส่วน B :</b>
                เป็นเมนูเพื่อใช้ดำเนินการกับเอกสารและข้อมูลที่พิมพ์ลงไป
                ซึ่งจะแสดงตัวเลือกเพิ่มเติมเมื่อคลิก
              </div>
              <div class="rem2">
                <b>3) ส่วน C :</b>
                เป็นส่วนของการแสดงสถานะของเอกสารว่าถูกบันทึกการทำงานลงบนไฟล์ไว้แล้วหรือไม่
                โดยข้อดีของกูเกิลเอกสารคือ ทุกครั้งหลังจากที่มีการแก้ไขเอกสาร
                การดำเนินการนั้นจะถูกบันทึกโดยอัตโนมัติ
                ผู้ใช้ไม่จำเป็นต้องกดบันทึกด้วยตนเอง
                (และหากการเชื่อมต่อสัญญาณอินเตอร์เน็ตขัดข้อง
                กูเกิลเอกสารจะแสดงข้อความเตือนไว้ในส่วนนี้เช่นกัน)
              </div>
              <div class="rem2">
                <b>4) ส่วน D :</b> เป็นเครื่องมือลัดในการแก้ไขเอกสาร
                เพียงคลิกที่ปุ่มต่างๆ ที่ต้องการ
                จากนั้นระบบจะแสดงผลลัพธ์การแก้ไขให้ทันที
                ซึ่งช่วยให้การแก้ไขเอกสารเกิดความสะดวกอย่างมาก
              </div>
              <div class="rem2">
                <b>5) ส่วน E :</b> (จากซ้ายไปขวา)
                ปุ่มแสดงประวัติความคิดเห็นที่มีการเขียนไว้ในไฟล์งานนี้
                และปุ่มตั้งค่าการแชร์ไฟล์กับบุคคลอื่น
              </div>
              <div class="rem2">
                <b>6) ส่วน F :</b> เป็นส่วนของการกำหนดโหมดการดำเนินการกับเอกสาร
                ประกอบด้วย 3 โหมด ดังรูปที่ 5 โดย
              </div>
              <p class="rem5">
                • โหมด “การแก้ไข” จะเป็นการทำงานโดยปกติ
                การแก้ไขทุกอย่างในเอกสารจะถูกบันทึกปกติ
              </p>
              <p class="rem5">
                • โหมด “การแนะนำ”
                โหมดนี้สามารถช่วยให้การทำงานเป็นทีมเป็นเรื่องง่ายขึ้น
                หากผู้ใช้ทำงานอยู่ในโหมดนี้การแก้ไขเอกสารจะถูกบันทึกว่าเป็นการแนะนำและแสดงให้ผู้ใช้ทุกคนเห็น
                และเมื่อมีผู้ใช้กดยอมรับ
                ก็จะทำให้เอกสารนั้นถูกแก้ไขตามที่แนะนำโดยทันที
              </p>
              <p class="rem5">
                • โหมด “ดู” จะเป็นมุมมองเสมือนตอนพิมพ์จากเครื่องพิมพ์
              </p>
              <div class="rem2">
                <b>7) ส่วน H :</b> เป็นพื้นที่ของการทำงาน
                (เอกสารที่ต้องการสร้างหรือแก้ไข)
              </div>
              <br />
              <div
                class="text-center font-italic"
                @click="modals.modal5 = true"
              >
                <img src="/img/lesson1/p5.png" width="40%" />
                <p><br />รูปที่ 5 โหมดการแก้ไข</p>
              </div>
              <modal :show.sync="modals.modal5">
                <h6 slot="header" class="modal-title" id="modal-title-default">
                  รูปที่ 5 โหมดการแก้ไข
                </h6>
                <img src="/img/lesson1/p5.png" width="100%" />
              </modal>
              <br />

              <br />
              <br />
              <br />
              <br />

              <!-- -------------------------------- -->
              <div class="container">
                <div class="row">
                  <div class="col-auto mr-auto">
                    <router-link to="/lesson1_2" title="Lesson1_2 Page">
                      <div class="btn-wrapper">
                        <base-button
                          tag="a"
                          target="_blank"
                          rel="noopener noreferrer"
                          class="mb-3 mb-sm-0"
                          outline
                          type="info"
                          icon="fa fa-chevron-left"
                          >ย้อนกลับ</base-button
                        >
                      </div>
                    </router-link>
                  </div>
                  <div class="col text-center">
                    <div class="btn-wrapper">
                      <base-button
                        id="back-to-top"
                        href="#"
                        role="button"
                        tag="a"
                        rel="noopener noreferrer"
                        class="btn  back-to-top"
                        outline
                        type="info"
                      >
                        <i class="fa fa-chevron-up" aria-hidden="true"></i>
                      </base-button>
                    </div>
                  </div>
                  <div class="col-auto">
                    <router-link to="/lesson1_4" title="Lesson1_4 Page">
                      <div class="btn-wrapper">
                        <base-button
                          tag="a"
                          target="_blank"
                          rel="noopener noreferrer"
                          class="mb-3 mb-sm-0"
                          outline
                          type="info"
                        >
                          ถัดไป
                          <i class="fa fa-chevron-right" aria-hidden="true"></i>
                        </base-button>
                      </div>
                    </router-link>
                  </div>
                </div>
              </div>
              <div class="text-center mt-5">Page 3/4</div>
            </div>
          </div>
        </div>
      </section>

      <hr />
      <div class="col-lg-center">
        <div class="pt-4 text-center">
          <h5 class="title">
            <span class="d-block mb-1">Author | Dr.Nasi Tantitharanukul</span>
            <small class="h6 text-black"
              >Lecturer in the Computer Science Division at Maejo
              University</small
            >
          </h5>
        </div>
      </div>
      <hr />
    </div>
  </div>
</template>

<script>
import Modal from "@/components/Modal.vue";
export default {
  name: "home",
  components: {
    Modal,
  },
  data() {
    return {
      modals: {
        modal1: false,
        modal2: false,
        modal3: false,
        modal4: false,
        modal5: false,
        modal6: false,
        modal7: false,
        modal8: false,
        modal9: false,
        modal10: false,
        modal11: false,
        modal12: false,
        modal13: false,
        modal14: false,
        modal15: false,
      },
    };
  },
};
</script>

<style></style>
