<template>
  <div>
    <div class="position-relative">
      <section class="section-shaped my-0">
        <div class="shape shape-style-1 shape-default">
          <span></span>
          <span></span>
          <span></span>
          <span></span>
          <span></span>
          <span></span>
          <span></span>
          <span></span>
          <span></span>
        </div>

        <div class="container shape-container d-flex">
          <div class="col px-0"></div>
        </div>
      </section>

      <section class="section section-shaped my-0 overflow-hidden">
        <div class="container pb-80">
          <div class="row justify-content-center">
            <div class="fontx col-lg-10">
              <!-- -------------------------------- -->
              <h5 class="text-center">ตัวอย่างโครงสร้างระบบฐานข้อมูล</h5>
              <br />
              <table class="table">
                <thead>
                  <tr>
                    <th scope="col">ฐานข้อมูล (Database)</th>
                    <td>ไฟล์นักศึกษา, ไฟล์วิชา, ไฟล์การลงทะเบียน</td>
                  </tr>
                </thead>
                <tbody>
                  <tr>
                    <th scope="row">
                      แฟ้มข้อมูล (File) หรือ ตารางข้อมูล (Table)
                    </th>
                    <table class="table">
                      <thead>
                        <tr>
                          <th scope="col">ชื่อนักศึกษา</th>
                          <th scope="col">นามสกุล</th>
                          <th scope="col">ที่อยู่</th>
                          <th scope="col">เบอร์โทร</th>
                        </tr>
                      </thead>
                      <tbody>
                        <tr>
                          <td>สายสมร</td>
                          <td>อุตสาหะ</td>
                          <td>1/10 ต.สันป่าข่อย อ.เมือง จ.เชียงใหม่ 50000</td>
                          <td>081-555-6789</td>
                        </tr>
                        <tr>
                          <td>มนตรี</td>
                          <td>สุดใจ</td>
                          <td>2 ต.เวียงป่าเป้า จ.เชียงราย</td>
                          <td>081-555-1234</td>
                        </tr>
                      </tbody>
                    </table>
                  </tr>
                  <tr>
                    <th scope="row">แถว หรือ ระเบียนข้อมูล (record)</th>
                    <table class="table">
                      <thead>
                        <tr>
                          <th scope="col">ชื่อนักศึกษา</th>
                          <th scope="col">นามสกุล</th>
                          <th scope="col">ที่อยู่</th>
                          <th scope="col">เบอร์โทร</th>
                        </tr>
                      </thead>
                      <tbody>
                        <tr>
                          <td>สายสมร</td>
                          <td>อุตสาหะ</td>
                          <td>1/10 ต.สันป่าข่อย อ.เมือง จ.เชียงใหม่ 50000</td>
                          <td>704-555-6789</td>
                        </tr>
                      </tbody>
                    </table>
                  </tr>
                  <tr>
                    <th scope="row">
                      เขตข้อมูล หรือ ฟิลด์ (Field) หรือ แอททริบิวส์ หรือ คอลัมน์
                    </th>
                    <td>
                      อุตสาหะ (นามสกุล)
                      <br />สายสมร (ชื่อนักศึกษา) <br />1/10 ต.สันป่าข่อย
                      อ.เมือง จ.เชียงใหม่ 50000 (ที่อยู่) <br />704-555-6789
                      (เบอร์โทร)
                    </td>
                  </tr>
                  <tr>
                    <th scope="row">ไบต์ (Bite) หรือ ตัวอักษร (Character)</th>
                    <tbody>
                      <tr>
                        <td>ส</td>
                        <td>า</td>
                        <td>ย</td>
                        <td>ส</td>
                        <td>ม</td>
                        <td>ร</td>
                      </tr>
                    </tbody>
                  </tr>
                  <tr>
                    <th scope="row">บิต (Bit)</th>
                    <td>0 หรือ 1</td>
                  </tr>
                </tbody>
              </table>
              <br />
              <p class="rem2 text-justify">
                ระบบฐานข้อมูลที่ได้รับความนิยมในปัจจุบันได้แก่
                ระบบฐานข้อมูลเชิงสัมพันธ์ จะมีการจัดเก็บข้อมูลในรูปแบบตาราง
                (Table) สองมิติซึ่งภายในตารางจะแบ่งออกเป็น แถว และ คอลัมน์ โดย
                แถว (Row) เรียกอีกอย่างว่าระเบียนหรือเรคคอร์ด (Record) และ
                คอลัมน์ (Column) เรียกอีกอย่างว่าเขตข้อมูล หรือฟิลด์ (Field)
                หรือ แอททริบิวท์ (Attribute) และในการเชื่อมโยงความสัมพันธ์
                ระหว่างตารางจะมีการกำหนดใช้คีย์หลัก (Primary Key) และ คีย์นอก
                (Foreign Key)
              </p>
              <p class="rem2 text-justify">
                ตัวอย่างการจัดเก็บข้อมูลของพนักงานในแต่ละสาขา
                จะเห็นได้ว่าในตารางพนักงานมีการกำหนดให้แอททริบิวท์รหัสพนักงาน
                เป็นคีย์หลักของตารางและมีแอททริบิวท์รหัสสาขาเป็นคีย์นอก
                และตารางสาขามีการกำหนดแอททริบิวท์รหัสสาขาเป็นคีย์หลัก
              </p>
              <br />
              <h5>ตารางข้อมูลพนักงาน (Employee)</h5>
              <br />
              <table class="table table-striped text-center">
                <thead>
                  <tr>
                    <th scope="col">
                      รหัสพนักงาน (คีย์หลัก)
                    </th>
                    <th scope="col">ชื่อ-สกุล</th>
                    <th scope="col">ตำแหน่ง</th>
                    <th scope="col">เงินเดือน</th>
                    <th class="text-danger" scope="col">
                      รหัสสาขา (คีย์นอก)
                    </th>
                  </tr>
                </thead>
                <tbody>
                  <tr>
                    <td>SG21</td>
                    <td>ชูชาติ สุขศรี</td>
                    <td>ผู้จัดการ</td>
                    <td>25000</td>
                    <td class="text-danger">B005</td>
                  </tr>
                  <tr>
                    <td>SG37</td>
                    <td>ศิริ ดวงเด่น</td>
                    <td>ผู้ช่วย</td>
                    <td>40000</td>
                    <td class="text-danger">B003</td>
                  </tr>
                  <tr>
                    <td>SG14</td>
                    <td>ดวงใจ มีสุข</td>
                    <td>เลขานุการ</td>
                    <td>20000</td>
                    <td class="text-danger">B003</td>
                  </tr>
                  <tr>
                    <td>SG08</td>
                    <td>อัจฉรา ดวงดี</td>
                    <td>ผู้จัดการ</td>
                    <td>30000</td>
                    <td class="text-danger">B007</td>
                  </tr>
                </tbody>
              </table>
              <br />
              <h5>ตารางข้อมูลสาขา (Branch)</h5>
              <br />
              <table class="table table-striped text-center">
                <thead>
                  <tr>
                    <th class="text-danger" scope="col">
                      รหัสสาขา (คีย์นอก)
                    </th>
                    <th scope="col">ที่อยู่</th>
                  </tr>
                </thead>
                <tbody>
                  <tr>
                    <td class="text-danger">E105</td>
                    <td>ลำปาง</td>
                  </tr>
                  <tr>
                    <td class="text-danger">E103</td>
                    <td>กรุงเทพ</td>
                  </tr>
                  <tr>
                    <td class="text-danger">E106</td>
                    <td>พิษณุโลก</td>
                  </tr>
                </tbody>
              </table>
              <br />
              <h5>เมื่อนำข้อมูลสองตารางมารวมกัน ได้ดังนี้</h5>
              <br />
              <table class="table table-striped text-center">
                <thead>
                  <tr>
                    <th scope="col">
                      รหัสพนักงาน (คีย์หลัก)
                    </th>
                    <th scope="col">ชื่อ-สกุล</th>
                    <th scope="col">ตำแหน่ง</th>
                    <th scope="col">เงินเดือน</th>
                    <th scope="col">
                      รหัสสาขา (คีย์นอก)
                    </th>
                    <th scope="col">ที่อยู่</th>
                  </tr>
                </thead>
                <tbody>
                  <tr>
                    <td>SG21</td>
                    <td>ชูชาติ สุขศรี</td>
                    <td>ผู้จัดการ</td>
                    <td>25000</td>
                    <td>B005</td>
                    <td>ลำปาง</td>
                  </tr>
                  <tr>
                    <td>SG37</td>
                    <td>ศิริ ดวงเด่น</td>
                    <td>ผู้ช่วย</td>
                    <td>40000</td>
                    <td>B003</td>
                    <td>กรุงเทพ</td>
                  </tr>
                  <tr>
                    <td>SG14</td>
                    <td>ดวงใจ มีสุข</td>
                    <td>เลขานุการ</td>
                    <td>20000</td>
                    <td>B003</td>
                    <td>กรุงเทพ</td>
                  </tr>
                  <tr>
                    <td>SG08</td>
                    <td>อัจฉรา ดวงดี</td>
                    <td>ผู้จัดการ</td>
                    <td>30000</td>
                    <td>B007</td>
                    <td>พิษณุโลก</td>
                  </tr>
                </tbody>
              </table>
              <br />
              <p class="rem2 text-justify">
                ภายในระบบฐานข้อมูลจะมีระบบจัดการฐานข้อมูล หรือ DBMS (Database
                Management System)
                ซึ่งเป็นซอฟต์แวร์ระบบที่ใช้ในการจัดการฐานข้อมูลซึ่งเปรียบเสมือนเป็นสื่อกลางระหว่างผู้ใช้และโปรแกรมประยุกต์ต่างๆ
                ที่เกี่ยวข้องกับการใช้ฐานข้อมูล
                มีหน้าที่ช่วยให้ผู้ใช้เข้าถึงข้อมูลได้อย่างสะดวกและมีประสิทธิภาพ
                สามารถใช้ข้อมูลที่เกี่ยวข้องในระบบงานต่างๆ ร่วมกันได้
                โดยที่จะไม่เกิดความซ้ำซ้อนของข้อมูล
                และยังสามารถหลีกเลี่ยงความขัดแย้งของข้อมูลด้วย
                อีกทั้งข้อมูลในระบบก็จะถูกต้องเชื่อถือได้ และเป็นมาตรฐานเดียวกัน
                โดยจะมีการกำหนดระบบความปลอดภัยของข้อมูลขึ้น
                ปัจจุบันระบบจัดการฐานข้อมูลที่ได้รับความนิยมได้แก่ MySQL
                Microsoft SQL Server Oracle และ DB2 เป็นต้น
                บุคคลที่ทำหน้าที่ดูแลระบบฐานข้อมูลเรียกว่า
                ผู้บริหารระบบฐานข้อมูล (Database Administratior)
              </p>
              <br />
              <div
                class="text-center font-italic col"
                @click="modals.modal1 = true"
              >
                <img src="/img/lesson8/2.png" width="70%" />
                <p><br />รูปแสดงการทำงานของระบบจัดการฐานข้อมูล (DBMS)</p>
              </div>
              <modal :show.sync="modals.modal1">
                <h6 slot="header" class="modal-title" id="modal-title-default">
                  รูปแสดงการทำงานของระบบจัดการฐานข้อมูล (DBMS)
                </h6>
                <img src="/img/lesson8/2.png" width="100%" />
              </modal>
              <br />
              <h4>• ประโยชน์ของระบบฐานข้อมูล</h4>
              <p class="rem2 text-justify">
                1. สามารถลดความซ้ำซ้อนของข้อมูลได้ (Reducing Data Redundancy)
                การจัดเก็บข้อมูลในรูปแบบแฟ้มข้อมูล
                ข้อมูลบางชุดที่เหมือนกันจะถูกจัดเก็บไว้หลายแห่งทำให้เกิดความซ้ำซ้อน
                แต่ในระบบฐานข้อมูลจะรวบรวมไว้ในที่เดียวกัน ทำให้หน่วยงานต่างๆ
                สามารถที่จะเรียกใช้แฟ้มข้อมูลเดียวกันได้และลดความซ้ำซ้อนลงได้
              </p>
              <p class="rem2 text-justify">
                2. ข้อมูลมีความสอดคล้องและถูกต้องมากขึ้น (Data Consistency and
                Integrity)
                ในระบบแฟ้มข้อมูลมีการจัดเก็บข้อมูลชุดเดียวกันแยกอิสระกันหลายแห่ง
                เมื่อมีการปรับปรุงข้อมูลจะต้องแก้ไขหลายแห่ง
                ซึ่งอาจทำให้ค่าข้อมูลไม่สอดคล้องกัน มีความขัดแย้งกัน
                และมีค่าไม่ถูกต้องไม่สามารถนำไปใช้งานได้
                แต่ในระบบฐานข้อมูล ข้อมูลถูกจัดเก็บไว้ในที่แห่งเดียวกัน
                จะมีการออกแบบรูปแบบมาตรฐานเดียวกัน หากมีการแก้ไขข้อมูลใดๆ
                ก็จะปรับปรุงข้อมูล ณ แห่งเดียว
                ทำให้ข้อมูลเหมือนกันหมดและมีความถูกต้องมากยิ่งขึ้น
              </p>
              <p class="rem2 text-justify">
                3. สามารถใช้ข้อมูลร่วมกันได้ ( Sharing of Data)
                ระบบฐานข้อมูลจะเป็นการจัดเก็บข้อมูลรวมไว้ด้วยกัน
                ดังนั้นหากผู้ใช้ต้องการใช้ข้อมูลในฐานข้อมูลที่มาจากแฟ้มข้อมูลต่างๆ
                ก็จะทำได้โดยง่ายสะดวก เช่น
                ข้อมูลนักศึกษาและการลงทะเบียนจากฝ่ายทะเบียนสามารถให้ฝ่ายงานกองทุนกู้ยืมนำข้อมูลนักศึกษาไปใช้งานได้
              </p>
              <p class="rem2 text-justify">
                4. สามารถกำหนดให้ข้อมูลมีรูปแบบที่เป็นมาตรฐานเดียวกันได้
                (Standard of Data Structure)
                ในการจัดเก็บข้อมูลให้เป็นลักษณะเดียวกัน เช่น โครงสร้างข้อมูล
                ประเภทของข้อมูล เป็นต้น
                ทำให้สามารถกำหนดมาตรฐานของข้อมูลได้รวมทั้งมาตรฐานต่างๆ
                ในการจัดเก็บข้อมูลให้เป็นไปในลักษณะเดียวกันได้
                เช่นการกำหนดรูปแบบการเขียนวันที่ ในลักษณะ วัน/เดือน/ปี หรือ
                ปี/เดือน/วัน
              </p>
              <p class="rem2 text-justify">
                5. สามารถกำหนดระบบความปลอดภัยของข้อมูลได้ (Data Security and
                Privacy)
                ถึงแม้ว่าในระบบฐานข้อมูลจะสามารถให้มีการใช้ข้อมูลร่วมกันหลายหน่วยงาน
                แต่การเข้าถึงข้อมูลในระบบฐานข้อมูลจะมีการกำหนดสิทธิการเข้าใช้
                โดยสามารถการกำหนดว่าผู้ใดมีสิทธิสามารถเข้าใช้งานระบบได้บ้าง
                และสามารถใช้ข้อมูลในส่วนใดได้บ้าง มากน้อยแค่ไหน เช่น
                นักศึกษาสามารถเรียกดูข้อมูลเกรดที่ได้รับในแต่ละรายวิชา
                แต่ไม่สามารถทำการแก้ไขข้อมูลได้ เป็นต้น
              </p>
              <p class="rem2 text-justify">
                6. เกิดความเป็นอิสระของข้อมูล (Data Independency)
                ในระบบฐานข้อมูลโปรแกรมประยุกต์ที่สร้างขึ้นจะไม่ขึ้นกับโครงสร้างของการจัดเก็บข้อมูล ข้อมูล
                ดังนั้นหากมีการเปลี่ยนแปลงโครงสร้างของตารางการจัดเก็บข้อมูลในฐานข้อมูล
                ก็ไม่จำเป็นต้องแก้ไขโปรแกรมประยุกต์ที่ใช้
                จึงเกิดความเป็นอิสระระหว่างการจัดเก็บข้อมูลและการประยุกต์ใช้
              </p>
              <p class="rem2 text-justify">
                7. การสำรองและกู้คืนข้อมูล (Backup and Recovery)
                ระบบโปรแกรมจัดการฐานข้อมูล (DBMS)
                สามารถช่วยผู้ใช้ในการจัดการสำรองข้อมูลได้อัตโนมัติ
                และสามารถกู้คืนข้อมูลนำกลับมาใช้ใหม่ได้เมื่อระบบเกิดความล้มเหลว
              </p>
              <br />
              <h5 class="rem2">
                การป้องกันข้อมูลในระบบคอมพิวเตอร์และความปลอดภัยอาชญากรรมทางไซเบอร์
                พรบ.
              </h5>
              <p class="rem5 text-justify">
                การขยายตัวขององค์กรและการเปลี่ยนแปลงของเทคโนโลยีคอมพิวเตอร์ที่ทันสมัยทำให้การแลกเปลี่ยนข้อมูลข่าวสาร
                การเข้าถึงข้อมูลได้ง่ายส่งผลให้มีการใช้งานเทคโนโลยีจากผู้ใช้ทั่วทุกมุมโลก
                อย่างไรก็ตามแม้ว่าเทคโนโลยีคอมพิวเตอร์และระบบเครือข่ายอินเทอร์เน็ตจะมีผลดีและมีประโยชน์มากเพียงไรก็ตาม
                แต่อีกด้านหนึ่งแล้วคอมพิวเตอร์สามารถเป็นภัยได้เช่นกันหากผู้ใช้ไม่ระมัดระวังหรือนำไปใช้ในทางที่ไม่ถูกต้อง
                และยังสามารถเป็นช่องทางให้มิจฉาชีพเข้ามาแสวงหาประโยชน์อย่างผิดกฎหมาย
                หรือทำให้เกิดปัญหาการขยายตัวของอาชญากรรมข้ามชาติ
                รวมถึงอาชญากรรมรูปแบบใหม่ เช่น อาชญากรรมคอมพิวเตอร์ (Computer
                Crime) หรือ อาชญากรรมไซเบอร์ (Cyber Crime)
                ซึ่งในปัจจุบันถือเป็นปัญหาทางสังคมอย่างหนึ่งที่กำลังเพิ่มความรุนแรงและสร้างความเสียหายแก่สังคม
                ด้วยเหตุนี้การรักษาความปลอดภัยสำหรับระบบสารสนเทศนั้นมีบทบาทความสำคัญมากขึ้นเป็นลำดับ
              </p>
              <br />
              <h4>• ความมั่นคงปลอดภัยสำหรับระบบสารสนเทศ</h4>
              <p class="rem2 text-justify">
                ความมั่นคงปลอดภัยของระบบสารสนเทศ (Information System Security)
                คือการป้องกันข้อมูลสารสนเทศรวมถึง
                องค์ประกอบอื่นๆ ที่เกี่ยวข้อง
                เช่น
                ระบบและฮาร์ดแวร์ที่ใช้ในการจัดเก็บและถ่ายโอนข้อมูลสารสนเทศนั้นให้รอดพ้นจากอันตรายอยู่ในสถานะที่มีความปลอดภัยไร้ความกังวลและความกลัว
              </p>
              <p class="rem2 font-weight-bold">
                ความไม่ปลอดภัยของระบบสารสนเทศสามารถเกิดขึ้นได้ 2 ลักษณะคือ
              </p>
              <p class="rem2 text-justify">
                1. เกิดจากความตั้งใจของบุคคล เช่น
                ผู้ประสงค์ร้ายที่เข้ามาขโมยความลับจากระบบสารสนเทศ
                หรือจากการปล่อยโปรแกรมไวรัสเข้ามาทำลายข้อมูลในระบบ
                การลักลอบขโมยข้อมูลจากแฮกเกอร์ (Hacker) การขโมยรหัส
                การขโมยโปรแกรม การใช้ระบบคอมพิวเตอร์เพื่อขโมยเงินหรือสิ่งของ
                การเปลี่ยนแปลงข้อมูลโดยไม่อนุญาต การโจรกรรมระบบ เป็นต้น
              </p>
              <p class="rem2 text-justify">
                2. เกิดจากความไม่ตั้งใจของบุคคล หรือจากอุบัติเหตุ เช่น
                ภัยธรรมชาติ การจลาจลหรือสงคราม การลบข้อมูลจากระบบโดยไม่ตั้งใจ
                การลืมรหัสผ่านไว้ทำให้ผู้ประสงค์ดีขโมยไป
                ความผิดพลาดของฮาร์ดแวร์และซอฟต์แวร์ ความประมาทของผู้ใช้
                กำลังไฟตก ไม่ได้ป้องกันไวรัส
                ข้อมูลถูกทำลายเนื่องจากความผิดปกติของเครื่องคอมพิวเตอร์และโปรแกรม
                เป็นต้น
              </p>
              <br />
              <h4>• ภัยคุกคามต่อระบบคอมพิวเตอร์</h4>
              <h5 class="rem2">
                1. ภัยคุกคามทางระบบฮาร์ดแวร์ (Hardware Security Threats)
              </h5>
              <p class="rem5">1.1 ภัยที่มีต่อระบบการจ่ายไฟฟ้า</p>
              <p class="rem5">
                1.2 ภัยที่เกิดจากการทําลายทางกายภาพโดยตรง ต่อระบบคอมพิวเตอร์นั้น
                ๆ
              </p>
              <p class="rem5">1.3 ภัยจากการลักขโมยโดยตรง</p>
              <h5 class="rem2">
                2. ภัยคุกคามทางระบบซอฟต์แวร์ (Software Security Threats)
              </h5>
              <p class="rem5">
                2.1 การลบซอฟต์แวร์หรือการลบเพียงบางส่วน ของซอฟต์แวร์นั้น ๆ
              </p>
              <p class="rem5">2.2 การขโมยซอฟต์แวร์ (Software Theft)</p>
              <p class="rem5">
                2.3 การเปลี่ยนแปลงแก้ไขซอฟต์แวร์ (Software Modification)
              </p>
              <p class="rem5">2.4 การขโมยข้อมูล (Information Leaks)</p>
              <h5 class="rem2">
                3. ภัยคุกคามที่มีต่อระบบข้อมูล (Data Threats)
              </h5>
              <p class="rem5">3.1 การที่ข้อมูลอาจถูกเปิดเผยโดยมิได้รับอนุญาต</p>
              <p class="rem5">
                3.2
                การที่ข้อมูลอาจถูกเปลี่ยนแปลงแก้ไขเพื่อผลประโยชน์โดยมิได้มีการตรวจสอบแก้ไข
              </p>
              <p class="rem5">
                3.3 การที่ข้อมูลนั้นถูกทำให้ไม่สามารถนํามาใช้งานได้
              </p>
              <h5 class="rem2">4. ภัยคุกคามทางไซเบอร์ (Cyber Threats)</h5>
              <p class="rem5 text-justify">
                ภัยคุกคามทางไซเบอร์หมายความว่า การกระทำหรือการดำเนินการใดๆ
                โดยมิชอบโดยใช้คอมพิวเตอร์หรือระบบคอมพิวเตอร์
                หรือโปรแกรมไม่พึงประสงค์โดยมุ่งหมายให้เกิดการประทุษร้ายต่อระบบคอมพิวเตอร์
                ข้อมูลคอมพิวเตอร์ หรือข้อมูลอื่นที่เกี่ยวข้อง
                และเป็นภยันตรายที่ใกล้จะถึงที่จะก่อให้เกิดความเสียหายหรือส่งผลกระทบต่อการทำงานของคอมพิวเตอร์
                ระบบคอมพิวเตอร์ หรือข้อมูลอื่นที่เกี่ยวข้อง
              </p>
              <p class="rem5 text-justify">
                4.1 ภัยคุกคามทางไซเบอร์ในระดับไม่ร้ายแรง คือ
                เหตุการณ์ที่เป็นภัยคุกคามมีผลทำให้ประสิทธิภาพ ระบบเครือข่าย
                หรือคอมพิวเตอร์ทำให้ช้าลง
              </p>
              <p class="rem5 text-justify">
                4.2 ภัยคุกคามทางไซเบอร์ในระดับร้ายแรง
                คือภัยคุกคามที่โจมตีระบบคอมพิวเตอร์โดยกระทบต่อความมั่นคงของรัฐทั้งด้านความสัมพันธ์ระหว่างประเทศ
                การป้องกันประเทศ เศรษฐกิจ ความปลอดภัยสาธารณะ
              </p>
              <p class="rem5 text-justify">
                4.3 ภัยคุกคามทางไซเบอร์ในระดับวิกฤติ
                คือภัยคุมคามที่มีลักษณะการโจมตีระบบคอมพิวเตอร์ที่ส่งผลกระทบรุนแรงต่อโครงสร้างพื้นฐานของระบบสารสนเทศภายในประเทศเป็นบริเวณกว้าง
                และการโจมตีที่เป็นการก่ออาชญากรรมทางไซเบอร์
              </p>
              <br />
              <h4>• อาชญากรรมทางคอมพิวเตอร์ (Computer Crime)</h4>
              <p class="rem2 text-justify">
                อาชญากรรมทางคอมพิวเตอร์ (Computer Crime ) คือ
                การกระทำที่ผิดกฎหมายโดยใช้เทคโนโลยีสารสนเทศหรือคอมพิวเตอร์โดยไม่ได้รับอนุญาต
                หรือนำไปใช้เป็นเครื่องมือเพื่อกระทำการที่ผิดกฎหมายก่อให้เกิดความเสียหายแก่ระบบคอมพิวเตอร์และข้อมูลของผู้อื่น
                ในขณะเดียวกันก็ทำให้ผู้กระทำความผิดได้รับประโยชน์ เช่น ทำลาย
                เปลี่ยนแปลง หรือขโมยข้อมูลต่างๆ เป็นต้น
              </p>
              <p class="rem2 text-justify">
                สำหรับอาชญากรรมในระบบเครือข่ายคอมพิวเตอร์
                อาจเรียกได้อีกอย่างหนึ่ง คือ อาชญากรรมไซเบอร์ (Cybercrime) หรือ
                อาชญากรรมอินเทอร์เน็ต (Internet Crime)
                ในปัจจุบันอาชญากรที่ก่ออาชญากรรมประเภทนี้ มักถูกเรียกว่า
                แครกเกอร์ (Cracker) ซึ่ง แครกเกอร์ (Cracker) คือ แฮกเกอร์
                (Hacker)
                ที่ลักลอบเข้าไปยังคอมพิวเตอร์ของผู้อื่นเพื่อวัตถุประสงค์ในเชิงธุรกิจ
                นอกจากนี้ยังมีคำว่า Hacktivist หรือ cyber terrorist ได้แก่
                แฮกเกอร์ที่ใช้อินเทอร์เน็ตในการส่งข้อความเพื่อผลประโยชน์ทางการเมืองไปยังบุคคลอื่น
                ๆ
              </p>
              <p class="rem2">
                แฮกเกอร์ (Hacker) คือ
                บุคคลที่ใช้ความรู้ความสามารถในทางที่ไม่ถูกต้องหรือผิดกฎหมาย
                ขาดจริยธรรม
                ในการลักลอบเข้าไปทำลายระบบคอมพิวเตอร์และหาประโยชน์ให้กับตนเอง
                แฮกเกอร์สามารถแบ่งออกเป็น 2 ประเภท คือ
              </p>
              <p class="rem5">
                1. white hat hacker คือ แฮกเกอร์ที่มีจริยธรรมที่คอยดู แก้ไข
                ความผิดพลาดของข้อมูลของเรา เพื่อแจ้งให้เราทราบว่า
                คอมพิวเตอร์ของเราเกิดความเสียหายอะไรบ้าง
              </p>
              <p class="rem5">
                2. Black hat hacker คือ มีความรู้เหมือนกันแต่ไม่มีจริยธรรม
                ชอบลักลอบข้อมูลไปโดยที่เจ้าตัวไม่รู้ว่า ได้ถูกลักลอบข้อมูล
              </p>

              <br />
              <h5>รูปแบบของอาชญากรรมคอมพิวเตอร์</h5>
              <br />
              <div
                class="text-center font-italic col"
                @click="modals.modal1 = true"
              >
                <img src="/img/lesson8/3.png" width="60%" />
                <p><br />รูปภาพ แสดงรูปแบบของอาชญากรรมคอมพิวเตอร์</p>
              </div>
              <modal :show.sync="modals.modal1">
                <h6 slot="header" class="modal-title" id="modal-title-default">
                  รูปภาพ แสดงรูปแบบของอาชญากรรมคอมพิวเตอร์
                </h6>
                <img src="/img/lesson8/3.png" width="100%" />
              </modal>
              <br />
              <p class="rem2 text-justify">
                1. การโจรกรรมทางคอมพิวเตอร์ (Computer spionage)
                เมื่อระบบคอมพิวเตอร์ได้กลายเป็นอุปกรณ์หลักในการเก็บบันทึกข้อมูล
                จึงทำให้ผู้กระทำผิดมีการใช้เครื่องมือพิเศษเพื่อดักรับข้อมูลในระหว่างการติดต่อสื่อสาร
                ข้อมูลส่วนใหญ่ที่ตกเป็นเป้าหมายของผู้กระทําในรูปแบบนี้ได้แก่
                โปรแกรมคอมพิวเตอร์, ข้อมูลการศึกษาวิจัย, ความลับทางการทหาร,
                ข้อมูลการประกอบธุรกิจประเภทบัญชีการเงิน
                รวมทั้งข้อมูลเกี่ยวกับลูกค้า
                โดยในระยะหลังที่ผ่านมาการกระทําความผิดรูปแบบนี้ก็มักเกิดขึ้นกับข้อมูลทางธุรกิจเป็นส่วนใหญ่
                ซึ่งคู่กรณีมักเป็นบริษัทคู่แข่งกัน
              </p>
              <p class="rem2 text-justify">
                2. การเจาะระบบ หรือเข้าถึงระบบของผู้อื่นโดยไม่ได้รับอนุญาต
                (Computer hacking)
                ผู้กระทำผิดจะทำการเข้าแทรกแซงข้อมูลและลักลอบใช้ข้อมูลเพื่อแสวงหาผลประโยชน์ในทางมิชอบ
                รวมถึงการขโมยข้อมูลทางอินเทอร์เน็ตเพื่อลักลอบเข้าใช้บริการสารสนเทศ
                เช่น
                การขโมยรหัสผ่านจากผู้ให้บริการอินเทอร์เน็ตหรือเว็บไซต์เพื่อลักลอบเข้าใช้บริการโทรศัพท์
                อินเทอร์เน็ต
                รวมถึงข้อมูลส่วนบุคคลที่ผูกติดอยู่กับเทคโนโลยีโดยเฉพาะข้อมูลทางด้านการเงิน
                การเจาะผ่านระบบอินเทอร์เน็ตเข้าไปแล้วแอบล้วงความลับทางการค้า
                การดักฟังข้อมูลจากระบบสนทนา (Chat messenger)
                การเปลี่ยนแปลงข้อมูลคอมพิวเตอร์
                เพื่อนำมาเป็นประโยชน์ต่อกิจการของตน เป็นต้น
              </p>
              <p class="rem2 text-justify">
                3. การขโมย การละเมิดลิขสิทธิ์ ดัดแปลง การปลอมแปลง
                การคัดลอกผลงานที่มีลิขสิทธิ์
                ในปัจจุบันคอมพิวเตอร์ส่วนบุคคลและอินเทอร์เน็ตถูกใช้เป็นสื่อในการก่ออาชญากรรม
                โดยการโจรกรรมทางออนไลน์หมายรวมถึง การละเมิดลิขสิทธิ์ ใดๆ
                ที่เกี่ยวข้องกับการใช้อินเทอร์เน็ตเพื่อจำหน่ายหรือเผยแพร่ผลงานสร้างสรรค์ที่ได้รับการคุ้มครองลิขสิทธิ์
                เช่น การละเมิดลิขสิทธิ์ซอฟต์แวร์
                การลักลอบคัดลอกผลงานผู้อื่นโดยไม่ได้รับอนุญาตเพื่อนำมาใช้หรือจำหน่ายต่อ
                การปลอมแปลงสื่อมัลติมีเดียที่มีลิขสิทธิ์ต่างๆ เช่น หนัง เพลง
                การลักลอบใช้โปรแกรมคอมพิวเตอร์โดยไม่ได้รับอนุญาต
                การละเมิดทรัพย์สินทางปัญญาด้วยการดาวน์โหลด
                หรือทําซ้ำผลงานอันมีลิขสิทธิ์ต่างๆ เช่น เป็นต้น
              </p>
              <p class="rem2 text-justify">
                4.
                การฟอกเงินทางอิเล็กทรอนิกส์ซึ่งใช้อุปกรณ์ทางคอมพิวเตอร์และการสื่อสารเป็นเครื่องมือทำให้สามารถกลบเกลื่อนอำพรางตัวตนของผู้กระทำความผิดได้ง่ายขึ้นและให้มาเป็นทรัพย์สินที่ถูกกฎหมายเช่น
                การปลอมแปลงเอกสารข้อมูลลูกค้าของพนักงานธนาคารเพื่อใช้ในการเบิกถอนเงินจากบัญชีลูกค้าโดยไม่ได้รับอนุญาต
                การปันหุ้น การทำธุรกิจสินค้าหนีภาษี การปลอมแปลงเงินตรา เป็นต้น
              </p>
              <p class="rem2 text-justify">
                5. การค้าขายหรือชวนลงทุนโดยหลอกลวงผ่านอินเทอร์เน็ต เช่น
                การส่งอีเมลที่เป็นสแปมในการเชิญชวนให้เข้าใช้บริการฟรี
                หรือส่งข้อความโฆษณาชวนเชื่อในการให้ส่วนลดพิเศษเพื่อเข้าใช้บริการ
                แต่ไม่มีบริการเหล่านั้นจริง
                รวมถึงการส่งอีเมลและเอกสารปลอมในการแอบอ้างหาผลประโยชน์ต่าง ๆ
              </p>
              <p class="rem2 text-justify">
                6. การก่อกวนทำลายระบบคอมพิวเตอร์หรือก่อวินาศกรรมระบบ (Computer
                sabotage) และการข่มขู่ทางอินเทอร์เน็ต (Computer erpressung)
                ความผิดส่วนใหญ่ที่เกิดขึ้นมักเป็นการกระทำต่อคอมพิวเตอร์ส่วนบุคคล
                ด้วยวิธีการปล่อยโปรแกรมไวรัส (Virus) หรือ วอร์ม (Worm)
                ที่มีเป้าหมายทำลายระบบคอมพิวเตอร์และข้อมูลของผู้อื่น
                การทำลายระบบรักษาความปลอดภัย
                ส่วนการข่มขู่ทางอินเทอร์เน็ตมักกระทำผ่านทางจดหมายอิเล็กทรอนิกส์
                ผู้เสียหายจะถูกข่มขู่ให้ต้องยินยอมกระทำการอย่างหนึ่งอย่างใด เช่น
                การรีดไถเงิน มิเช่นนั้นระบบคอมพิวเตอร์ของเขาจะถูกทําลาย
                หรือทำให้เสียหายจนใช้ประโยชน์ไม่ได้
                หรือบางกรณีผู้กระทำผิดจะใช้วิธีเขียนโปรแกรมเข้ารหัสเครื่องคอมพิวเตอร์ของเหยื่อ
                เพื่อไม่ให้เหยื่อเข้าไปใช้งานได้จากนั้นจึงข่มขู่ให้เหยื่อจ่ายเงินเพื่อแลกกับการถอดรหัสดังกล่าว
                เป็นต้น
              </p>
              <p class="rem2 text-justify">
                7. การเผยแพร่ภาพ เสียง ข้อมูลที่ไม่เหมาะสม หรือ ข้อมูลเท็จ
                ผ่านทางสื่อออนไลน์ และได้กลายเป็นอาชญากรรมไซเบอร์
                สามารถสร้างความเสียหายต่อประโยชน์สาธารณะหรือส่งผลกระทบต่อ
                ค่านิยม แนวคิด สังคม รวมทั้งพัฒนาการของเด็กและเยาวชน เช่น
                จดหมายลูกโซ่ ภาพอนาจารทางออนไลน์ การสร้างข่าวปลอม
                ภาพอาวุธปืนอาวุธสงคราม หรือข้อความที่มีเนื้อหาเป็นภัยต่อสังคม
                หรือความมั่นคงทางเครือข่าย การพนันบนเครือข่าย
                การหมิ่นประมาทผู้อื่นโดยการโฆษณา โดยอาศัยเครือข่ายอินเทอร์เน็ต
                หรือ เผยแพร่ข้อมูลที่มีเนื้อหาแอบแฝงแนวคิดก้าวร้าว รุนแรง หรือ
                แนวคิดในการดูหมิ่นชนชาติอื่น
                การเลือกปฏิบัติรวมทั้งการหมิ่นประมาทผ่านสื่อบริการทั้งหลายบนเครือข่ายอินเตอร์เน็ต
                โดยเฉพาะอย่างยิ่งในเว็บไซต์ กระดานข่าว
                จดหมายอิเล็กทรอนิกส์และห้องสนทนาออนไลน์ เป็นต้น
              </p>
              <p class="rem2 text-justify">
                8. การใช้เทคโนโลยีคอมพิวเตอร์ดัดแปลงข้อมูลบัญชีธนาคาร
                หรือการโอนเงินจากบัญชีหนึ่ง เข้าไปอีกบัญชีหนึ่ง
                โดยที่ไม่มีการเปลี่ยนถ่ายทรัพย์สินกันจริง
                การบิดเบือนข้อมูลการชำระเงิน
                การลักลอบเปลี่ยนแปลงข้อมูลทางบัญชีรายรับ-รายจ่ายของบริษัท
              </p>
              <br />
              <h5>
                แนวทางการป้องกันและแก้ไขปัญหาอาชญากรรมทางคอมพิวเตอร์ที่สามารถปฏิบัติได้ดังนี้
              </h5>
              <p class="rem2 text-justify">
                องค์กรสามารถป้องกันอาชญากรรมคอมพิวเตอร์ได้โดยการติดตั้งซอฟแวร์และฮารด์แวร์
                หรือ ระบบรักษาความมั่นคงปลอดภัย
                และจะต้องมีการประยุกต์ใช้ทั้งนโยบายและกระบวนการจัดการ
                โดยเฉพาะการจัดการด้านบุคลากรจึงจะสามารถป้องกันการโจมตีได้อย่างมีประสิทธิภาพ
              </p>
              <p class="rem2">
                1.
                ควรมีการวางแนวทางและกฎเกณฑ์ในการรวบรวมพยานหลักฐานและดำเนินคดีอาญากรรมคอมพิวเตอร์
              </p>
              <p class="rem2">
                2. ส่งเสริมจริยธรรมในการใช้คอมพิวเตอร์
                โดยการสร้างความรู้ความเข้าใจแก่บุคคลทั่วไปในการใช้คอมพิวเตอร์
                อย่างถูกต้อง โดยการปลูกฝังเด็กตั้งแต่ในวัยเรียนให้เข้าในกฎเกณฑ์
                มารยาทในการใช้คอมพิวเตอร์ อย่างถูกวิธี และเหมาะสม
              </p>
              <p class="rem2">
                3. เผยแพร่ความรู้เรื่องอาชญากรรมคอมพิวเตอร์แก่ผู้ใช้คอมพิวเตอร์
                หน่วยงาน และองค์กรต่างๆ ให้เข้าใจ แนวคิดและวิธีการ
                ของอาชญากรรมคอมพิวเตอร์ เพื่อป้องกันตนเองเป็นเบื้องต้น
              </p>
              <p class="rem2">
                4. บัญญัติกฎหมายเฉพาะเกี่ยวกับอาชญากรรมคอมพิวเตอร์
                หรือแก้ไขเพิ่มเติมกฎหมายที่มีอยู่ในครอบคลุมการ
                กระทำอันเป็นความผิดเกี่ยวกับอาชญากรรมคอมพิวเตอร์ทุกประเภท
              </p>
              <p class="rem2">
                5. จัดตั้งหน่วยงานเกี่ยวกับอาชญากรรมคอมพิวเตอร์
                และคณะทำงานที่มีความรู้ความชำนาญในคดีอาชญากรรม คอมพิวเตอร์
              </p>
              <p class="rem2">
                6. การตรวจสอบระบบคอมพิวเตอร์และป้องกันการทำงานที่ผิดพลาดบ่อยๆ
                รวมถึงการติดตั้งโปรแกรมไวรัส
              </p>
              <p class="rem2">
                7. การควบคุมการเข้าใช้ระบบสารสนเทศของผู้ใช้ เช่น
                การจัดสรรสิทธิในการเข้าใช้ข้อมูล และมีความเข้มงวดใน
                การอนุญาตเข้าใช้คอมพิวเตอร์หรือระบบสารสนเทศ
              </p>

              <!-- -------------------------------- -->
              <br />
              <br />
              <br />
              <br />
              <div class="container">
                <div class="row">
                  <div class="col-auto mr-auto">
                    <router-link to="/lesson8_1" title="Lesson8_1 Page">
                      <div class="btn-wrapper">
                        <base-button
                          tag="a"
                          target="_blank"
                          rel="noopener noreferrer"
                          class="mb-3 mb-sm-0"
                          outline
                          type="info"
                          icon="fa fa-chevron-left"
                          >ย้อนกลับ</base-button
                        >
                      </div>
                    </router-link>
                  </div>
                  <div class="col text-center">
                    <div class="btn-wrapper">
                      <base-button
                        id="back-to-top"
                        href="#"
                        role="button"
                        tag="a"
                        rel="noopener noreferrer"
                        class="btn  back-to-top"
                        outline
                        type="info"
                      >
                        <i class="fa fa-chevron-up" aria-hidden="true"></i>
                      </base-button>
                    </div>
                  </div>
                  <div class="col-auto">
                    <router-link to="/lesson8_3" title="Lesson8_3 Page">
                      <div class="btn-wrapper">
                        <base-button
                          tag="a"
                          target="_blank"
                          rel="noopener noreferrer"
                          class="mb-3 mb-sm-0"
                          outline
                          type="info"
                        >
                          ถัดไป
                          <i class="fa fa-chevron-right" aria-hidden="true"></i>
                        </base-button>
                      </div>
                    </router-link>
                  </div>
                </div>
              </div>
              <div class="text-center mt-5">Page 2/4</div>
            </div>
          </div>
        </div>
      </section>

      <hr />
      <div class="col-lg-center">
        <div class="pt-4 text-center">
          <h5 class="title">
            <span class="d-block mb-1">Author | Dr. Wanvimol Nadee</span>
            <small class="h6 text-black"
              >Lecturer in Information Technology Division at Maejo
              University</small
            >
          </h5>
        </div>
      </div>
      <hr />
    </div>
  </div>
</template>

<script>
import Modal from "@/components/Modal.vue";
export default {
  name: "home",
  components: {
    Modal,
  },
  data() {
    return {
      modals: {
        modal1: false,
        modal2: false,
      },
    };
  },
};
</script>

<style></style>
