<template>
  <div>
    <div class="position-relative">
      <section
        class="fontx section section-lg section-shaped overflow-hidden my-0"
      >
        <div class="shape shape-style-1 shape-default shape-skew">
          <span></span>
          <span></span>
          <span></span>
          <span></span>
          <span></span>
          <span></span>
        </div>
        <br />
        <br />
        <br />
        <br />
        <div class="container py-0 pb-lg">
          <div class="row justify-content-between align-items-center">
            <div class="col-lg-5 mb-5 mb-lg-0">
              <h1 class="text-white font-weight-light display-1">
                3. Presentations
              </h1>
              <p class="lead text-white mt-4">
                การนำเสนอ (presentation)
                หมายถึงการนำข้อมูลเรื่องใดเรื่องหนึ่งไปนำเสนอต่อผู้ฟังให้เข้าใจ
                โดยใช้เทคนิคและสื่อต่าง ๆ ในการนำเสนอ ...
              </p>
            </div>
            <div class="col-lg-6 mb-lg-auto">
              <div
                class="rounded shadow-lg overflow-hidden transform-perspective-right"
              >
                <b-carousel id="carousel1" controls indicators>
                  <!-- Text slides with image -->
                  <b-carousel-slide
                    img-src="img/lesson3/cov.jpeg"
                  ></b-carousel-slide>
                </b-carousel>
              </div>
            </div>
          </div>
        </div>
        <br />
        <br />
        <br />
        <br />
        <br />
        <br />
      </section>

      <section class="section section-shaped my-0 overflow-hidden">
        <div class="container pt-lg pb-80">
          <div class="row justify-content-center">
            <div class="fontx col-lg-10">
              <!-- -------------------------------- -->
              <h2 class="display-3 text-center">
                3. การใช้โปรแกรมนำเสนองานอย่างมีประสิทธิภาพ
              </h2>
              <br /><br />
              <h4>3.1 ความหมายและความสำคัญของการนำเสนอ</h4>
              <p class="rem2">
                การนำเสนอ (presentation)
                หมายถึงการนำข้อมูลเรื่องใดเรื่องหนึ่งไปนำเสนอต่อผู้ฟังให้เข้าใจ
                โดยใช้เทคนิคและสื่อต่าง ๆ ในการนำเสนอ
                เพื่อให้บรรลุจุดมุ่งหมายของการนำเสนอที่กำหนดไว้
                การสร้างงานนำเสนอ
                ถือว่าเป็นสิ่งที่จำเป็นและมีความสำคัญมากกับงานในทุกสาขาอาชีพ
                ดังนั้น
                การสร้างงานนำเสนอเพื่อให้มีความน่าสนใจและเข้าใจได้ง่ายจึงเป็นสิ่งสำคัญ
              </p>
              <br />
              <h4>3.2 หลักการนำเสนองานอย่างมีประสิทธิภาพ</h4>
              <p class="rem2">
                การนำเสนอที่ดีและมีประสิทธิภาพนั้น
                นอกจากการเลือกรูปแบบของการนำเสนอให้ถูกต้องและเหมาะสมแล้ว
                จะต้องคำนึงถึงปัจจัยอื่นที่เกี่ยวข้อง ได้แก่
                ลักษณะของกลุ่มเป้าหมาย เช่น อายุ พื้นฐานความรู้ สภาพสังคม
                วัฒนธรรม ทัศนคติหรือความเชื่อ เป็นต้น
                ดังนั้นหากมีการวิเคราะห์กลุ่มเป้าหมายและนำมากำหนดรูปแบบของสื่อและวิธีการนำเสนอให้สอดคล้องเหมาะสมกับลักษณะและความต้องการของกลุ่มเป้าหมาย
                จะช่วยให้การนำเสนอประสบความสำเร็จตามวัตถุประสงค์อย่างแน่นอน
              </p>
              <p class="rem2 font-weight-bold">
                การนำเสนอที่ดี ควรมีลักษณะดังต่อไปนี้
              </p>
              <p class="rem5">
                1) มีการเตรียมข้อมูลที่ดี คือ
                ต้องหาข้อมูลที่ดีที่สุดที่จะใช้ในการนำเสนอ
                ต้องทราบถึงสิ่งที่ต้องการที่จะนำเสนอต่อผู้ฟัง
                และมีการหาข้อมูลว่าผู้ฟังเป็นใคร มีวุฒิภาวะ การศึกษาระดับใด
                มีความรู้พื้นฐานเกี่ยวกับสิ่งที่จะนำเสนอหรือมีความสนใจในสิ่งที่จะนำเสนอหรือไม่
              </p>
              <p class="rem5">
                2) ใช้รูปแบบการนำเสนอที่เหมาะสมกับกลุ่มเป้าหมาย เช่น
                พิจารณาจากอายุ ระดับการศึกษา อาชีพ หรือความสนใจ เป็นต้น
              </p>
              <p class="rem5">
                3) มีวัตถุประสงค์ที่ชัดเจนว่าต้องการนำเสนออะไร เพื่ออะไร
                โดยที่ผู้รับฟังการนำเสนอจะไม่เกิดคำถามว่าต้องการให้รับทราบหรือพิจารณาอะไร
              </p>
              <p class="rem5">
                4) มีเนื้อหาสาระดี มีความถูกต้อง น่าเชื่อถือ
                เนื้อหาครบถ้วนสมบูรณ์ ตรงตามความต้องการ
                และข้อมูลมีความเป็นปัจจุบัน ทันต่อสถานการณ์
              </p>
              <p class="rem5">
                5) มีความกระชับ ชัดเจน ตรงประเด็นมีการ
                จัดวางเนื้อหาโดยเรียงลำดับเรื่องราวให้น่าสนใจ ไม่ซับซ้อน
                ใช้ภาษาที่เข้าใจง่าย มีการใช้ภาพ วีดิโอ ตาราง แผนภูมิ
                หรือแผนภาพประกอบเพื่อให้ผู้ฟังเห็นภาพ
                จะช่วยให้มีความเข้าใจดีขึ้น
              </p>
              <p class="rem5">
                6) มีการซักซ้อมก่อนการนำเสนอจริง
                เพื่อให้แน่ใจว่าเนื้อหาและรูปแบบการนำเสนอที่จัดทำมานั้นมีความถูกต้อง
                ไม่มีอะไรบกพร่อง
                สามารถใช้ในการนำเสนอได้ตรงตามความต้องการและสอดคล้องกับเวลาที่กำหนดไว้
              </p>
              <br />

              <h4>3.3 โปรแกรมคอมพิวเตอร์สำหรับการนำเสนองาน</h4>
              <p class="rem2">
                ปัจจุบันมีโปรแกรมคอมพิวเตอร์หลายโปรแกรมที่พัฒนาขึ้นมาเพื่อใช้สำหรับการนำเสนอให้น่าสนใจ
                ทำให้ผู้นำเสนอสามารถนำเสนอได้ทั้งตัวอักษร
                ภาพนิ่งและภาพเคลื่อนไหว โดยมีเทคนิคหรือลูกเล่น (effect)
                ให้เลือกใช้ในหลากหลายรูปแบบ
                เพื่อให้ผู้ใช้สามารถใส่จุดเน้นจุดเด่นในประเด็นที่สำคัญ
                ให้ผู้ฟังสามารถเข้าใจได้ง่าย รวมทั้งสร้างความน่าสนใจและดึงดูดใจ
                มีเทมแพลตสำเร็จรูป (Pre-built-templates) ที่ดึงดูดใจ
                ทำให้ดูเป็นมืออาชีพ ใช้งานง่าย
                สามารถสร้างไฟล์การนำเสนองานได้ในระยะเวลาอันสั้น
                บางโปรแกรมสามารถแชร์ไฟล์เพื่อการทำงานร่วมกันได้แบบ real time
                สอดคล้องกับการทำงานนอกสำนักงานของผู้ใช้งานที่มีมากขึ้นในสภาวการณ์ในปัจจุบัน
                ทั้งนี้ โปรแกรมคอมพิวเตอร์สำหรับการนำเสนอ (presentation
                software) พบว่ามีมากกว่า 100 โปรแกรม
                แต่ที่เป็นซอฟต์แวร์ฟรีและเป็นที่นิยม เช่น Google Slides,
                Keynote, Visme, Prezi, Zoho Show และ Microsoft PowerPoint
              </p>

              <p class="rem5">
                1) Google Slides เป็นโปรแกรมฟรีที่สามารถใช้งานได้ง่ายและรวดเร็ว
                ผู้ใช้สามารถแชร์ไฟล์ทำงานร่วมกันกับผู้อื่นได้ สามารถ insert ภาพ
                เสียง วีดิโอจากไฟล์บน Google Drive
                หรือดาวน์โหลดโดยตรงจากอินเทอร์เน็ต
                โดยไฟล์งานที่สร้างขึ้นนั้นจะถูกบันทึกไว้บน Google Drive
                แต่สามารถดาวน์โหลดไฟล์ออกมาเป็นไฟล์ภาพ (jpg, png, svg, PDF หรือ
                ppt) และสามารถสร้างลิงก์เพื่อ publish ไปเผยแพร่บน website ได้
                แต่ผู้ใช้ต้องมี Google Account ในการใช้งาน
              </p>
              <p class="rem5">
                2) Keynote เป็นโปรแกรมที่พัฒนาโดยบริษัท Apple
                สำหรับใช้สร้างงานนำเสนอ (Presentation) และงานสไลด์โชว์ (Slide
                Show) บนเครื่อง Macintosh มีเครื่องมือและเทมเพลตที่สวยงาม
                และฟอนต์ในหลากหลายรูปแบบ ตลอดจนเอฟเฟคต่างๆ ให้เลือกใช้
                สามารถใส่รูปภาพ แผนภูมิ รูปร่างรูปทรง และวีดีโอ ได้เช่นเดียวกับ
                โปรแกรม Microsoft Power Point และสามารถนำ presentation
                ที่สร้างขึ้นไปนำเสนอผ่านอุปกรณ์ของ บริษัทApple ทั้ง iPad
                (แท็บเล็ต) iPhone (สมาร์ทโฟน) iPod touch (เครื่องเล่นไฟล์มีเดีย)
                และนำเสนอผ่านทางเว็บไซต์ iCloud.com
              </p>
              <p class="rem5">
                3) Visme เป็นโปรแกรมทำพรีเซนต์เตชั่นออนไลน์
                สำหรับการสร้างงานนำเสนอแบบมีปฏิสัมพันธ์ (interactive
                presentation) และ infographic โดยมีฟ้อนต์, รูปภาพ, chart,
                dashboards และไอคอนมากมายให้เลือกใช้
                สามารถทำกราฟิกเพื่อการนำเสนอได้ง่ายโดยผู้ใช้งานไม่จำเป็นต้องมีพื้นฐานทางด้านกราฟิก
                ทั้งนี้มีแบบ basic สำหรับใช้งานฟรีเพื่อการนำเสนอ presentation
                ออนไลน์ที่ให้เนื้อที่ 100 MB และแบบ Premium
                ที่มีค่าบริการรายเดือน
              </p>
              <p class="rem5">
                4) Prezi
                เป็นโปรแกรมทำพรีเซนต์เตชั่นออนไลน์ที่มีเทคโนโลยีโครงสร้างพิเศษและมีฟังก์ชั่นซูม
                (Zoom) ที่สามารถซูมไปยังจุดที่สำคัญของการนำเสนอ
                และยังมีลักษณะพิเศษคือเป็น Non-linear presentation นั่นคือ
                การนำเสนอไม่ต้องไปทีละสไลด์แต่สามารถกระโดดไปยังจุดที่ต้องการได้โดยตรง
                สามารถใส่รูปภาพ เสียง วิดีโอ และไฟล์อื่นๆ เช่น PDF และไฟล์ power
                point นำเสนอได้ทั้งแบบแบบ online หรือดาวน์โหลดมานำเสนอแบบ
                offline ก็ได้โดยไฟล์ที่ดาวน์โหลดมาจะมีนามสกุล .exe
                สามารถนำไปเปิดได้กับคอมพิวเตอร์ทุกเครื่อง
              </p>
              <p class="rem5">
                5) Zoho Show เป็นแพลตฟอร์ม (Platform) ที่ให้บริการผ่านระบบคลาวด์
                (Cloud) ซึ่งช่วยให้ผู้ใช้สามารถสร้าง presentation
                ที่มีสีสันแบบออนไลน์ผ่านระบบอินเทอร์เน็ตได้ในระยะเวลาอันสั้น
                ผู้ใช้สามารถทำงานร่วมกันเป็นทีม และแชร์โปรแกรมระบบงาน
                (Application) มีภาษาให้เลือกถึง 10
                ภาษาจึงเหมาะสำหรับการทำโปรเจ็คที่มีทีมทำงานจากนานาชาติ
              </p>
              <p class="rem5">
                6) Microsoft Power Point ผลิตโดยบริษัทไมโครซอฟท์
                เริ่มผลิตขึ้นครั้งแรกในปี พ.ศ.2538 สำหรับWindows 95
                เป็นโปรแกรมสำหรับการนำเสนอที่ใช้งานง่าย
                จึงเป็นที่นิยมอย่างกว้างขวางในปัจจุบัน
                ในช่วงแรกมีเฉพาะเวอร์ชั่นที่ทำงานบนระบบปฏิบัติการ Microsoft
                Windows แต่ในปัจจุบันได้มีการพัฒนาเวอร์ชั่นสำหรับทำงานบน Mac OS
                เป็นโปรแกรมที่มี template และ Theme ที่สวยงามให้เลือกใช้
                ผู้ใช้สามารถตกแต่งงานนำเสนอโดยการแทรกภาพ ทำอินโฟกราฟิก
                ฝังหรือลิงก์ไฟล์เสียงและไฟล์วิดีโอในงานนำเสนอ มีแอฟเฟ็คแบบต่างๆ
                ช่วยให้การนำเสนอมีลำดับขั้นตอน
                และสร้างจุดเน้นจุดเด่นของเนื้อหาที่นำเสนอ
              </p>
              <p class="rem5">
                เอกสารนี้จะแนะนำการนำโปรแกรม Microsoft PowerPoint
                มาใช้ในการสร้างงานนำเสนอให้มีประสิทธิภาพ
                โดยโปรแกรมที่ใช้ในการยกตัวอย่างคือ Microsoft PowerPoint 2016
                ดังรายละเอียดต่อไปนี้
              </p>
              <br />
              <h4>
                3.4 การใช้งาน Microsoft Power Point
                ในการนำเสนองานอย่างมีประสิทธิภาพ
              </h4>
              <p class="rem2">
                การใช้ Microsoft PowerPoint ในการนำเสนองานให้มีประสิทธิภาพนั้น
                มีประเด็นหลักๆ ที่ควรคำนึงถึง ดังต่อไปนี้
              </p>
              <p class="rem5">1) ใช้ธีมที่เหมาะสม (use suitable theme)</p>
              <p class="rem5">
                2) ใส่เนื้อหาให้เหมาะสมบนแต่ละสไลด์ อย่าให้มีมากเกินไป (limit
                words on slides)
              </p>
              <p class="rem5">
                3) เลือกใช้ฟอนต์ให้เหมาะสม (choose appropriate fonts)
              </p>
              <p class="rem5">
                4) ภาพหรือกราฟิกที่ใช้ประกอบการนำเสนอต้องมีคุณภาพดี (use
                high-quality photos and graphics)
              </p>
              <p class="rem5">
                5) แผนภูมิหรือกราฟที่ใช้ประกอบการนำเสนอต้องต้องมีความถูกต้อง
                เที่ยงตรงและตรงประเด็น (use accurate and relevant charts and
                graphs)
              </p>
              <br />
              <h5 class="rem2">3.4.1 การใช้ธีมที่เหมาะสม (use suitable theme)</h5>
              <p class="rem5">
                การทำสไลด์นำเสนอให้มีประสิทธิภาพนั้น
                ควรให้มีความเรียบง่ายมากที่สุดและรูปแบบการนำเสนอควรดูสบายตา
                ไม่รกรุงรัง แต่ให้มีความดึงดูดใจ
                สิ่งแรกที่จะทำให้งานนำเสนอมีความดึงดูดใจและน่าสนใจคือ
                การใช้สีพื้นหลัง
                ฟ้อนต์และการจัดวางองค์ประกอบของเนื้อหาบนสไลด์ที่จะใช้ในการนำเสนอ
                ทั้งข้อความ ภาพ กราฟิกและแผนผังต่างๆ
                ที่สำคัญสีสามารถกระตุ้นอารมณ์และความรู้สึกของมนุษย์ได้
                การเลือกใช้สีที่เหมาะสม
                จะสามารถโน้มน้าวและสร้างแรงจูงใจในการอ่านได้ โดยสีโทนเย็น (Cool
                colors) เช่น สีฟ้าและสีเขียว จะเหมาะสำหรับทำเป็นพื้นหลัง
                (Background) และสีโทนอบอุ่น (Warm colors) เช่น สีส้มและสีแดง
                ไว้สำหรับเป็นสีของข้อความ (Text)
                การใช้พื้นหลังและการจัดวางองค์ประกอบต้องให้เหมาะสมกับงาน
                ซึ่งผู้ใช้สามารถเลือกจากสไลด์ต้นแบบ (Template) และ ธีม (Theme)
                ที่มีให้ในโปรแกรม
                หรือสร้างขึ้นใช้เองโดยเฉพาะเพื่อให้เป็นเอกลักษณ์และไม่ซ้ำกับของคนอื่น
              </p>
              <h6 class="rem2">3.4.1.1 การใช้สไลด์ต้นแบบ (Template)</h6>
              <p class="rem5">
                การสร้างงานนำเสนอใหม่ด้วย Microsoft PowerPoint
                สามารถเริ่มต้นโดยการใช้สไลด์ต้นแบบ (Template) และชุดของสี
                ฟอนต์และเอฟเฟ็กต์ หรือที่เรียกว่า ธีม (Theme) ที่มีในโปรแกรม
                โดยเมื่อเปิดโปรแกรม PowerPoint ขึ้นมา จะมี Theme
                สำเร็จรูปให้เลือ
              </p>
              <p class="rem5">
                หากไม่มี Theme ที่ถูกใจ ผู้ใช้สามารถ search โดยพิมพ์ keyword
                ลงไปแล้วกด Enter หรือคลิกที่หมวดหมู่ที่อยู่ด้านล่างกล่อง search
                เช่น Presentation, Theme, Education
                จะมีสไลด์ต้นแบบขึ้นมาให้เลือกมากมาย
                (แต่ต้องมีการเชื่อมต่อกับอินเทอร์เน็ต)
                เมื่อเลือกแล้วผู้ใช้สามารถปรับแก้ข้อความ/ใส่ข้อความใหม่
                ย้ายรูปภาพ/ใส่รูปภาพใหม่ได้ตามต้องการ
              </p>
              <br />
              <div class="text-center font-italic">
                <img src="/img/lesson3/1.png" width="80%" />
                <p>
                  <br />ภาพที่ 1 – Theme สำเร็จรูปที่มีอยู่ในโปรแกรม Microsoft
                  PowerPoint
                </p>
              </div>
              <br />
              <h6 class="rem2">3.4.1.2 การสร้าง Theme ใหม่</h6>
              <p class="rem5">
                ผู้ใช้สามารถสร้าง Theme ของตัวเองได้ หาก Theme
                สำเร็จรูปที่มีอยู่ไม่ตรงกับความต้องการ โดยเริ่มจาก File ---> New
                แล้วเลือก Blank Presentation จากนั้นคลิกเม้าส์ขวาที่สไลด์
                แล้วเลือก Format Background จากนั้นไปที่ Fill ติกที่ช่อง Picture
                or texture fill และ คลิกที่ Insert
                แล้วไปเลือกไฟล์ภาพที่เตรียมไว้เพื่อทำเป็นพื้นหลัง แล้วคลิกที่
                Apply to All
              </p>
              <br />
              <div class="text-center font-italic">
                <img src="/img/lesson3/2.png" width="80%" />
                <p><br />ภาพที่ 2 – ขั้นตอนการสร้าง Theme ใหม่</p>
              </div>
              <br />
              <p class="rem5">
                เมื่อสร้างเสร็จแล้วเราสามารถ Save ไว้เป็น Theme
                ของเราที่จะใช้งาน โดยไปที่ Design บน Menu Bar
                จากนั้นคลิกที่รูปสามเหลี่ยมด้านล่าง เลือกที่ Save Current Theme
                แล้วตั้งชื่อ Theme เพื่อไว้ใช้งานต่อไป
              </p>
              <br />
              <div class="text-center font-italic">
                <img src="/img/lesson3/3.png" width="80%" />
                <p><br />ภาพที่ 3 – การบันทึก Theme ใหม่สำหรับการนำไปใช้งาน</p>
              </div>
              <br />
              <p class="rem5 font-italic font-weight-bold">
                *** ข้อควรระวัง การสร้างธีมไม่ควรใช้สีมากจนเกินไป ควรใช้ไม่เกิน
                3-4 สี เนื่องจากหากใช้หลายสีจะเป็นการรบกวนสายตา ทำให้งานอ่านยาก
                ควรใช้ Background เป็นสีพื้นเรียบ เช่น สีขาว เทา ดำ หรือสีพื้น
                จะทำให้ในส่วนของเนื้อหา และรูปภาพดูเด่นขึ้น ***
              </p>
              <br />
              <h6 class="rem2">
                3.4.1.3 การใช้ Slide Master เพื่อสร้างต้นแบบสไลด์
              </h6>
              <p class="rem5">
                การสร้าง presentation
                นอกจากการใช้ธีมนำเสนอสำเร็จรูปหรือการสร้างธีมให้ตรงใจขึ้นใช้เองแล้ว
                ผู้ใช้ยังสามารถสร้างต้นแบบสไลด์ตามความต้องการได้ โดยการออกแบบ
                Slide Master หรือ โครงสร้างของสไลด์ตามความต้องการ
                ซึ่งเป็นการกำหนดหรือใส่ส่วนประกอบต่างๆ ของสไลด์
                เพื่อให้สไลด์มีรูปแบบเดียวกัน ทั้ง สี เส้น รูปทรง ข้อความ รูปภาพ
                โดยผู้ใช้สามารถแบ่งการนำเสนอเป็นส่วนๆ
                และกำหนดรูปแบบของสไลด์ในแต่ละส่วนให้แตกต่างกันได้ (เช่น
                สไลด์แรกจะเป็นสไลด์หน้าปก และสไลด์ถัดไปแบ่งเป็นบทๆ
                โดยแต่ละบทมีรูปแบบของสไลด์แตกต่างกัน) การใช้ Slide Master
                จะทำให้งานนำเสนอของเรามีสไตล์และสามารถทำได้ในเวลาที่รวดเร็ว
              </p>
              <br />

              <p class="font-weight-bold rem2">วิธีการสร้างต้นแบบสไลด์</p>
              <p class="rem5">
                1) เปิดโปรแกรม PowerPoint แล้วไปที่ File -------> New เลือก
                Blank Presentation
              </p>
              <p class="rem5">2) คลิกที่แถบ View -------> Slide Master</p>
              <br />
              <div class="text-center font-italic">
                <img src="/img/lesson3/4.png" width="80%" />
                <p><br />ภาพที่ 4 – การเปิดใช้งาน Slide Master</p>
              </div>
              <br />
              <p class="rem2">
                จากนั้นแถบ Slide Master จะแสดงสไลด์ต้นแบบหลายสไลด์ที่มี layout
                แบบต่างๆ ขึ้นมาทางด้านขวามือให้ผู้ใช้งานสามารถปรับแก้ได้
                ตามต้องการ
              </p>
              <div class="text-center font-italic">
                <img src="/img/lesson3/5.png" width="80%" />
                <p><br />ภาพที่ 5 ลักษณะของ Slide Master และ สไลด์ต้นแบบ</p>
              </div>
              <br />
              <p class="rem5">
                3) การปรับแก้ layout ของสไลด์ต้นแบบใน Slide Master
                ผู้ใช้สามารถเพิ่มเส้น ข้อความ รูปภาพ รูปทรง
                และจัดวางตำแหน่งข้อความ รูปภาพและอื่นๆ ของสไลด์ต้นแบบได้
                โดยหากปรับแก้ที่สไลด์อันบนสุด จะมีผลกับทุกสไลด์ เช่น ให้มีโลโก้
                หรือชื่อบริษัท ปรากฏอยู่ในทุกๆ สไลด์ เป็นต้น
                แต่หากต้องการแก้ไขบางสไลด์ ให้เลือกที่สไลด์ถัดลงมาที่มี layout
                ใกล้เคียงกับที่ต้องการ
                และผู้ใช้สามารถกำหนดฟอนต์และขนาดที่ต้องการ
                ให้เหมือนกันทุกสไลด์ไว้บนสไลด์ต้นแบบ ดังภาพที่ 7
              </p>
              <br />
              <div class="text-center font-italic">
                <img src="/img/lesson3/6.png" width="80%" />
                <p>
                  <br />ภาพที่ 6
                  ตัวอย่างการใส่โลโก้และข้อความไว้บนสไลด์ต้นแบบอันบนสุดเพื่อให้ปรากฏบนทุกสไลด์
                </p>
              </div>
              <br />
              <div class="text-center font-italic">
                <img src="/img/lesson3/7.png" width="80%" />
                <p>
                  <br />ภาพที่ 7 ตัวอย่างการจัดวาง layout
                  การกำหนดฟอนต์ที่ต้องการไว้บนสไลด์ต้นแบบ
                </p>
              </div>
              <br />
              <p class="rem5">
                4) หลังจากที่ทำการแก้ไขสไลด์ตามที่ต้องการเรียบร้อยแล้ว
                ให้คลิกที่แถบ Slide Master แล้วคลิกที่ Close Master View
                หรือคลิกที่แถบ View -------> Normal เพื่อกลับไปที่หน้าปกติ
              </p>
              <p class="rem5">
                5) การเรียกใช้สไลด์ต้นแบบที่ทำ layout ไว้ในชุดของ Slide Master
                ให้คลิกที่สไลด์ที่จะกำหนดรูปแบบให้ จากนั้นคลิกที่แถบ Home
                แล้วคลิกที่ ที่ด้านข้างไอคอน Slide Layout ดังภาพที่ 8
                และจะปรากฏชุดสไลด์ต้นแบบที่อยู่ใน Slide Master
                มาให้เลือกใช้ตามต้องการ (ดังภาพที่ 9)
              </p>
              <div class="text-center font-italic">
                <img src="/img/lesson3/8.png" width="80%" />
                <p>
                  <br />ภาพที่ 8 การเรียกใช้สไลด์ต้นแบบที่ได้ทำ layout ไว้ใน
                  Slide Master
                </p>
              </div>
              <br />
              <div class="text-center font-italic">
                <img src="/img/lesson3/9.png" width="80%" />
                <p>
                  <br />ภาพที่ 9 สไลด์ต้นแบบที่มี layout แบบต่างๆ ที่อยู่ใน
                  Slide Master
                </p>
              </div>
              <!-- ---------------------------------->
              <br />
              <br />
              <br />
              <br />
              <div class="container">
                <div class="row">
                  <div class="col-auto mr-auto">
                    <router-link to="/lesson2_1" title="Lesson2_1 Page">
                    <div class="btn-wrapper">
                      <base-button
                        tag="a"
                        target="_blank"
                        rel="noopener noreferrer"
                        class="mb-3 mb-sm-0"
                        outline
                        type="info"
                        icon="fa fa-chevron-left"
                        >Previous</base-button
                      >
                    </div>
                    <div class="col text-center">
                         <div class="btn-wrapper">
                          <base-button
                          id="back-to-top"
                          href="#"
                          role="button"
                          tag="a"
                          rel="noopener noreferrer"
                          class="btn  back-to-top"
                          
                          outline type="info"
                        >
                          <i class="fa fa-chevron-up" aria-hidden="true"></i>
                        </base-button>
                      </div>
                  </div>
                    </router-link>
                  </div>
                  <div class="col-auto">
                    <router-link to="/lesson3_2" title="Lesson3_2 Page">
                      <div class="btn-wrapper">
                        <base-button
                          tag="a"
                          target="_blank"
                          rel="noopener noreferrer"
                          class="mb-3 mb-sm-0"
                          outline
                          type="info"
                        >
                          Next
                          <i class="fa fa-chevron-right" aria-hidden="true"></i>
                        </base-button>
                      </div>
                    </router-link>
                  </div>
                </div>
              </div>
              <div class="text-center mt-5">Page 1/3</div>
            </div>
          </div>
        </div>
      </section>

      <!-- Author -->
      <hr />
      <div class="col-lg-center">
        <div class="pt-4 text-center">
          <h5 class="title">
            <span class="d-block mb-1">Author | Dr.Udomluk Thampunya</span>
            <small class="h6 text-black"
              >Lecturer in the Digital Communications at Maejo University</small
            >
          </h5>
        </div>
      </div>
      <hr />
    </div>
  </div>
</template>

<script>
import { BCarousel } from "bootstrap-vue/esm/components/carousel/carousel";
import { BCarouselSlide } from "bootstrap-vue/esm/components/carousel/carousel-slide";
export default {
  name: "home",
  components: {
    BCarousel,
    BCarouselSlide,
  },
};
</script>
