<template>
  <div>
    <div class="position-relative">
      <section class="section-shaped my-0">
        <div class="shape shape-style-1 shape-default">
          <span></span>
          <span></span>
          <span></span>
          <span></span>
          <span></span>
          <span></span>
          <span></span>
          <span></span>
          <span></span>
        </div>

        <div class="container shape-container d-flex">
          <div class="col px-0"></div>
        </div>
      </section>

      <section class="section section-shaped my-0 overflow-hidden">
        <div class="container pt-lg pb-80">
          <div class="row justify-content-center">
            <div class="fontx col-lg-10">
              <!-- -------------------------------- -->
              <h4>โซลิตสเตตไดรฟ์ (Solid State Drive)</h4>
              <p class="rem2 text-justify">
                โซลิตสเตตไดรฟ์ หรือ เอสเอสดี
                เป็นอุปกรณ์บันทึกข้อมูลที่ถูกสร้างขึ้นมาจากหน่วยความจำแฟลช
                มีความจุตั้งแต่ 80GB ถึง 4TB (มีจำหน่วยในประเทศไทย ณ
                วันที่เขียน)
                เอสเอสดีถูกออกแบบให้ใช้เป็นหน่วยความจำหลักสำหรับติดตั้งถาวรในเครื่องคอมพิวเตอร์ส่วนบุคคล
                เครื่องเซอร์ฟเวอร์ หรือภายในสมาร์ทโฟน
                ส่วนควบคุมการทำงานของหน่วยความจำแฟลช
                จึงมีความซับซ้อนกว่าที่ใช้ในแฟลชไดรฟ์เป็นอย่างมาก
                เพราะต้องจัดการพื้นที่เก็บข้อมูลที่มีขนาดใหญ่
                และธรรมชาติของการอ่านและเขียนข้อมูลที่เป็นแบบเชิงสุ่ม (Random
                Read/Write) (ต่างกับแฟลชไดรฟ์ที่เป็นแบบเชิงลำดับ)
                นอกจากนั้นยังมีการเชื่อมต่อข้อมูลที่ต้องการความเร็วสูงในการรับส่งข้อมูลอีกด้วย
              </p>
              <br />
              <div class="text-center font-italic col">
                <img src="/img/lesson7/f3.png" width="70%" />
                <p>
                  <br />Figure 3 ตัวอย่างเอสเอสดีที่มีการเชื่อมต่อแบบ SATA และ
                  M.2 (https://www.samsung.com)
                </p>
              </div>
              <br />
              <p class="rem2 text-justify">
                เนื่องจากการทำงานบนเอสเอสดีจะต้องมีการแก้ไขข้อมูลที่ถูกบันทึกอยู่บ่อยครั้ง
                ส่วนควบคุมจึงต้องใช้อันตอนวิธี (Algorithm)
                อันซับซ้อนเพื่อให้จำนวนของการเปลี่ยนแปลงค่าในเซลล์ข้อมูลมีการเปลี่ยนแปลงน้อยที่สุดเพื่อยืดอายุการใช้งาน
                ตัวอย่างเช่น เอสเอสดีที่ถูกสร้างขึ้นด้วยเซลล์แบบ QLC
                จะมีรอบของการแก้ไขข้อมูลอยู่เพียง 100 ครั้งต่อเซลล์
                ดังนั้นหากไม่มีการจัดการที่ดี อายุขัยของ เอสเอสดีจะสั้นมาก
                ดังนั้นส่วนควบคุมจึงต้องมีขึ้นตอนวิธีดังนี้
              </p>
              <p class="rem2 text-justify">
                การแคช (Cache)
                เป็นการบันทึกข้อมูลที่ต้องการเขียนลงในหน่วยความจำชั่วคราวซึ่งมักจะสร้างจากหน่วยความจำที่มีความเร็วสูงและทนทานต่อการอ่านและเขียนซ้ำก่อน
                จากนั้นจึงสำเนาข้อมูลนี้ลงในแฟลชเซลล์
                ซึ่งวิธีการแคชนี้นอกจากจะช่วยให้การอ่านและเขียนข้อมูลทำได้เร็วแล้ว
                หากข้อมูลที่ต้องการแก้ไขอยู่ในหน่วยความจำแคชอยู่แล้ว
                ก็ทำการแก้ไขในหน่วยความจำแคชได้เลย โดยไม่ต้องกระทำกับเซลล์
                วิธีการนี้จึงช่วยลดจำนวนการเขียนข้อมูลที่ไม่จำเป็นของเซลล์ได้
              </p>
              <p class="rem2 text-justify">
                การเกลี่ยความเสื่อมสภาพ (Wear leveling)
                ในการใช้งานจริงเป็นไปได้ที่แฟ้มข้อมูลบางแฟ้มอาจถูกแก้ไขบ่อยกว่าแฟ้มอื่น
                ๆ ตัวอย่างเช่นแฟ้มฐานข้อมูลการขายประจำวัน
                ที่จะต้องมีการเปลี่ยนแปลงข้อมูลอยู่ตลอดเวลา
                ซึ่งจะทำให้เซลล์ที่เก็บข้อมูลนี้อยู่เสื่อมสภาพเร็วกว่าเซลล์อื่น
                ๆ ส่วนควบคุมจึงต้องทำการเช็คความเสื่อมสภาพของเซลล์
                หากพบว่ามีความเสื่อมสภาพสูงกว่าเซลล์อื่น
                ก็จะทำการเขียนข้อมูลที่ต้องการแก้ไขลงไปในเซลล์อื่นที่ยังไม่มีข้อมูลแทน
                จากนั้นก็ทำการติดเครื่องหมายให้เซลล์เดิมที่มีข้อมูลกลายเป็นเซลล์ว่าง
                จึงสามารถช่วยให้เซลล์มีอายุการใช้งานใกล้เคียงกัน
              </p>
              <p class="rem2 text-justify">
                การใช้ข้อมูลอภิพันธุ์ (metadata)
                เป็นการเพิ่มข้อมูลเสริมสำหรับแปลความหมายของข้อมูลแต่ละเซลล์
                ตัวอย่างเช่น ต้องการเปลี่ยนข้อมูลในเซลล์จาก 0000 ไปเป็น 1111
                จะใช้วิธีการแก้ไขข้อมูลอภิพันธุ์เพื่อสลับความหมายของ 0 และ 1
                เพื่อให้ข้อมูลเดิมที่บันทึกอยู่ในเซลล์
                มีความหมายเปลี่ยนไปโดยไม่ต้องทำการแก้ไขข้อมูลจริง ๆ ในเซลล์
              </p>
              <p class="rem2 text-justify">
                เอสเอสดีนั้นมีการเชื่อมต่ออยู่หลัก ๆ อยู่ 2 แบบ
                คือแบบที่ติดตั้งภายในเครื่อง คือแบบ SATA กับ M.2
                และแบบที่เชื่อมต่อภายนอก จะเชื่อมต่อแบบยูเอสบี เหมือนแฟลชไดรฟ์
                เรียกว่า เอสเอสดีฮาร์ดไดรฟ์แบบภายนอก (External SSD Hard drive)
                วิธีการใช้งานเหมือนกับแฟลชไดรฟ์
                แต่เนื่องจากมีส่วนควบคุมที่ซับซ้อนกว่า
                และสามารถเข้าถึงข้อมูลแบบสุ่มได้
                จึงสามารถทำงานตัดต่อวิดิทัศน์บนเอสเอสดีได้
              </p>
              <p class="rem2 text-justify">
                เอสเอสดีมีความเร็วในการอ่านและเขียนข้อมูลที่สูงกว่าฮาร์ดไดรฟ์แบบแม่เหล็ก
                (แบบเก่า) ใช้พลังงานน้อย
                และสามารถเก็บรักษาข้อมูลได้เป็นเวลานานกว่า มีขนาดเล็ก
                และนอกจากนั้นยังไม่มีเสียงรบกวนขณะใช้งานอีกด้วย แต่อย่างไรก็ตาม
                เอสเอสดีนั้นมีราคาสูง
                และหากใช้เป็นอุปกรณ์บันทึกข้อมูลหลักในการทำงาน
                ผู้ใช้ควรคำนึงถึงชนิดของเซลล์ที่ใช้ในการผลิตเอสเอสดีด้วย
                หากผู้ใช้งานต้องการความเร็วและความทนทานต่อความเสื่อมสภาพก็ควรเลือกใช้ชนิดที่สร้างด้วยเซลล์แบบ
                SLC แต่เอสเอสดีชนิดนี้ก็จะมีราคาสูงด้วย
                หากต้องการเอสเอสดีที่มีราคาถูกก็ต้องใช้งานให้ถูกวิธีเพื่อไม่ให้มีการเสื่อมสภาพเร็วเกินไป
                โดยไม่ทำการลบและบันทึกข้อมูลโดยไม่จำเป็น
                อีกวิธีที่ช่วยยืดอายุการใช้งานได้คือไม่บันทึกข้อมูลจนใกล้เต็มความจุของเอสเอสดี
                เนื่องจากจะมีเหลือพื้นที่ว่างสำหรับการเกลี่ยความเสื่อมสภาพ
                ดังนั้นหากใช้งานเอสเอสดี เป็นหน่วยความจำหลักในการทำงาน
                ก็ควรใช้งานเพียงครึ่งหนึ่งของความจุทั้งหมด
                หากหลีกเลี่ยงไม่ได้ที่ต้องเปลี่ยนแปลงข้อมูลบ่อย
                หรือต้องการพื้นที่ในการเก็บข้อมูลสูง ก็ไม่ควรใช้เอสเอสดี
                แต่ให้ใช้ฮาร์ดไดรฟ์แบบแม่เหล็กแทน
              </p>
              <p class="rem2 text-justify">
                ความจุของแฟลชไดรฟ์และเอสเอสดีนั้นมีหน่วยเป็น ไบต์ (Byte)
                แทนด้วยตัวอักษร B โดยพื้นที่ 1
                ไบต์จะประกอบด้วยหน่วยบันทึกข้อมูลที่เป็นข้อมูลได้เพียง 0 หรือ 1
                เท่านั้นเรียกว่า บิต (Bit) แทนด้วยตัวอักษร b จำนวน 8 บิต
                ซึ่งระบบดิจิทัลจะเป็นเลขฐาน 2 ที่ 1 หลักจะแทนตัวเลขได้เพียง 2
                จำนวนคือ 0 และ 1 แตกต่างกับระบบเลขฐาน 10 ที่ 1 หลักจะแทนได้ถึง
                10 จำนวนคือ 0,1,2,3,4,5,6,7,8,9 การเพิ่มจำนวนหลักในฐาน 10
                จะเพิ่มจำนวนค่าที่แทนได้เป็น 10 เท่า แต่สำหรับฐาน 2
                แล้วการเพิ่มจำนวนหลักจะทำให้จำนวนค่าที่แทนได้เพิ่มขึ้นเพียง 2
                เท่า
              </p>

              <p class="rem5 text-justify">
                ดังนั้นการเก็บข้อมูล 1,000 ค่า สำหรับเลขฐาน 10 จะต้องใช้ 3 หลัก
                (000 ถึง 999) หรือ 103
              </p>
              <p class="rem5 text-justify">
                แต่การเก็บข้อมูล 1,000 ค่าหากใช้เลขฐาน 2 จะต้องใช้ 10 หลัก (00
                0000 0000 ถึง 11 1110 1000) หรือ 210 แต่จะเห็นว่าจำนวนบิต 10
                หลักนั้นสามารถแทนข้อมูลได้ถึง 210 = 1024 ระดับ
                และพื้นที่เก็บข้อมูลขนาด 1,000 ค่านั้นจึงไม่มีในระบบดิจิทัล
              </p>

              <p class="rem2 font-weight-bold text-justify">
                ดังนั้นเพื่อป้องกันความสับสนของหน่วยความจุของข้อมูลที่เป็นเลขฐาน
                2 และหน่วยความจุที่เป็นเลขฐาน 10
                จึงได้มีการกำหนดให้เรียกหน่วยแยกกันอย่างชัดเจน โดยฐาน 10
                จะใช้หน่วยเมตริก (Metric) และฐาน 2 ใช้หน่วยไออีซี( International
                Electrotechnical Commission : IEC)
              </p>
              <br />

              <p class="font-weight-bold rem2">ตาราง 1 : หน่วยเรียกในระบบเมตริก</p>
              <br />
              <table class="table">
                <thead>
                  <tr class="text-center">
                    <th scope="col">ค่า</th>
                    <th scope="col">ตัวย่อ</th>
                    <th scope="col">หน่วยเมตริก</th>
                    <th scope="col">คำอ่าน</th>
                  </tr>
                </thead>
                <tbody>
                  <tr>
                    <th scope="row">1000</th>
                    <td>kB</td>
                    <td>Kilobyte</td>
                    <td>กิโลไบต์</td>
                  </tr>
                  <tr>
                    <th scope="row">1000^2</th>
                    <td>MB</td>
                    <td>Megabyte</td>
                    <td>เมกะไบต์</td>
                  </tr>
                  <tr>
                    <th scope="row">1000^3</th>
                    <td>GB</td>
                    <td>Gigabyte</td>
                    <td>กิกะไบต์</td>
                  </tr>
                  <tr>
                    <th scope="row">1000^4</th>
                    <td>TB</td>
                    <td>Terabyte</td>
                    <td>เทราไบต์</td>
                  </tr>
                  <tr>
                    <th scope="row">1000^5</th>
                    <td>PB</td>
                    <td>Petabyte</td>
                    <td>เพตาไบต์</td>
                  </tr>
                  <tr>
                    <th scope="row">1000^6</th>
                    <td>EB</td>
                    <td>Exabyte</td>
                    <td>เอกสะไบต์</td>
                  </tr>
                  <tr>
                    <th scope="row">1000^7</th>
                    <td>ZB</td>
                    <td>Zettabyte</td>
                    <td>เซตะไบต์</td>
                  </tr>
                  <tr>
                    <th scope="row">1000^8</th>
                    <td>YB</td>
                    <td>Yottabyte</td>
                    <td>โยตะไบต์</td>
                  </tr>
                </tbody>
              </table>
              <br />
              <p class="font-weight-bold rem2">ตาราง 2 : หน่วยเรียกในระบบไออีซี</p>
              <br />
              <table class="table">
                <thead>
                  <tr class="text-center">
                    <th scope="col">ค่า</th>
                    <th scope="col">ตัวย่อ</th>
                    <th scope="col">หน่วยเมตริก</th>
                    <th scope="col">คำอ่าน</th>
                  </tr>
                </thead>
                <tbody>
                  <tr>
                    <th scope="row">1024</th>
                    <td>KiB</td>
                    <td>Kibibyte</td>
                    <td>คีบีไบต์</td>
                  </tr>
                  <tr>
                    <th scope="row">1024^2</th>
                    <td>MiB</td>
                    <td>Mebibyte</td>
                    <td>เมบิไบต์</td>
                  </tr>
                  <tr>
                    <th scope="row">1024^3</th>
                    <td>GiB</td>
                    <td>Gibibyte</td>
                    <td>กิบิไบต์</td>
                  </tr>
                  <tr>
                    <th scope="row">1024^4</th>
                    <td>TiB</td>
                    <td>Tebibyte</td>
                    <td>เทบิไบต์</td>
                  </tr>
                  <tr>
                    <th scope="row">1024^5</th>
                    <td>PiB</td>
                    <td>Pebibyte</td>
                    <td>เพบิไบต์</td>
                  </tr>
                  <tr>
                    <th scope="row">1024^6</th>
                    <td>EiB</td>
                    <td>Exbibyte</td>
                    <td>เอกบิไบต์</td>
                  </tr>
                  <tr>
                    <th scope="row">1024^7</th>
                    <td>ZiB</td>
                    <td>Zebibyte</td>
                    <td>เซบิไบต์</td>
                  </tr>
                  <tr>
                    <th scope="row">1024^8</th>
                    <td>YiB</td>
                    <td>Yobibyte</td>
                    <td>โยบิไบต์</td>
                  </tr>
                </tbody>
              </table>
              <br />
              <p class="rem2 text-justify">
                จากตารางนี้จะสังเกตได้ว่าอุปกรณ์ที่มีหน่วยความจะเป็น 1GiB
                จะมีพื้นที่สำหรับบันทึกข้อมูลมากกว่า 1GB เสมอ
                ดังนั้นในการเลือกซื้อจึงควรพิจารณาความคุ้มค่าในส่วนนี้ด้วย
                เนื่องจากกฎหมายยังไม่ได้บังคับให้ผู้ผลิตใช้หน่วยใดในการแสดงค่าความจุของอุปกรณ์บันทึกข้อมูล
                บางผู้ผลิตหรือร้านค่าจึงแสดงค่าความจุเป็น GB
              </p>
              <br />

              <h4>ส่งออกข้อมูลจากแฟ้มดิจิทัลไปสู่เอกสารที่เป็นกระดาษ</h4>
              <p class="rem2 text-justify">
                แฟ้มข้อมูลหรือเอกสารที่อยู่ในรูปแบบดิจิทัลนั้นง่ายต่อการจัดเก็บ
                การส่งต่อ และการประมวลผล
                แต่มนุษย์นั้นไม่สามารถจะเข้าใจข้อมูลดิจิทัลได้โดยตรง
                เพื่อให้มนุษย์เข้าใจได้จะต้องทำการแปลงให้อยู่ในรูปแบบแอนะล็อกก่อน
                เอกสารที่เป็นภาพก็เช่นกัน
                ภาพถ่ายที่อยู่ในรูปแบบดิจิทัลเมื่อแสดงผลจะถูกแปลงให้อยู่ในรูปแบบของสัญญาณแอนะล็อก
                และแสดงบนจอภาพในรูปแบบของชุดของจุดภาพ (pixel) เรียกว่าแผนที่บิต
                (bitmap) หรือการพิมพ์ลงสู่กระดาษเป็นภาพ
                หรือเรียกว่าการทำฮาร์ดก็อปปี้ (hard copy)
              </p>
              <p class="rem2 text-justify">
                เอกสารที่เป็นข้อความ (text document) จะถูกจัดเก็บในรูปแบบของ
                สายอักขระ (string) การแปลงออกเป็นภาพ จะใช้วิธีการกวาดจุดภาพ
                หรือแรสเตอร์ไรเซชั่น (rasterization) ที่ละกลุ่มตามรูปแบบตัวอักษร
                (font) ที่กำหนด จากนั้นจุดภาพจะถูกจัดกลุ่มให้มีขนาดกลุ่มละ 8 บิต
                ในกรณีที่เป็นภาพทวิภาค (binary)ซึ่งมีเพียง 2 ระดับคือดำและขาว
                ก็จะได้ออกมาเป็นภาพแผนที่บิต
              </p>
              <br />
              <div class="text-center font-italic col">
                <img src="/img/lesson7/7.png" width="70%" />
                <p>
                  <br />รูป
                  7ตัวอย่างการแปลงข้อมูลดิจิทัลเป็นภาพด้วยวิธีแรสเตอรไรเซชั่น
                </p>
              </div>
              <br />
              <p class="rem2 text-justify">
                หากข้อความหรือภาพมีความยาว ก็จะนำเอากลุ่มของจุดภาพนี้มาต่อรวมกัน
                ก็จะได้เป็นภาพหรือข้อความที่สมบูรณ์ เครื่องพิมพ์ (printer)
                คืออุปกรณ์ที่ทำหน้าที่แปลงข้อมูลแรสเตอร์นี้ให้เป็นแผนที่บิต
                และถ่ายทอดแผนที่บิตนี้เป็นภาพลงบนกระดาษ
                เครื่องพิมพ์ที่มีความละเอียดสูงจะสามารถถ่ายทอดจุดภาพที่มีขนาดเล็ก
                กว่าเครื่องพิมพ์ที่มีความละเอียดต่ำ
                โดยความละเอียดนี้จะระบุในหน่วยของ จำนวนจุดภาพต่อความยาว 1 นิ้ว
                (dot-per-inch : DPI) ยังค่านี้สูง ก็จะได้ภาพที่มีความละเอียดสูง
                ขั้นตอน วิธีการ หรือภาษาในการแปลงข้อมูลดิจิทัลให้กลายเป็นภาพ
                นั้นจะแตกต่างกันไปขึ้นอยู่กับเทคโนโลยีการพิมพ์ของเครื่องพิมพ์
                และเทคโนโลยีเฉพาะของผู้ผลิต
              </p>
              <br />
              <div class="text-center font-italic col">
                <img src="/img/lesson7/8.png" width="70%" />
                <p>
                  <br />รูป 8 ตัวอย่างแผนที่บิตของสายอักขระ “MJU”
                </p>
              </div>
              <br />
              <p class="rem2 font-weight-bold">เทคโนโลยีของเครื่องพิมพ์นั้นแบ่งออกเป็น 4 กลุ่มได้แก่</p>
              <p class="rem5">1. ใช้ผงหมึก ( Toner-based printers)</p>
              <p class="rem5">2. พ่นน้ำหมึก (Liquid inkjet printer)</p>
              <p class="rem5">3. การระเหิด (Dye-sublimation printers)</p>
              <p class="rem5">4. ใช้ความร้อน (Thermal printers)</p>
              <p class="rem5">5. เครื่องพิมพ์แบบกระแทก ( Impact printers)</p>

              <h4>การพิมพ์ด้วยผงหมึก (Toner-based printers)</h4>
              <p class="rem2 text-justify">
                การพิมพ์ด้วยผงหมึก (Toner-based printers)
                เป็นเครื่องพิมพ์ที่สร้างภาพบนกระดาษโดยใช้ผงหมึก เรียกว่าโทนเนอร์
                (toner) สามารถพิมพ์ได้อย่างรวดเร็ว และมีคุณภาพการพิมพ์ที่ดี
                หลักการทำงานจะคล้ายกับเครื่องถ่ายเอกสาร
                เครื่องพิมพ์ประเภทนี้ที่ได้รับความนิยมคือ เครื่องพิมพ์แบบเลเซอร์
                (LASER printer) ซึ่งมีส่วนประกอบสำคัญอยู่ 5 ส่วนคือ
              </p>
              <p class="rem5">- ดรัม (drum) เป็นลูกกลิ้งไวต่อประจุ ประจุและผงหมึกสามารถยึดเกาะได้ดี</p>
              <p class="rem5">- โทนเนอร์ (toner) เป็นผงหมึกที่เกิดประจุและเกาะกับดรัมได้ดี</p>
              <p class="rem5">- เลเซอร์ไดโอด ( later diode) ใช้สร้างแสงเลเซอร์</p>
              <p class="rem5">- ลูกกลิ้งสำหรับอบหลอมและรีดผงหมึก (fuser)</p>
              <br />
              <div class="text-center font-italic col">
                <img src="/img/lesson7/9.png" width="70%" />
                <p>
                  <br />รูป 9 โครงสร้างตัดขวางของเครื่องพิมพ์แบบเลเซอร์
                </p>
              </div>
              <br />
              <p class="rem2 font-weight-bold">การทำงานของเครื่องพิมพ์แบบเลเซอร์จะมีขั้นตอนดังนี้</p>
              <p
                class="rem5"
              >1. ทำความสะอาดดรัม(Clean): ลูกกลิ้งดรัมมีความสำคัญมากในการสร้างภาพบนกระดาษ เพราะมีหน้าที่ลำเลียงผงหมึกจากโทนเนอร์ไปยังกระดาษ หากมีผงหมึกตกค้างจากการพิมพ์ครั้งก่อน จะทำให้เกิดเป็นรอยสกปรกที่กระดาษได้ ดังนั้นขั้นตอนแรกของการพิมพ์คือการทำความสะอาดดรัมเสียก่อน</p>
              <p
                class="rem5"
              >2. ถ่ายเทประจุลงไปยังดรัม (Charge): ด้านข้างของดรัมจะมีเส้นลวดโคโรน่า (corona wire) พาดขนานอยู่ เมื่อจ่ายไฟฟ้าแรงดันสูงเข้าไปในเส้นลวดนี้ อากาศรอบ ๆจะกลายเป็นไอออน และประจุไอออนนี้จะเกาะติดอยู่กับดรัม ผิวของดรัมที่ผ่านขั้นตอนนี้ จะมีประจุเกาะอยู่จนเต็มพื้นที่</p>
              <p
                class="rem5"
              >3. เปิดรับแสง (Exposure) : ภาพที่ต้องการพิมพ์จะถูกวาดลงไปบนดรัมด้วยแสงเลเซอร์ โดยการกวาด(แรสเตอร์ไรเซชั่น) ด้วยกระจกหกด้านที่หมุนด้วยความเร็วสูง การหมุนของกระจกจะทำให้ลำแสงกวาดไปในแนวนอน ประกอบกับการเปิดและปิด เลเซอร์ ในจังหวะที่เหมาะสมตามข้อมูลแผนที่บิต ก็จะทำให้เกิดเป็นภาพขึ้นที่ดรัม เนื่องจากประจุที่ถูกแสงเลเซอร์ตกกระทบ จะหลุดออกไปจากดรัม ดังนั้นภาพที่เกิดขึ้นบนดรัมคือประจุที่เรียงตัวเป็นภาพเนกาตีฟ (negative) และกลับซ้ายขวา(mirror image) ของภาพที่ต้องการพิมพ์</p>
              <p
                class="rem5"
              >4. ทำให้เกิดภาพ (Develop): ขั้นตอนนี้ผงหมึกจะถูกทำให้มีประจุเป็นลบ (ประจุชนิดเดียวกับบนดรัม) และผงหมึกที่เป็นลบนี้จะถูกถ่ายเทผ่านลูกกลิ้งลงไปบนดรัม และจะไปเกาะอยู่บนดรัมในส่วนที่ไม่มีประจุ (ส่วนที่ถูกฉายด้วยเลเซอร์) เนื่องจากประจุเป็นแบบเดียวกันจะไม่ดึงดูดกัน ส่วนที่ไม่ถูกแสงจึงไม่มีผงหมึกเกาะ</p>
              <p
                class="rem5"
              >5. ส่งผ่านผงหมึกลงกระดาษ: ผงหมึกที่เกาะอยู่บนดรัมจะถูกกดลงบนกระดาษที่ต้องการพิมพ์จึงเกิดเป็นภาพขึ้นบนกระดาษ ภาพบนกระดาษที่ผ่านขั้นตอนนี้จะเกิดเป็นภาพที่ต้องการพิมพ์ แต่ผงหมึกจะยังไม่ยึดติดกับกระดาษอย่างถาวร</p>
              <p
                class="rem5"
              >6. หลอมหมึก: ผงหมึกที่ติดอยู่บนกระดาษจะถูกอบด้วยความร้อนให้หลอมและรีดให้ติดแน่นถาวรอยู่บนกระดาษ ก็เสร็จสิ้นขั้นตอนของการพิมพ์แบบเลเซอร์</p>
              <br />
              <div class="text-center font-italic col">
                <img src="/img/lesson7/10.png" width="70%" />
                <p>
                  <br />รูป 10 ระบบเลเซอร์ของเครื่องพิมพ์ DELL P 1500 (By Jeroen74 - Own work, CC BY-SA 3.0)
                </p>
              </div>
              <br />
              <p
                class="rem2"
              >เนื่องจากเครื่องพิมพ์จะชนิดนี้จะต้องนำเอาข้อมูลภาพที่ส่งมาจากเครื่องคอมพิวเตอร์มาสร้างเป็นภาพที่กลับด้านซ้าย-ขวา และการพิมพ์จะไม่ทำทีละกลุ่มจุดภาพ แต่จะกวาดทีละเส้นของทุก ๆจุดภาพในแนวนอน ดังนั้นเครื่องพิมพ์จึงต้องบันทึกข้อมูลที่ส่งมาจากเครื่องคอมพิวเตอร์ให้ครบทั้งหน้ากระดาษก่อนในหน่วยความจำของเครื่องพิมพ์ (buffer) จึงจะสามารถประมวลผลและเริ่มพิมพ์ได้ในขั้นตอนนี้หากการเชื่อมต่อมีความเร็วต่ำตัวอย่างเช่นการเชื่อมต่อผ่านทางเครือข่ายไร้สาย (WIFI) อาจต้องใช้เวลานานจึงจะเริ่มทำการพิมพ์ได้</p>
              <p class="rem2">ในการใช้งานผู้ใช้จะต้องทำการติดตั้งซอฟต์แวร์ไดรเวอร์ที่ให้มาพร้อมกับเครื่องพิมพ์ให้ตรงตามรุ่น เนื่องจากเครื่องพิมพ์จากผู้ผลิตแตกต่างกัน จะใช้ภาษาในการควมคุมแรสเตอไรเซชั่นที่แตกต่างกัน แต่หากไม่สามารถหาได้ ให้ทำการตรวจสอบจากคู่มือว่าเครื่องพิมพ์รองรับภาษาแรสเตอร์ใดบ้าง โดยหลักๆจะมีอยู่ 3 ภาษาคือ</p>

              <p class="rem5"> •	Adobe Postscript:PS หรือ โพสสคริปปริ้นเตอร์</p>
              <p class="rem5"> •	HP Printer Command Language: PCL หรือ พีซีแอลปริ้นเตอร์</p>
              <p class="rem5"> •	Microsoft XML Page Specification: XPS หรือเอ็กพีเอสปร๊นเตอร์</p>

              <p class="rem2">ให้ทำการดาวน์โหลดไดรฟเวอร์ยูนิเวอร์แซล (universal driver or unified driver) มาจากผู้ผลิตมาทำการติดตั้ง แล้วทำการเลือกภาษาควบคุมให้ถูกต้องตามรุ่นของเครื่องพิมพ์ ก็จะสามารถใช้แทนกันได้</p>

              <p class="rem2">เครื่องพิมพ์ระบบนี้มีหลักการทำงานที่ซับซ้อน มีชิ้นส่วนการทำงานเป็นจำนวนมาก การทำงานจึงมีเสียงดัง และกระดาษจะติดในระบบได้ง่าย (paper jam) ผงหมึกมีความละเอียดและสามารถฟุ้งกระจายในอากาศได้ง่ายจึงควรติดตั้งในบริเวณที่มีอากาศถ่ายเทได้ดี กระดาษที่ใช้ต้องไม่มีสิ่งแปลกปลอม นำกระดาษที่ใช้แล้วมาใช้ซ้ำต้องระวังไม่ให้มีลวดเย็บกระดาษติดอยู่ เนื่องจากจะทำให้ดรัมเสียหายได้ เครื่องพิมพ์ชนิดนี้กระดาษจะต้องถูกอบด้วยความร้อนสูง จึงไม่ควรใช้พิมพ์บนวัสดุที่ไม่ทนความร้อน ตัวอย่างเช่นสติกเกอร์พลาสติก หรือแผนใสที่ไม่ทนความร้อน และเมื่อเริ่มทำการพิมพ์แล้วจะไม่สามารถหยุดการทำงานชั่วคราวได้จะต้องพิมพ์จนหมดหน้ากระดาษเพราะการหยุดกระดาษจะทำให้กระดาษไหม้ได้ </p>
              
              <br />
              <div class="text-center font-italic col">
                <img src="/img/lesson7/11.png" width="70%" />
                <p>
                  <br />รูป 11 เครื่องพิมพ์แบบเลเซอร์ (ภาพโดย Steve Buissinne จาก Pixabay)
                </p>
              </div>
              <br>
              <p
                class="rem2"
              >เครื่องพิมพ์เลเซอร์ชนิดที่พิมพ์สีได้ จะให้คุณภาพการพิมพ์ที่เหมือนกับโรงพิมพ์ ดังนั้นผู้ผลิตจึงทำการฝังจุดสีเหลือง (yellow dots) ที่มีลักษณะเป็นจุดสีเหลืองขนาดเล็ก มองไม่เห็นด้วยตาเปล่า โดยจุดภาพนี้จะทำการเข้ารหัส วันเดือนปีและหมายเลขลำดับของเครื่องพิมพ์ (serial number) เพื่อป้องกันไม่ให้ผู้ใช้นำไปใช้ในการผลิตเอกสารปลอม อย่างเช่น เอกสารทางราชการปลอม หรือ ธนบัตรปลอม หากมีการตรวจพบก็จะสามารถถอดรหัสจุดสีเหลือง เพื่อสืบกลับไปหาได้ว่าเอกสารนี้พิมพ์มาจากเครื่องพิมพ์เครื่องไหนได้</p>
              <br />
              <div class="text-center font-italic col">
                <img src="/img/lesson7/12.png" width="70%" />
                <p>
                  <br />รูป 12 จุดสีเหลืองที่ถูกฝังในเอกสารโดยเครื่องพิมพ์แบบเลเซอร์
                </p>
              </div>
              <br />
              <p class="rem2">ปัจจุบันนี้ได้มีการพัฒนาส่วนของการเปิดรับแสงจากเดิมที่ใช้เลเซอร์ กระจก และเลนส์ ไปเป็นระบบแอลอีดี ( Light Emitting Diode: LED) โดยใช้จอภาพแอลอีดีในการวาดแสงลงบนดรัมโดยตรง ทำให้ไม่จำเป็นต้องมีชุดกระจกและเลนส์ที่ซับซ้อน ความเร็วในการพิมพ์และราคาจึงถูกลง แต่ความละเอียดของการพิมพ์ก็จะลดลงตามเนื่องจากหลอดแอลอีดีมีขนาดที่ใหญ่กว่าเมื่อเทียบกับจุดภาพที่สร้างด้วยแสงเลเซอร์และเลนส์ </p>
               <br>
                <h4>พ่นน้ำหมึก (Liquid inkjet printer)</h4>

                <p class="rem2">การพิมพ์ด้วยการพ่นน้ำหมึกนั้น เป็นการพิมพ์ภาพลงบนกระดาษด้วยวิธีการพ่นพ่นน้ำหมึกซึ่งเป็นของเหลวลงบนกระดาษหรือพื้นผิวที่ต้องการพิมพ์ เครื่องพิมพ์ประเภทนี้ เป็นเครื่องพิมพ์ที่ได้รับความนิยมสูงที่สุดเนื่องจากมีราคาที่ถูก คุณภาพการพิมพ์ที่ดี มีความละเอียดสูงและเสียงไม่ดังมาก ส่วนประกอบสำคัญคือหัวพิมพ์ซึ่งทำหน้าที่พ่นน้ำหมึกลงเป็นภาพที่ต้องการ</p>
              <br />
              <div class="text-center font-italic col">
                <img src="/img/lesson7/13.png" width="40%" />
                <p>
                  <br />รูป 13 หัวพิมพ์ของเครื่องพิมพ์แบบพ่นน้ำหมึก (By Hans-Jürgen Räth Akrisios - Own work, Public Domain)
                </p>
              </div>
              <br />
              <p class="rem2 font-weight-bold">  เทคโนโลยีในการพ่นหมึกนั้นมีอยู่ 2 แบบคือ </p>
              <p class="rem5">1. การพ่นแบบต่อเนื่อง (continuous inkjet: CIJ) จะมีการพ่นน้ำหมึกตลอดเวลา โดยใช้สนามไฟฟ้าควบคุมทิศทางของการแรสเตอไรเซชั่น การพิมพ์ไม่ต้องสัมผัสกับวัตถุที่ต้องการพิมพ์ สามารถพิมพ์ได้ความเร็วสูง แต่คุณภาพไม่ละเอียดจึงนิยมใช้ในโรงงานอุตสาหกรรม เช่น การพิมพ์วันหมดอายุบนฉลากสินค้า</p>
              <p class="rem5">2. พ่นหมึกตามความต้องการ ( drop-on-demand: DOD) คือเทคโนโลยีการพ่นน้ำหมึกที่ใช้ในเครื่องพิมพ์สำนักงาน หัวพิมพ์ของระบบนี้จะประกอบไปด้วยหัวพ่นน้ำหมึกขนาดเล็กเป็นจำนวนมาก ทำให้พิมพ์ได้ทีละหลายจุดภาพ ต่อการกวาด 1 ครั้ง หัวพ่นแต่ละหัวสามารถควบคุมการปล่อยหมึกได้อย่างอิสระเพื่อสร้างจุดภาพได้ตามต้องการ เทคโนโลยีในการควบคุมการปล่อยน้ำหมึกตามที่ต้องการนั้นแบ่งออกเป็น 2 กลุ่มคือ</p>
              <p class="rem7"> 2.1  หัวพิมพ์แบบเปียโซอิเล็กทริก (Piezoelectric DOD) วัสดุที่มีคุณสมบัติเปียโซอิเล็กทริกจะเกิดการสั่นหรือปิดตัวเมื่อจ่ายกระแสไฟฟ้าเข้าไปในตัววัสดุ มีหลักการทำงานคล้ายกระบอกฉีดยาโดยใช้วัสดุเปียโซอิเล็กทริกเป็นตัวดันน้ำหมึกให้พ่นออกมายังหัวฉีด เหมือนกับมีปั๊มขนาดจิ๋วที่สั่งให้พ่นน้ำหมึกออกมาได้ในเวลาที่ต้องการ และยังสามารถสร้างหยดหมึกได้หลายขนาดอีกด้วย เนื่องจากใช้กลไกเชิงกลในการควบคุมหมึก หัวพิมพ์แบบนี้จึงใช้ได้กับน้ำหมึกที่มีเคมีหลากหลาย จึงมีหมึกให้เลือกใช้ได้หลายแบบ เครื่องพิมพ์ที่ใช้หัวพิมพ์แบบนี้คือ Epson และ Brother</p>
              <br />
              <div class="text-center font-italic col">
                <img src="/img/lesson7/14.png" width="70%" />
                <p>
                  <br />รูป 14 โครงสร้างหัวพิมพ์แบบเปียโซอิเล็กทริก
                </p>
              </div>
              <br />
              <p class="rem7 text-justify">2.2 หัวพิมพ์แบบใช้ความร้อน (Thermal) หัวพิมพ์ชนิดนี้จะใช้น้ำหมึกชนิดพิเศษที่ถูกพัฒนามา
                  ให้เกิดฟองกากาศได้ง่ายเมื่อถูกความร้อน โครงสร้างของหัวพิมพ์จะคล้ายกับแบบเปียโซอิเล็กทริกแต่จะมีจุดที่แตกต่างกันคือ 
                  ไม่ได้ใช้วัสดุเปียโซในการดันน้ำหมึกให้ออกมาจากหัวฉีด แต่จะใช้อุปกรณ์ในการสร้างความร้อนเพื่อต้มน้ำหมึกแทน 
                  เมื่อต้องการปล่อยหยดหมึก หัวพิมพ์จะทำการให้ความร้อนยังตำแหน่งที่ต้องการหยดน้ำหมึก
                   เมื่อหมึกได้รับความร้อนก็จะเกิดฟองอากาศ ฟองนี้จะไปเพิ่มความดันในหัวพ่นทำให้ไปดันน้ำหมึกออกมาจากหัวพิมพ์
                    อุปกรณ์ในการสร้างความร้อนนิยมใช้ตัวต้านทานแบบฟิล์มบาง (thin-film resistors)
                     หัวพิมพ์แบบนี้ไม่สามารถปรับขนาดของหยุดหมึกได้ แต่สามารถผลิตหัวพ่นให้มีขนาดเล็กกว่าแบบเปียโซอิเล็กทริกได้
                      จึงสร้างจุดภาพได้เล็กกว่าคุณภาพการพิมพ์จึงละเอียดกว่า แต่การที่ต้องใช้หมึกชนิดพิเศษทำให้มีชนิดของหมึกให้เลือกน้อย
                       หมึกส่วนใหญ่ไม่กันน้ำ และหมึกมีความเข้มข้นน้อยกว่าแบบเปียโซอิเล็กทริก เครื่องพิมพ์ที่ใช้หัวพิมพ์แบบนี้คือ 
                       Hewlett-Packard Canon และ Lexmark</p>
                <br />
              <div class="text-center font-italic col">
                <img src="/img/lesson7/15.png" width="70%" />
                <p>
                  <br />รูป 15 โครงสร้างหัวพิมพ์แบบใช้ความร้อน
                </p>
              </div>
              <br />
              <p class="rem2 text-justify"> เครื่องพิมพ์แบบพ่นหมึกมีความละเอียดในการพิมพ์สูงกว่าแบบเลเซอร์ แต่ในการพิมพ์จะใช้เวลานานกว่า 
                  เครื่องพิมพ์แบบพ่นน้ำหมึก มีโครงสร้างที่ไม่ซับซ้อนจึงดูแลรักษาง่าย กระดาษติดได้ยาก
                   ไม่เกิดความร้อนในขนะพิมพ์ทำให้สามารถพิมพ์บนวัสดุที่หลากหลาย อย่างเช่นสติกเกอร์และแผ่นซีดีรอม 
                   คุณภาพการพิมพ์สูงพอที่จะพิมพ์ภาพถ่ายได้ แต่ข้อเสียคือ ต้องใช้หมึกแบบพิเศษจึงมีราคาสูงทำให้ต้นทุนใน
                   การพิมพ์ต่อแผ่นมีราคาสูง การพิมพ์ใช้หมึกที่เป็นของเหลวทำให้ต้องใช้เวลารอให้แห้งนาน
                    และไม่สามารถพิมพ์ลงกระดาษที่บางได้ เพราะหมึกจะทะลุกระดาษลงไปยังหน้าที่อยู่อีกด้านได้ 
                    ภาพสีที่ได้จากการพิมพ์ระบบนี้จะซีดจางได้ง่าย แต่ป้องกันได้โดยใช้หมึกชนิดที่ป้องกันการซีดจางเมื่อถูกแสง
                     แต่ก็จะมีราคาสูงขึ้นด้วย ปัญหาอีกประการของเครื่องพิมพ์ระบบนี้คือ หัวพ่นหมึกมีขนาดเล็กมากทำให้ง่ายต่อการอุดตัน
                      ดังนั้นผู้ใช้งานไม่ควรปิดเครื่องทิ้งไว้นานเพราะจะทำให้หัวพ่นอุดตันได้ 
                      โดยทั่วไปแล้วเครื่องพิมพ์จะทำการล้างหัวพิมพ์โดยอัตโนมัติเองวันละ 1 ครั้ง แต่หากผู้ใช้ปิดเครื่องไว้นานจนพบว่าหัวพ่นตัน 
                      (เมื่อหัวพ่นตัน จะพิมพ์จุดภาพได้ไม่ครบ) ให้ทำการสั่งล้างหัวพ่นผ่านทางซอร์ฟแวร์ไดรเวอร์ของเครื่องพิมพ์ 
                      จนกว่าคุณภาพการพิมพ์จะสมบูรณ์</p>
                 <br />
              <div class="text-center font-italic col">
                <img src="/img/lesson7/16.png" width="70%" />
                <p>
                  <br />รูป 16 เครื่องพิมพ์แบบพ่นน้ำหมึก (ภาพโดย Darwin Laganzon จาก Pixabay)
                </p>
              </div>
              <br />
              <p class="rem2">ปัจจุบันได้มีการดัดแปลงหัวพิมพ์โดยการเติมหมึกเข้าไปใหม่ หรือการนำไปติดแทงค์หมึก 
                  ซึ่งก็สามารถทำได้ แต่จะทำให้เครื่องหมดประกัน แต่หากจำเป็นต้องเติมหมึก ให้ใช้หมึกที่ออกแบบมาตรงกับชนิดของเครื่องพิมพ์ 
                  เนื่องจากหัวพิมพ์ที่แตกต่างกันจะใช้หมึกที่มีเคมีแตกต่างกัน จะใช้หมึกแทนกันไม่ได้ 
                  หากใช้หมึกผิดประเภทจะทำให้หัวพิมพ์เสียหายได้</p>
                <br>

                
              <!-- -------------------------------- -->
              <br />
              <br />
              <br />
              <br />
              <div class="container">
                <div class="row">
                  <div class="col-auto mr-auto">
                    <router-link to="/lesson7_1" title="Lesson7_1 Page">
                      <div class="btn-wrapper">
                        <base-button
                          tag="a"
                          target="_blank"
                          rel="noopener noreferrer"
                          class="mb-3 mb-sm-0"
                          outline
                          type="info"
                          icon="fa fa-chevron-left"
                        >Previous</base-button>
                      </div>
                    </router-link>
                  </div>
                  <div class="col text-center">
                         <div class="btn-wrapper">
                          <base-button
                          id="back-to-top"
                          href="#"
                          role="button"
                          tag="a"
                          rel="noopener noreferrer"
                          class="btn  back-to-top"
                          
                          outline type="info"
                        >
                          <i class="fa fa-chevron-up" aria-hidden="true"></i>
                        </base-button>
                      </div>
                  </div>
                  <div class="col-auto">
                    <router-link to="/lesson7_3" title="Lesson7_3 Page">
                      <div class="btn-wrapper">
                        <base-button
                          tag="a"
                          target="_blank"
                          rel="noopener noreferrer"
                          class="mb-3 mb-sm-0"
                          outline
                          type="info"
                        >
                          Next
                          <i class="fa fa-chevron-right" aria-hidden="true"></i>
                        </base-button>
                      </div>
                    </router-link>
                  </div>
                </div>
              </div>
              <div class="text-center mt-5">Page 2/3</div>
            </div>
          </div>
        </div>
      </section>

      <hr />
      <div class="col-lg-center">
        <div class="pt-4 text-center">
          <h5 class="title">
            <span class="d-block mb-1">Author | Dr. Paween Khoenkaw</span>
            <small class="h6 text-black">Lecturer in the Computer Science Division at Maejo
              University</small>
          </h5>
        </div>
      </div>
      <hr />
    </div>
  </div>
</template>

<script>
export default {
  name: "home",
  components: {},
};
</script>

<style></style>
