<template>
  <div>
    <div class="position-relative">
      <section class="fontx section section-lg section-shaped overflow-hidden my-0">
        <div class="shape shape-style-1 shape-default shape-skew">
          <span></span>
          <span></span>
          <span></span>
          <span></span>
          <span></span>
          <span></span>
        </div>
        <br />
        <br />
        <br />
        <br />
        <div class="container py-0 pb-lg">
          <div class="row justify-content-between align-items-center">
            <div class="col-lg-5 mb-5 mb-lg-0">
              <h1 class="text-white font-weight-light display-1">Security System</h1>
              <p class="lead text-white mt-4">
                ในยุคปัจจุบันเป็นโลกแห่งเทคโนโลยีสารสนเทศระบบข้อมูลสารสนเทศหลากหลาย
                ระบบได้ถูกพัฒนาและนำมาใช้ในการบริหารจัดการองค์กร...
              </p>
            </div>
            <div class="col-lg-6 mb-lg-auto">
              <div class="rounded shadow-lg overflow-hidden transform-perspective-right">
                <b-carousel id="carousel1" controls indicators>
                  <!-- Text slides with image -->
                  <b-carousel-slide img-src="img/lesson8/cov.jpg"></b-carousel-slide>
                </b-carousel>
              </div>
            </div>
          </div>
        </div>
        <br />
        <br />
        <br />
        <br />
        <br />
        <br />
      </section>

      <section class="section section-shaped my-0 overflow-hidden">
        <div class="container pt-lg pb-80">
          <div class="row justify-content-center">
            <div class="fontx col-lg-10">
              <!-- -------------------------------- -->
              <h2 class="display-3 text-center">การจัดการข้อมูลและการป้องกันข้อมูลในระบบคอมพิวเตอร์</h2>
              <br />
              <br />
              <h4>• การจัดการข้อมูล</h4>
              <p
                class="rem2"
              >ในยุคปัจจุบันเป็นโลกแห่งเทคโนโลยีสารสนเทศระบบข้อมูลสารสนเทศหลากหลายระบบได้ถูกพัฒนาและนำมาใช้ในการบริหารจัดการองค์กร โดยข้อมูล (Data) เป็นองค์ประกอบที่สำคัญของระบบสารสนเทศคอมพิวเตอร์ การจัดการข้อมูล (Data Management) เป็นกลยุทธ์หนึ่งในการบริหารจัดการองค์การให้มีประสิทธิภาพให้ทันกับโลกในยุคปัจจุบัน โดยเฉพาะอย่างยิ่งในยุคของเทคโนโลยีข่าวสารคอมพิวเตอร์ที่เจริญก้าวหน้าไปอย่างรวดเร็ว การจัดการและบริหารองค์การให้ประสบความสำเร็จนั้นจะต้องมีการตัดสินใจที่ถูกต้อง รวดเร็ว และทันต่อเหตุการณ์ซึ่งถือเป็นหัวใจของการทำธุรกิจในยุค เพื่อนำไปสู่การตัดสินใจที่ถูกต้องจะช่วยให้องค์การอยู่รอดได้ในการแข่งขันกับองค์การอื่นๆ ซึ่งผู้ใช้งานระบบคอมพิวเตอร์ควรมีความรู้ความเข้าใจและมีทักษะด้านการจัดการข้อมูลในระบบสารสนเทศคอมพิวเตอร์ให้มีประสิทธิภาพ</p>
              <p
                class="rem2"
              >การจัดการข้อมูล หมายถึง การบริหาร การจัดเก็บข้อมูล การเรียกใช้ข้อมูล การวิเคราะห์ข้อมูลเพื่อการใช้งานที่รวดเร็ว โดยมีการประมวลข้อมูลให้ได้มาซึ่งข้อมูลที่มีประโยชน์ที่พร้อมจะสามารถนำมาใช้ประโยชน์ได้ในทันทีการจัดการข้อมูลจะเกิดประโยชน์สูงสุดหรือประสิทธิภาพสูงสุดก็ต่อเมื่อผู้ใช้ข้อมูลสามารถใช้ข้อมูลที่ต้องการได้อย่างรวดเร็ว ถูกต้อง และเป็นกลางมากที่สุด เพื่อจะได้นำข้อมูลเหล่านั้นมาช่วยในการตัดสินใจหรือนำไปใช้ประโยชน์อื่นๆ ต่อไป</p>
              <br />
              <h5 class="rem2">วัตถุประสงค์ในการจัดการข้อมูล</h5>
              <p class="rem5">1. การเก็บข้อมูลเพื่อให้สามารถนำกลับมาใช้ได้ในภายหลัง</p>
              <p class="rem5">2. การจัดข้อมูลให้อยู่ในรูปแบบที่สามารถเรียกใช้ได้อย่างมีประสิทธิภาพ</p>
              <p class="rem5">3. การปรับปรุงข้อมูลให้มีความถูกต้องสมบูรณ์อยู่เสมอ</p>
              <p class="rem5">
                4. เพื่อปกป้องข้อมูลจากการทำลายที่เกิดจากอุบัติเหตุ หรือ เกิดจากความตั้งใจ เช่น การลักลอบใช้ หรือ
                แก้ไขโดยมิชอบ
              </p>
              <br>
              <h5 class="rem2">ข้อมูล (DATA)  </h5>
              <p class="rem5">คือ ข่าวสาร เอกสาร ข้อเท็จจริงหรือสาระต่างๆ ที่เกี่ยวข้องกับงานที่ปฏิบัติ บุคคล สิ่งของ หรือ เหตุการณ์ที่เกี่ยวข้อง อาจเป็นตัวเลขหรือข้อความที่เกิดขึ้นจาก การดำเนินงาน หรือที่ได้จากหน่วยงานอื่นๆ ข้อมูลเหล่านี้ ยังไม่มีการประมวลผล วิเคราะห์ และยังไม่สามารถนำไปใช้ประโยชน์ในการตัดสินใจได้ทันที หรือเรียกว่าเป็นข้อมูลดิบ เช่น  ข้อมูลตัวเลข  ข้อมูลตัวอักษร ข้อมูลรูปภาพ ข้อมูลเสียง ข้อมูลภาพวิดีโอ สัญลักษณ์ต่างๆ เป็นต้น โดยข้อมูลเหล่านี้จะนำไปใช้ได้ก็ต่อเมื่อผ่านกระบวนการประมวลผลแล้วจัดให้อยู่ในรูปสารสนเทศที่ผู้ใช้ต้องการ ดังนั้นข้อมูลจึงจำเป็น ต้องเป็นข้อมูลที่ดีมี ความถูกต้องแม่นยำ </p>
               <br>
                <h5 class="rem2">การประมวลผล (Process)</h5>
                <p class="rem5">หมายถึง การแปลงข้อมูลที่มีความสัมพันธ์กันให้เป็นสารสนเทศตามที่ต้องการ เช่น การรวบรวมเป็นแฟ้มข้อมูล การคำนวณ การเปรียบเทียบ การจัดกลุ่มข้อมูล การจัดเรียงลำดับ </p>
                <br>
                 <h5 class="rem2">สารสนเทศ (Information) </h5>
                <p class="rem5">หมายถึง สิ่งที่ได้จากการนำเอาข้อมูล (Data) ทีเก็บรวบรวมไว้มาประมวลผล เพื่อนำมาใช้ประโยชน์ตามวัตถุประสงค์ หรือ ประกอบการตัดสินใจหรือตอบปัญหาต่างๆได้   หรืออาจกล่าวได้ว่าสารสนเทศ คือ ข้อมูลที่ผ่านการเลือกสรรให้เหมาะกับการใช้งานได้ทันเวลาและอยู่ในรูปแบบที่ใช้ได้ ตัวเช่น การนำข้อมูลการขายสินค้าแต่ละประเภทในแต่ละเดือนมาประมวลผลรวมกันเพื่อสรุปยอดขายสินค้าแต่ละชนิด เพื่อให้เจ้าของธุรกิจสามารถนำไปใช้ในการตัดสินใจและวางแผนการขายสินค้าต่อไป เป็นต้น  ซึ่งสารสนเทศที่ดีต้องมาจากข้อมูลที่ดี </p>
                <p class="rem5">การจัดเก็บข้อมูลและสารสนเทศจะต้องมีการควบคุมดูแลเป็นอย่างดี เช่น อาจจะมีการกำหนด ให้ผู้ใดบ้างเป็นผู้มีสิทธิ์ใช้ข้อมูลได้ ข้อมูลที่เป็นความลับ จะต้องมีระบบขั้นตอนการควบคุมกำหนดสิทธิ์ในการแก้ไขหรือการกระทำกับข้อมูลว่าจะกระทำได้โดยใครบ้าง นอกจากนี้ข้อมูลที่เก็บไว้แล้วต้องไม่เกิดการสูญหายหรือถูกทำลายโดยไม่ได้ตั้งใจ</p>
                <br>
                <h5 class="text-center">ขั้นตอนการจัดการข้อมูลให้เป็นสารสนเทศ</h5>
                      <br />
              <div class="text-center font-italic col">
                <img src="/img/lesson8/1.png" width="70%" />
              </div>
              <br />
              <p class="rem2">ตัวอย่างเช่น ข้อมูล (Data) ที่ได้จากการรวบรวมคะแนนสอบกลางภาค ปลายภาค คะแนนการส่งงาน ระหว่างภาคเรียน และนำประมวลผลการตัดเกรดตามเงิ่อนไขที่อาจารย์ผู้สอนในแต่ละรายวิชากำหนด และสรุปผลเกรดที่ได้รับของนักศึกษา เป็นต้น</p>
               <br>
                <h4>•	กระบวนการประมวลผลขัอมูลให้เป็นสารสนเทศ</h4>
                <p class="rem2">1.	การรวบรวมข้อมูล (Capturing/gathering/collecting Data)  เป็นการเก็บรวบรวมข้อมูลที่ต้องการจากแหล่งต่างๆ โดยการใช้เครื่องมือต่างๆ โดยอาจมีการเก็บรวบรวมเป็นแฟ้มข้อมูล เช่น จากการอ่านข้อมูลจากรหัสแท่ง  การป้อนข้อมูลเข้าเครื่องคอมพิวเตอร์ และนำมาพิจารณาว่ามีรายการใดที่สามารถนำมาใช้ประโยชน์ได้ เช่น ข้อมูลการลงทะเบียนเรียนของนักเรียน  ข้อมูลคะแนนสอบ ข้อมูลการซื้อขายสินค้า </p>
                <p class="rem2">2.	การตรวจสอบข้อมูล (Verifying/checking Data) จะเป็นการตรวจสอบเนื้อหาของข้อมูลที่รวบรวมได้ ในด้าน ความถูกต้อง ความน่าเชื่อถือและความแม่นยำของเนื้อหา ความสอดคล้องของตาราง, ภาพประกอบ หรือแผนที่ กับเนื้อหา </p>
                <p class="rem2">3.	การจัดแยกประเภท/จัดหมวดหมู่ข้อมูล (Classifying Data) เมื่อผ่านการตรวจสอบความถูกต้อง สอดคล้องกัน ของเนื้อหาแล้ว นำข้อมูลต่างๆ เหล่านั้นมาแยกออกเป็นกอง หรือกลุ่ม ๆ ตามเรื่องราวที่ปรากฏในเนื้อหา เพื่อความสะดวกในการค้นหา  เช่น ข้อมูลในโรงเรียนมีการแบ่งเป็นแฟ้มประวัตินักเรียน และแฟ้มลงทะเบียน แฟ้มรายวิชาที่เปิดสอน เพื่อความสะดวกในการค้นหา</p>
                <p class="rem2">4.	การเรียงลำดับ/เรียบเรียงข้อมูล (Arranging/sorting Data) ให้เป็นไป ตามความเหมาะสมของเนื้อหาว่าจะเริ่มจากหัวข้อใด จากนั้นควรเป็นหัวข้ออะไร ควรมีการจัดเรียงข้อมูลตามลำดับ ตัวเลข หรือตัวอักษร หรือเพื่อให้เรียกใช้งานได้ง่ายประหยัดเวลา เช่น การจัดเรียงตามรหัสนักศึกษา หรือ ตามชื่อนามสกุลในแฟ้มข้อมูลนักศึกษา</p>
                <p class="rem2">5.	การคำนวณข้อมูล (Calculating Data) หากมีข้อมูลบางส่วนเกี่ยวกับตัวเลขจะต้องนำตัวเลขนั้นมาทำการวิเคราะห์หาค่าทางสถิติที่เกี่ยวข้อง หรือ ทำการคำนวณให้ได้ผลลัพธ์ออกเสียก่อน เช่น การคำนวณเกรดเฉลี่ยของนักศึกษาแต่ละคน</p>
                <p class="rem2">6.	การสรุปผล (Summarizing/conclusion Data) เป็นการสรุปเนื้อหาในแต่ละหัวข้อ ในรูปแบบรายงาน หรือ กราฟ เพื่อนำไปใช้ประโยชน์ ข้อมูลที่สรุปได้นี้อาจสื่อความหมายได้ดีกว่า เช่นสถิติจำนวนนักเรียนแยกตามชั้นเรียนแต่ละชั้น  จำนวนนักศึกษาที่ได้รับในแต่ละเกรด </p>
                <p class="rem2">7.	การจัดเก็บ หรือบันทึกข้อมูล (Storing Data) เป็นการดูแลรักษาข้อมูลโดยนำข้อมูลมาบันทึกเก็บไว้ในสื่อประเภทต่างๆ เพื่อให้ใช้งานต่อไปในอนาคตได้ เช่น ทำเป็นรายงาน หนังสือ บทความตีพิมพ์ในวารสาร หนังสือพิมพ์ แผ่นบันทึกข้อมูล หรือลงในฐานข้อมูลคอมพิวเตอร์ ฯลฯ</p>
                <p class="rem2">8.	จัดทำระบบการค้นคืน (Retrieving Data)  เพื่อความสะดวกในการค้นคืนสารสนเทศได้อย่างถูกต้อง แม่นยำ รวดเร็ว และตรงกับความต้อง </p>
                <p class="rem2">9.	การสำเนาข้อมูล (Reproducing Data) เพื่อป้องกันความเสียหายที่อาจเกิดขึ้นกับข้อมูล ทั้งจากสาเหตุทางกายภาพ และระบบการจัดเก็บข้อมูล นอกจากนี้ยังเป็นการเก็บรักษาไว้หรือนำไปแจกจ่ายในภายหลัง</p>
                <p class="rem2">10.	การเผยแพร่ หรือสื่อสาร หรือกระจายข้อมูล (Communicating/disseminating Data) เพื่อให้ผลลัพธ์ที่ได้ถึงยังผู้รับ หรือผู้ที่เกี่ยวข้อง ข้อมูลต้องกระจายหรือส่งต่อไปยังผู้ใช้งานที่ห่างไกลได้ง่าย การสื่อสารข้อมูลจึงเป็นเรื่องสำคัญและมีบทบาทที่สำคัญยิ่งที่จะทำให้การส่งข่าวสารไปยังผู้ใช้    ทำได้รวดเร็วและทันเวลา</p>
                <br>
                <h4>•	คุณลักษณะของสารสนเทศที่ดี</h4>
                <p class="rem2"> 1.	มีลักษณะเฉพาะเรื่อง (Subjectivity)</p>
                <p class="rem2"> 2.	มีความหมายที่สัมพันธ์กัน (Relevance)</p>
                <p class="rem2"> 3.	ได้ตามเวลาที่กำหนด (Timeliness)</p>
                <p class="rem2"> 4.	มีความถูกต้อง (Accuracy)</p>
                <p class="rem2"> 5.	มีรูปแบบการแสดงผลที่ถูกต้องกับการนำไปใช้ประโยชน์</p>
                <p class="rem2"> 6.	มีความสมบูรณ์ครบถ้วน (Completeness)</p>
                <p class="rem2"> 7.	ข้อมูลเข้าถึงได้ตลอดเวลา (Accessibility)</p>
                <p class="rem2"> 8.	มีความปลอดภัยในการเรียกใช้ (Secure)</p>
                <br>
                  <h4>•	การจัดการข้อมูลด้วยระบบแฟ้มข้อมูล (File System) และปัญหาในการจัดเก็บในรูปแบบแฟ้มข้อมูล</h4>
                <p class="rem2"> ในอดีตองค์กรส่วนใหญ่มีการจัดเก็บข้อมูลด้วยคอมพิวเตอร์ในลักษณะแฟ้มข้อมูล แต่เนื่องจากมีการพัฒนาระบบคอมพิวเตอร์ที่หลากหลายระบบจึงทำให้การจัดเก็บข้อมูลของแต่ละระบบเป็นอิสระต่อกัน ทำให้ข้อมูลของบุคคลเดียวกันถูกจัดเก็บไว้หลายแฟ้มข้อมูล เช่น ข้อมูลนักศึกษา อาจจัดเก็บอยู่ที่แฟ้มข้อมูลของฝ่ายทะเบียน ฝ่ายการเงิน ฝ่ายกองทุนกู้ยืม ฝ่ายงานกิจกรรม  เป็นต้น ถึงแม้การจัดเก็บข้อมูลแบบแฟ้มข้อมูลจะมีข้อดีคือ  การประมวลผลข้อมูลมีความรวดเร็ว การลงทุนในส่วนของเครื่องคอมพิวเตอร์และโปรแกรมประยุกต์ใช้งานไม่ยุ่งยาก เนื่องจากระบบแฟ้มส่วนใหญ่จะเป็นระบบขนาดเล็ก  แต่อย่างไรก็ตามการจัดเก็บข้อมูลในลักษณะแฟ้มนี้อาจมีปัญหาที่เกิดขึ้นได้ดังนี้ </p>
                <p class="rem5">1.	ความซ้ำซ้อนของข้อมูล (Data Redundancy) คือ การที่มีข้อมูลเดียวกันจัดเก็บมากกว่า 1 แห่ง ซึ่งอาจเกิดขึ้นได้เนื่องจากความยุ่งยากในการรวบรวมข้อมูลไว้ในที่เดียวกันของแต่ละหน่วยงานจึงมีการสร้างแฟ้มข้อมูลของตนเองตามโปรแกรมประยุกต์ใช้งาน ทำให้ข้อมูลเดียวกันจัดเก็บในหลายแฟ้มข้อมูล ก่อให้เกิดความซ้ำซ้อนของข้อมูลและขาดความเชื่อมั่นในระบบความปลอดภัยของแฟ้มข้อมูล เช่น ข้อมูลนักศึกษา อาจมีการจัดเก็บที่ฝ่ายทะเบียน ในขณะเดียวกันฝ่ายกองทุนกู้ยืมก็มีการจัดเก็บข้อมูลนักศึกษา ซึ่งจะเห็นได้ว่าข้อมูลนักศึกษามีการจัดเก็บซ้ำซ้อนไว้ในหลายหน่วยงานมีการแยกจัดเก็บ ทำให้การปรับปรุงข้อมูลมีความยุ่งยาก และสิ้นเปลืองเนื้อที่ในการจัดเก็บ</p>
                <p class="rem5">2.	ความไม่สอดคล้องกันของข้อมูล  (Data Inconsistency)  คือ ปัญหาของการที่ข้อมูลเดียวกันจัดเก็บไว้ในหลายๆ แห่ง ทำให้มีค่าไม่ตรงกัน ซึ่งอาจเกิดขึ้นจากความผิดพลาดของการป้อนข้อมูล เช่น ถ้านักศึกษาคนหนึ่งแจ้งเปลี่ยนแปลงเบอร์โทรศัพท์ที่ฝ่ายทะเบียน แต่ไม่ได้แจ้งให้ฝ่ายการเงิน ฝ่ายกองทุนกุ้ยืมทราบก็จะทำให้ข้อมูลของนักศึกษาไม่ตรงกัน</p>
                <p class="rem5">3.	ข้อมูลแยกอิสระต่อกันขาดการใช้ข้อมูลร่วมกัน (Data Isolation) คือ ข้อมูลในระบบแฟ้มของแต่ละระบบแยกเป็นอิสระต่อกันจะไม่มีการเชื่อมโยงข้อมูลของระบบต่างๆ เข้าด้วยกัน และในแต่ละระบบมีการออกแบและจัดรูปแบบข้อมูลที่แตกต่างกันออกไป เช่น ข้อมูลเงินเดือนบางระบบกำหนดให้มีการใช้จุดทศนิยม  บางระบบกำหนดให้เป็นเลขจำนวนเต็ม  ทำให้การเข้าถึงข้อมูลจากระบบอื่นๆ ทำได้ยาก </p>
                <p class="rem5">4.	ความไม่ปลอดภัยของข้อมูล (Poor Security) คือ การควบคุมการเข้าถึงข้อมูลของผู้ใช้ทำได้ยาก เช่น การกำหนดว่าผู้ใดมีสิทธิสามารถเข้าใช้งานระบบได้บ้าง และสามารถใช้ข้อมูลในส่วนใดได้บ้าง มากน้อยแค่ไหน เช่น สามารถเรียกดูข้อมูลได้ แต่ไม่สามารถทำการแก้ไขข้อมูลได้ เป็นต้น เนื่องจากแต่ละหน่วยงานมีอิสระในการจัดการข้อมูลของตนเอง</p>
                <p class="rem5">5.	ขาดความเป็นอันหนึ่งอันเดียวกันของข้อมูล (Lack of Data Integrity) คือ ค่าของข้อมูลที่เก็บควรมีรูปแบบเดียวกัน เช่น ข้อมูลชื่อนักศึกษา ไม่ควรมีตัวเลขปนเข้ามา และข้อมูลเงินเดือนไม่ควรมีค่าติดลบ การจัดการข้อมูลในแฟ้มข้อมูลให้มีความเป็นอันหนึ่งอันเดียวกันจึงทำได้ยาก  เนื่องจากการจัดเก็บข้อมูลของแต่ละระบบเป็นอิสระต่อกัน </p>
                <p class="rem5">6.	ข้อมูลมีความสัมพันธ์ลักษณะขึ้นต่อกันกับโปรแกรม ( Application/Data Dependence) คือ โครงสร้างของแฟ้มข้อมูลจะมีความสัมพันธ์กันกับโปรแกรมประยุกต์ที่สร้างขึ้น ซึ่งหากมีการเปลี่ยนแปลงรูปแบบของข้อมูล บางครั้งอาจต้องเปลี่ยนโปรแกรมด้วย ทำให้เสียค่าใช้จ่ายและใช้เวลามากขึ้น</p>
                <br>
                <h5 class="rem2">ประเภทของแฟ้มข้อมูล</h5>
                <p class="rem5">1. แฟ้มข้อมูลหลัก (Master File) เป็นแฟ้มข้อมูลที่บรรจุข้อมูลพื้นฐานที่จำเป็นสำหรับระบบงาน และเป็นข้อมูลหลักที่เก็บไว้ใช้ประโยชน์ เป็นข้อมูลเฉพาะเรื่องมีสภาพค่อนข้างคงที่ไม่เปลี่ยนแปลงหรือเปลี่ยนแปลงน้อย ตัวอย่าง เช่น แฟ้มข้อมูลหลักของนักศึกษาจะแสดงรายละเอียดของนักศึกษา ซึ่งมี ชื่อนามสกุล ที่อยู่ ผลการศึกษา แฟ้มข้อมูลหลักของลูกค้าในแต่ละระเบียนของแฟ้มข้อมูลนี้จะแสดงรายละเอียดของลูกค้า เช่น ชื่อสกุล ที่อยู่ หรือ ประเภทของลูกค้า ซึ่งการแก้ไขเปลี่ยนแปลงที่อยู่ขอลูกค้าอาจจะมีการแก้ไขนานๆ ที </p>
                <p class="rem5">2. แฟ้มข้อมูลรายการปรับปรุงหรือเปลี่ยนแปลง (Transaction File) เป็นแฟ้มข้อมูลที่เก็บข้อมูลรายการเคลื่อนไหว ซึ่งจะถูกรวบรวมเป็นแฟ้มข้อมูลรายการเปลี่ยนแปลงที่เกิดขึ้นในแต่ละระยะเวลา  แฟ้มข้อมูลรายการเปลี่ยนแปลงนี้จะนำไปประมวลผลและนำไปปรับปรุงรายการในแฟ้มข้อมูลหลัก ให้ได้ข้อมูลปัจจุบัน ตัวอย่างเช่น ข้อมูลการขายของซุปเปอร์มาเก็ต อาจมีแฟ้มหลักเก็บข้อมูลยอดขายประจำวัน และมีแฟ้มรายการเปลี่ยนแปลงไว้เก็บข้อมูลการขายที่เกิดขึ้น ข้อมูลการขายในแต่ละวันอาจมากกว่า 10,000 รายการ (transaction ) รายการเปลี่ยนแปลงเหล่านี้จะไม่มีผลกระทบต่อแฟ้มหลักในทันที แต่จะเก็บสะสมไว้จนถึงเวลาที่กำหนด อาจเป็นทุกสิ้นวัน หรือทุก 7 วัน จะนำมาประมวลผลครั้งหนึ่งเพื่อนำข้อมูลที่ได้ไปปรับปรุงแฟ้มหลักอีกทีหนึ่ง</p>
                <p class="rem5">3. แฟ้มข้อมูลรายงาน (report file) เป็นแฟ้มข้อมูลที่ถูกจัดเรียงระเบียบตามรูปแบบของรายงานที่ต้องการแล้วจัดเก็บไว้ในรูปของแฟ้มข้อมูล ตัวอย่าง เช่น แฟ้มข้อมูลรายงานควบคุมการปรับเปลี่ยนข้อมูลที่เกิดขึ้นในขณะปฏิบัติงานแต่ละวัน แฟ้มรายงานเป็นการนำเสนอสารสนเทศ เมื่อนำข้อมูลไปผ่านการประมวลผลแล้วจัดเก็บไว้ เพื่อที่จะนำมาใช้กับงานอื่นๆ หรือเสนอเป็นข้อมูลที่ช่วยในกานตัดสินใจสำหรับการดำเนินงานได้</p>
                <p class="rem5">4. แฟ้มข้อมูลชั่วคราว (Temporary File) เป็นแฟ้มข้อมูลที่ถูกสร้างขึ้นมาเพื่อใช้ในการทำงานที่จะไม่ทำให้เกิดผลกระทบต่อแฟ้มข้อมูลหลัก แต่เมื่อใดก็ตามที่ต้องการนำข้อมูลจากแฟ้มข้อมูลชั่วคราวไปปรับปรุงในแฟ้มขูอมูลหลัก สามารถทำได้โดยยืนยันการเปลี่ยนแปลง แต่ถ้าไม่ทำการยืนยันการเปลี่ยนแปลงของข้อมูล แฟ้มข้อมูลชั่วคราวจะถูกยกเลิก ทำให้ไม่มีผลกระทบต่อแฟ้มข้อมูลหลักแต่อย่างใด เช่น เปิดแฟ้มข้อมูลสินค้าเป็นแฟ้มข้อมูลหลักขึ้นมา ได้ทำการแก้ไขราคาขายสินค้าบางประเภท โดยสร้างแฟ้มข้อมูลชั่วคราวเพื่อใช้ในการจัดการข้อมูลที่ต้องการแก้ไข ถ้าแก้ไขข้อมูลเรียบร้อยแล้ว แต่ไม่มีการยืนยันที่จะจัดเก็บข้อมูลที่ทำการแก้ไขแล้วนั้น ข้อมูลที่อยู่ในแฟ้มข้อมูลชั่วคราวก็จะถูกทำลายไป โดยที่ไม่มีผลกระทบต่อแฟ้มข้อมูลหลัก</p>
                <p class="rem5">5. แฟ้มข้อมูลสำรอง (Backup File) เป็นการป้องกันความเสี่ยงที่จะเกิดกับข้อมูลเมื่อข้อมูลเหล่านั้นอาจเสียหายหรือสูญหาย เราสามารถนำข้อมูลที่เก็บไว้เป็นแฟ้มข้อมูลสำรองมาใช้แทนได้ การสำรองข้อมูล คือ การทำซ้ำข้อมูล ไฟล์ หรือโปรแกรมในสื่อเก็บข้อมูลชนิดอื่นๆ เพื่อนำกลับมาใช้ ซึ่งผู้ใช้มักจะจัดเก็บแฟ้มข้อมูลดังกล่าวในรูปแบบของแฟ้มข้อมูลสำรอง เช่น เจ้าหน้าที่งานทะเบียนจัดเก็บสำรองแฟ้มข้อมูลนักศึกษาในสื่อเก็บข้อมูลสำรองทุกปีการศึกษาเช่น แผ่นซีดี ฮาร์ดดิสก์สำหรับพกพา หากเครื่องคอมพิวเตอร์ที่ใช้จัดเก็บข้อมูลนักศึกษานั้นเสีย และข้อมูลนักศึกษาที่เก็บไว้ภายในเครื่องคอมพิวเตอร์นั้นได้สูญหาย  เจ้าหน้าที่สามารถนำแฟ้มข้อมูลนักศึกษาที่เก็บไว้เป็นแฟ้มข้อมูลสำรองมาใช้แทนได้ จึงไม่ทำให้การทำงานหยุดชะงัก เนื่องจากการสูญเสียข้อมูล และไม่ต้องเสียเวลาในการบันทึกข้อมูลอีกครั้ง</p>
                <br>
                <h5 class="rem2">ประเภทของแฟ้มข้อมูล</h5>
                <p class="rem5">ในยุคสารสนเทศหลายธุรกิจต้องอาศัยข้อมูลเป็นหลักในการบริหารจัดการกิจการจึงได้มีการนำเอาเทคโนโลยีมาช่วยจัดการข้อมูลเพื่อส่งเสริมการทำธุรกรรมด้านต่างๆ เข่น การซื้อขายแลกเปลี่ยนสินค้า  การบริการต่างๆ  การโฆษณาประชาสัมพันธ์ รวมถึงการทำธุรกรรมทางด้านการเงินเพื่อให้ผู้ใช้สามารถนำไปใช้ประกอบการตัดสินใจได้อย่างมีประสิทธิภาพ ตลอดจนการนำข้อมูลที่ต้องการออกมาใช้ให้ทันต่อเหตุการณ์ ซึ่งระบบฐานข้อมูลเป็นหนึ่งเทคโนโลยีที่ถูกนำมาใช้กันอย่างแพร่หลายในด้านการบริหารจัดการข้อมูลและสนับสนุนการพัฒนาระบบงานต่างๆ ที่ใช้คอมพิวเตอร์ ซึ่งเราสามารถเห็นได้จากระบบสารสนเทศต่างๆ ในชีวิตประจำวันของเรา เช่น ระบบฐานข้อมูลสำหรับการซื้อขายสินค้า  ระบบฐานข้อมูลสำหรับการยืมคืนหนังสือห้องสมุด  ระบบฐานข้อมูลสำหรับการลงทะเบียนเรียน  ระบบฐานข้อมูลการฝากถอนเงินธนาคาร เป็นต้น นอกจากนี้ยังนำมาใช้แก้ไขปัญหาการจัดเก็บข้อมูลในรูปแบบแฟ้มข้อมูลซึ่งกล่าวไว้ </p>
                <p class="rem5">ระบบฐานข้อมูลเป็นสิ่งที่จำเป็นและเกี่ยวข้องกับการใช้งานประจำวัน การตัดสินใจของผู้บริหารจะกระทำได้รวดเร็ว ถ้ามีข้อมูลที่ถูกต้องและเพียงพอ จึงมีการใช้คอมพิวเตอร์ช่วยประมวลผลเพื่อให้ได้สารสนเทศดังกล่าว แต่การประมวลผลด้วยคอมพิวเตอร์จำเป็นต้องมีหลักการและวิธีการที่ทำให้ระบบมีระเบียบแบบแผนที่ดี 
                <br><br>
                <h5 class="rem2">ฐานข้อมูล (Database) </h5>
                <p class="rem5">หมายถึง การจัดเก็บข้อมูลอย่างเป็นระบบ โดยนำกลุ่มของข้อมูลที่มีความสัมพันธ์กัน นำมาเก็บรวบรวมเข้าไว้ด้วยกันอย่างมีระบบในที่เดียวกัน โดยอาจถูกจัดเก็บไว้ในรูปแบบแฟ้มข้อมูลเดียวกัน หรือ แยกเก็บหลายๆ แฟ้ม โดยข้อมูลนั้นอาจจะเกี่ยวกับบุคคล สิ่งของสถานที่ หรือเหตุการณ์ใดๆ ก็ได้ที่เราสนใจศึกษา หรืออาจได้มาจากการสังเกต การนับหรือการวัดก็เป็นได้ รวมทั้งข้อมูลที่เป็นตัวเลข  ข้อความ  และรูปภาพต่างๆ ซึ่งข้อมูลที่ประกอบกันเป็นฐานข้อมูลนั้นต้องตรงตามวัตถุประสงค์การใช้งานขององค์กรและสามารถนำมาใช้ประโยชน์และสนับสนุนการดำเนินงานขององค์กรในอนาคตได้  เช่น สถาบันการศึกษาสร้างระบบฐานข้อมูลสำหรับจัดเก็บข้อมูลเกี่ยวกับนักศึกษา ข้อมูลอาจารย์ ข้อมูลรายวิชา และ ข้อมูลการลงทะเบียนเรียนของนักศึกษา เพื่อสนับสนุนการใช้โปรแกรมการลงทะเบียนออนไลน์ของมหาวิทยาลัย ระบบการจัดห้องสอบ เป็นต้น ส่วนในองค์การธุรกิจนำมาจัดเก็บข้อมูลเกี่ยวกับการซื้อขายสินค้าของลูกค้า ข้อมูลสินค้า ข้อมูลพนักงาน ข้อมูลลูกค้า สำหรับระบบการซื้อขายสินค้าออนไลน์  เป็นต้น </p>
                <h6 class="rem2">•	โครงสร้างฐานข้อมูล สามารถจัดเรียงเป็นลำดับจากขนาดเล็กไปขนาดใหญ่ได้ดังนี้</h6>
                <p class="rem5">1.	บิต  (Bit) คือ หน่วยของข้อมูลที่มีขนาดเล็กที่สุด ประกอบด้วยเลขฐานสอง ซึ่งมีค่าได้เพียง 0 หรือ 1</p>
                <p class="rem5">2.	ไบต์ (Bite) หรือ ตัวอักษร (Character) หมายถึง กลุ่มของบิตสามารถแทนค่าตัวอักษรได้ในชุดอักขระ ASCII  การแทนตัวอักษรแต่ละตัวในคอมพิวเตอร์ใช้เลขฐานสองจำนวน 8 บิต (1 ไบต์) เช่น  
01000001 แทนอักษรตัว A  ในปัจจุบันมีชุดอักขระที่ใช้เลขฐานสอง 16 บิตแทนค่าตัวอักษร 1 ตัว
</p>
                <p class="rem7">• รหัสประจำตัวนักศึกษา : 2314511111</p>
                <p class="rem7">• ชื่อนักศึกษา :  สายสมร    </p>
                <p class="rem7">• ที่อยู่ :  1/10  ต.สันป่าข่อย   อ.เมือง จ.เชียงใหม่ 50000</p>

                <p class="rem5">3.	เขตข้อมูล หรือ ฟิลด์ (Field) หมายถึงหน่วยของข้อมูลที่ประกอบขึ้นจากตัวอักษรตั้งแต่หนึ่งตัวขึ้นไปมารวมกันแล้วได้ความหมายของสิ่งใดสิ่งหนึ่ง เช่น รหัสประจำตัวนักศึกษา  ชื่อนักศึกษา ที่อยู่ เป็นต้น</p>
                <p class="rem5">4.	ระเบียนข้อมูล (Record) หมายถึงกลุ่มของเขตข้อมูลที่มีความเกี่ยวข้องกันมารวมกัน เพื่อเกิดเป็นข้อมูลเรื่องใดเรื่องหนึ่ง ระเบียนข้อมูลประกอบด้วยเขตข้อมูลตั้งแต่หนึ่งเขตข้อมูลขึ้นไปเช่น ระเบียนข้อมูลนักศึกษา 1  คน จะประกอบด้วยเขตข้อมูล 3 เขตข้อมูล</p>
                <p class="rem5">5.	แฟ้มข้อมูล (File) หมายถึงกลุ่มของระเบียนโครงสร้างเรื่องเดียวกันมารวมกัน เช่น  แฟ้มข้อมูลนักศึกษา</p>
                <p class="rem5">6.	ฐานข้อมูล (Database)  คือ กลุ่มของแฟ้มข้อมูลที่มีความสัมพันธ์กันนำมาเก็บไว้ที่เดียวกัน โดยใช้หลักการเพื่อไม่ให้ข้อมูลเกิดความซ้ำซ้อนในการจัดเก็บ เช่น ฐานข้อมูลของนักเรียนโรงเรียนน้ำแพร่วิทยาคม ประกอบด้วย แฟ้มข้อมูลนักศึกษา แฟ้มข้อมูลรายวิชาที่เปิดสอน  แฟ้มข้อมูลอาจารย์ แฟ้มข้อมูลการลงทะเบียน </p>

              <!-- ---------------------------------->
              <br />
              <br />
              <br />
              <br />
              <div class="container">
                <div class="row">
                  <div class="col-auto mr-auto">
                    <router-link to="/lesson7_1" title="Lesson7_1 Page">
                      <div class="btn-wrapper">
                        <base-button
                          tag="a"
                          target="_blank"
                          rel="noopener noreferrer"
                          class="mb-3 mb-sm-0"
                          outline
                          type="info"
                          icon="fa fa-chevron-left"
                        >Previous</base-button>
                      </div>
                    </router-link>
                  </div>
                  <div class="col-auto">
                    <router-link to="/lesson8_2" title="Lesson8_2 Page">
                      <div class="btn-wrapper">
                        <base-button
                          tag="a"
                          target="_blank"
                          rel="noopener noreferrer"
                          class="mb-3 mb-sm-0"
                          outline
                          type="info"
                        >
                          Next
                          <i class="fa fa-chevron-right" aria-hidden="true"></i>
                        </base-button>
                      </div>
                    </router-link>
                  </div>
                </div>
              </div>
              <div class="text-center mt-5">Page 1/3</div>
            </div>
          </div>
        </div>
      </section>

      <!-- Author -->
      <hr />
      <div class="col-lg-center">
        <div class="pt-4 text-center">
          <h5 class="title">
            <span class="d-block mb-1">Author | Dr. Wanvimol Nadee</span>
            <small class="h6 text-black">Lecturer in Information Technology Division at Maejo University</small>
          </h5>
        </div>
      </div>
      <hr />
    </div>
  </div>
</template>

<script>
import { BCarousel } from "bootstrap-vue/esm/components/carousel/carousel";
import { BCarouselSlide } from "bootstrap-vue/esm/components/carousel/carousel-slide";
export default {
  name: "home",
  components: {
    BCarousel,
    BCarouselSlide,
  },
};
</script>
