<template>
  <div>
    <div class="position-relative">
      <section class="section-shaped my-0">
        <div class="shape shape-style-1 shape-default">
          <span></span>
          <span></span>
          <span></span>
          <span></span>
          <span></span>
          <span></span>
          <span></span>
          <span></span>
          <span></span>
        </div>

        <div class="container shape-container d-flex">
          <div class="col px-0"></div>
        </div>
      </section>

      <section class="section section-shaped my-0 overflow-hidden">
        <div class="container pt-lg pb-80">
          <div class="row justify-content-center">
            <div class="fontx col-lg-10">
              <!-- -------------------------------- -->
              <p class="rem2 font-weight-bold">การเปิดเผยประวัติส่วนตัว</p>
              <p class="rem5 text-justify">
                ถือเป็นข้อมูลส่วนตัวที่เราคิดว่าการโพสต์ข้อความหรือรูปภาพให้
                Friend เท่านั้นที่เห็น แต่บางครั้งก็ลืมไปว่าค่าดีฟอลต์ของ
                faceBook นั้นก็อนุญาตให้ Firend of Friend สามารถเห็นสิ่งที่
                Friend ได้ทำการ Like หรือ Share ได้เหมือนกัน
                ซึ่งสุดท้ายเราก็ไม่รู้ว่าข้อความหรือรูปภาพของเรานั้นกระจายออกไปถึงไหน
                ตัวอย่างเช่น
                ภาพของคนในม็อบกลุ่มหนึ่งกลับถูกนำไปแชร์ในม็อบอีกกลุ่มหนึ่งอย่างแพร่หลายแถมยังมีการเอาไปว่าต่อ
                ๆ กันอย่างเสียๆ หายๆ ด้วย นอกจากนี้บริษัทหรือมหาวิทยาลัยหลาย ๆ
                แห่งยังมีการตรวจสอบประวัติว่าที่พนักงานใหม่หรือว่าที่นักศึกษาผ่านประวัติการโพสต์ใน
                FaceBook ก็ได้
                ซึ่งบางครั้งเราอาจจะโพสต์ข้อความทัศนคติที่ไม่ดีเอาไว้ในอดีตและมันก็ยังถูกเก็บเอาไว้ในนั้นอีกนานแสนนาน
                ซึ่งบริษัทหรือมหาวิทยาลัยสามารถเข้าไปสืบประวัติจากสิ่งเราได้เคยโพสต์เอาไว้นั่นเอง
              </p>
              <p class="rem5 font-weight-bold">
                ต่อมาคือสิ่งที่เราต้องรู้ เพื่อที่จะใช้สื่อสังคมออนไลน์
                ได้อย่างปลอดภัย มี 10 ข้อดังนี้
              </p>
              <p class="rem5 text-justify">
                1. คิดให้รอบคอบก่อนโพสต์ข้อมูลใดๆ
                เพราะอย่าลืมว่าข้อมูลเหล่านี้จะเปิดเผยให้ทุกคนสามารถเข้าถึงได้ง่าย
                โดยเฉพาะอย่างยิ่งการโพสต์ข้อมูลที่สุ่มเสี่ยงก็อาจจะส่งผลร้ายต่อตัวเราเองก็เป็นได้
              </p>
              <p class="rem5 text-justify">
                2. ใช้ความระมัดระวังในการคลิกลิงก์ต่างๆ
                ที่มากับการแชร์หรือข้อความ หลีกเลี่ยงลิงก์แปลกปลอม
                หรือมาจากคนที่ไม่รู้จัก
                หรือแม้แต่เพื่อนซึ่งใช้ภาษาในการสื่อสารที่ดูแปลกไปจากปกติ
                เพราะอาจเป็นลิงก์ที่นำไปสู่ไวรัสหรือช่องทางขโมยข้อมูลของเหล่าแฮกเกอร์
              </p>
              <p class="rem5 text-justify">
                3. พิมพ์ที่อยู่ URL ของเว็บไซด์โซเชียลเน็ตเวิร์กนั้นๆ โดยตรง
                โดยบนเบราว์เซอร์ให้หลีกเลี่ยงการเข้าเครือข่ายทางสังคมผ่านทางคลิกลิงก์จากผลแสดงการค้นหา
                หรือจากอีเมล เพราะอาจเป็น URL ปลอมที่นำเราไปยังเว็บไซต์ปลอม
                เพื่อหลอกเอาบัญชีผู้ใช้และ Password ได้ เช่น www.facebook.com
                อาจมี URL หลอกเป็น www.faeebook.com เป็นต้น
              </p>
              <p class="rem5 text-justify">
                4. คัดกรองคนที่ขอเป็นเพื่อน
                หรือขอเชื่อมโยงกับเครือข่ายสังคมออนไลน์ของเรา
                หลีกเลี่ยงการตอบรับคนที่ไม่รู้จักกันมาก่อน
                เพราะผู้ไม่หวังดีอาจแฝงมากับคนที่ขอเข้ามาเป็นเพื่อนเรา
                และหากพบคนที่เป็นเพื่อนซึ่งเราไม่รู้จักและน่าสงสัยก็ควรลบออกไป
              </p>
              <p class="rem5 text-justify">
                5. ตั้งค่าความเป็นส่วนตัว
                ผู้ให้บริการแต่ละรายจะกำหนดการตั้งค่าส่วนตัวไว้เพื่อไม่ให้ข้อมูล
                หรือสิ่งที่เราทำ หลุดออกไปยังคนที่ไม่พึงประสงค์ ดังนั้น
                เราควรตั้งค่าให้เพื่อนเท่านั้นที่เห็นกิจกรรมของเรา
                และหลีกเลี่ยงการตั้งค่าสิ่งที่เราทำให้เป็นสาธารณะ
                หรือคนทั่วไปเห็นได้
              </p>
              <p class="rem5 text-justify">
                6. ไม่แสดงข้อมูลส่วนตัวที่เป็นความลับ เช่น บัตรประจำตัวประชาชน
                บัตรเครดิตลงในโซเชียลเน็ตเวิร์ก ไม่ว่าจะอยู่ในรูปแบบข้อความ
                หรือรูปภาพ
                เพราะแฮกเกอร์และผู้ไม่หวังดีสามารถแฝงตัวมากับกลุ่มเพื่อนที่เราอนุญาตให้เข้าชมได้
              </p>
              <p class="rem5 text-justify">
                7. เปิดใช้งาน Do Not Track
                เพื่อป้องกันการติดตามและการเก็บข้อมูลของผู้ให้บริการ
                ซึ่งอาจรวมไปถึงผู้ไม่หวังดีที่ลักลอบเข้ามาขโมยข้อมูลด้วย
                ซึ่งปัจจุบันมีเว็บเบราว์เซอร์ที่เปิดใช้งาน Do Not Track ได้แล้ว
                เช่น Internet Explorer 10
              </p>
              <p class="rem5 text-justify">
                8. ใช้วิจารณญาณอย่างสูงในการรับข่าวสาร
                และอย่าปักใจเชื่อข้อมูลที่เผยแพร่เข้ามาในทันที
                รวมทั้งการกล่าวอ้างถึงแหล่งที่มาของข้อมูลนั้นๆ
                เพราะอาจมีการสวมรอย หรือสมอ้างจากผู้ไม่หวังดีเพื่อสร้างข่าว
                หรือสร้างความเสื่อมเสียต่อแหล่งที่มานั้นได้
              </p>
              <p class="rem5 text-justify">
                9. ดูแลและควบคุมการใช้งานของบุตรหลานอย่างใกล้ชิด
                สอนให้เด็กรู้จักวิเคราะห์ข้อมูล และรู้จักเล่นอย่างถูกวิธี
                เพราะความรู้ในโซเชียลเน็ตเวิร์กก็มีอยู่มากมาย
                และปัจจุบันครูอาจารย์ก็ทันสมัยจนแจ้งเรื่องต่างๆ
                แก่ลูกศิษย์ผ่านโซเชียลเน็ตเวิร์ก เช่น Facebook หรือ Twitter
                กันแล้ว นอกจากนี้
                อาจหาเครื่องมือในการควบคุมการใช้งานของบุตรหลายได้ เช่น โปรแกรม
                Windows Live Family Safety
                ซึ่งเป็นโปรแกรมที่ไมโครซอฟต์เปิดให้ใช้งานได้ฟรีๆ
                นอกจากจะใช้ควบคุมการเข้าถึงเว็บไซต์ที่มีเนื้อหาไม่เหมาะสมได้แล้ว
                ยังสามารถกำหนดช่วงเวลาในการใช้คอมพิวเตอร์
                และป้องกันการใช้โปรแกรม
                หรือเล่นเกมที่ไม่เหมาะสมหรือไม่ได้รับอนุญาตได้อีกด้วย
              </p>
              <p class="rem5 text-justify">
                10. ตระหนักว่ามันเป็นสังคมเสรี
                แม้ว่าทุกคนจะมีสิทธิ์ในการแสดงความคิดเห็น
                แต่ทุกคำพูดและการกระทำที่ไม่เหมาะสมก็สามารถเป็นเหตุในการฟ้องร้องได้
                และศาลก็อาจจะรับฟังคำร้องด้วย
              </p>

              <p class="rem5 text-justify">
                การหลบหลีกภัย Social Network คงไม่ใช่การเลิกใช้งานไปเลย
                เพราะยังมีประโยชน์ดีๆ อีกมากมายในเครือข่ายสังคมออนไลน์นี้
                แต่ถ้ารู้จักใช้อย่างระมัดระวังก็จะช่วยให้เราสามารถสนุกสนานกับสังคมออนไลน์อย่างมั่นใจมากขึ้น
                อย่างไรก็ตาม
                แนวทางปฏิบัติเหล่านี้ก็อาจมีขั้นตอนที่แตกต่างกันไปตามแต่ละ
                Social Network ที่เราสามารถศึกษาได้จากคำแนะนำบนเว็บไซต์เหล่านั้น
              </p>
              <br />
              <div class="text-center font-italic col">
                <img src="/img/lesson6/25.png" width="60%" />
              </div>
              <br /><br />

              <h4>แนวทางการใช้โซเชียลมีเดียที่เหมาะสม</h4>
              <h5 class="rem2">1.ไม่โพสต์เนื้อหาที่พาตัวเองเดือดร้อน</h5>
              <p class="rem5 text-justify">
                คนส่วนใหญ่มักจะคิดว่าตัวเองมีภูมิคุ้มกันเพียงพอ
                หรือระมัดระวังเพียงพอและไม่น่าจะได้รับผลกระทบ
                แต่ความจริงแล้วอาจไม่เป็นอย่างที่คิด เช่น
                การเขียนวิพากษ์วิจารณ์คนอื่นด้วยภาษาไม่สุภาพ
                โดยไม่ตระหนักว่าสิ่งที่เขียนย้อนกลับมาทำร้ายตัวเองภายหลัง
              </p>
              <h5 class="rem2">2.มีศีลธรรมและจริยธรรมในการโพสต์</h5>
              <p class="rem5 text-justify">
                การใช้โซเชียลมีเดียต้องอยู่ภายใต้กรอบศีลธรรมอันดีงาม
                และควรต้องคำนึงถึงผลกระทบต่อสังคม การนำเสนอเรื่องบางเรื่อง เช่น
                ศาสนา การเมือง เพศ เชื้อชาติ ฯลฯ
                จำเป็นต้องคำนึงถึงความดีงามให้มาก เพราะเป็นเรื่องที่ละเอียดอ่อน
                ต้องมีความเที่ยงตรง ปราศจากอคติในการโพสต์เนื้อหาเหล่านั้น
              </p>
              <h5 class="rem2">3.ปรุงแต่งแต่พอดี</h5>
              <p class="rem5 text-justify">
                บางคนมีทักษะพิเศษในการใช้สื่อ เช่น วิธีการตัดต่อภาพ
                ตัดคลิปวีดีโอ ตัดเสียง
                เมื่อจำเป็นต้องทำก็ควรต้องคำนึงถึงควาเหมาะสม
                ไม่ปรุงแต่งเนื้อหามากเกินไปจนทำให้คนทีเห็นเกิดความเข้าใจผิด เช่น
                ไม่ตัดต่อหน้าบุคคลอื่นหากไม่ได้รับอนุญาตก่อน
              </p>

              <h5 class="rem2">4.เข้าใจเนื้อหาแบบไม่ตัดสินตัวคนโพสต์</h5>
              <p class="rem5 text-justify">
                เข้าใจว่าตัวตนของเราในบางครั้งอาจไม่ใช่ตัวตนในโลกโซเชียล
                แต่ต้องสวมบทบาทนั้น
                เพื่อสะท้อนมุมมองที่เป็นประโยชน์หรือเพื่อความบันเทิง เช่น
                วัยรุ่นนิยมเขียนนิยายชายรักชาย
                ไม่ได้หมายความว่าเขาจะเป็นคนเบี่ยงเบนทางเพศตามที่เขาเขียน
                แต่เป็นเพียงแค่จินตนาการของเขาเท่านั้น
              </p>

              <h5 class="rem2">5.แชร์อย่างมีสติ</h5>
              <p class="rem5">
                เช่น
                แชร์ผลิตภัณฑ์อาหารเสริมที่มีสรรพคุณรักษาโรคเรื้อรังโดยที่ไม่ตรวจสอบข้อเท็จจริงว่า
                ไม่มีอาหารเสริมชนิดใดที่สามารถรักษาโรคเรื้อรังได้
                ทั้งนี้ต้องรู้จักตั้งคำถามในสิ่งที่สื่อไม่ได้แจ้งให้ทราบ
              </p>

              <h5 class="rem2">6.สร้างความนิยมอย่างสร้างสรรค์</h5>
              <p class="rem5 text-justify">
                ไม่จำเป็นต้องทำให้คนนิยมชมชอบด้วยคลิป วิดีโอโป๊เปลือย
                หรือท่าเต้นไม่เหมาะสม
                หากจุดประสงค์ของคุณคืออยากสร้างชื่อเสียงให้ตัวเองเพื่ออะไรบางอย่าง
                ควรสร้างความนิยมในทางที่ถูกต้อง เช่น โชว์ความสามารถพิเศษ
                เล่นดนตรี ร้องเพลง รีวิวอย่างตรงไปตรงมา ไม่โกหก
                ตั้งอยู่บนความจริงใจ
              </p>

              <h5 class="rem2">7.สนุกกับเนื้อหา ไม่จับผิดเกินไป</h5>
              <p class="rem5">
                การรู้เท่าทันตัวเองไม่ได้หมายความว่า
                ต้องคอยระวังหรือจับผิดตลอดเวลา จนจะโพสต์จะแชร์อะไรไม่ได้เลย
                เพียงแต่ต้องใช้โซเชียลอย่างมีสติ คือ
                การไม่แชร์ทันทีโดยที่ยังไม่ได้อ่านรายละเอียดและไตร่ตรองอย่างสมเหตุสมผล
              </p>

              <br />

              <h4>คุณธรรม จริยธรรมในการใช้เทคโนโลยีสารสนเทศและอินเทอร์เน็ต</h4>
              <h5 class="rem2">
                จริยธรรมในการใช้เทคโนโลยีสารสนเทศและอินเทอร์เน็ต
              </h5>
              <p class="rem5 text-justify">
                ผู้ใช้อินเทอร์เน็ตมีเป็นจำนวนมากและเพิ่มขึ้นทุกวัน
                การใช้งานระบบเครือข่ายที่ออนไลน์และส่งข่าวสารถึงกันย่อมมีผู้ที่มีความประพฤติไม่ดีปะปนและสร้างปัญหาให้กับผู้ใช้อื่นอยู่เสมอ
                หลายเครือข่ายจึงได้ออกกฏเกณฑ์การใช้งานภายในเครือข่าย
                เพื่อให้สมาชิกในเครือข่ายของตนยึดถือ
                ปฏิบัติตามกฏเกณฑ์และได้รับประโยชน์สูงสุด ดังนั้น
                ผู้ใช้อินเทอร์เน็ตทุกคนที่เป็นสมาชิกเครือข่ายจะต้องเข้าใจกฏเกณฑ์ข้อบังคับของ
                เครือข่ายนั้นมีความรับผิดชอบต่อตนเองและผู้ร่วมใช้บริการคนอื่นและจะต้องรับผิดชอบต่อการกระทำของตนเองที่เข้าไปขอใช้บริการต่างๆ
                บนเครือข่ายบนระบบคอมพิวเตอร์
                เครือข่ายคอมพิวเตอร์ที่ผู้ใช้อินเทอร์เน็ตเรียกเข้ามิได้เป็นเพียงเครือข่ายขององค์กรที่ผู้ใช้สังกัด
                แต่เป็นการเชื่อมโยงของเครือข่ายต่างๆ
                เข้าหากันหลายพันหลายหมื่นเครือข่ายมีข้อมูลข่าวสารอยู่ระหว่างเครือข่ายเป็นจำนวนมาก
                การส่งข่าวสารในเครือข่ายนั้นอาจทำให้ข่าวสารกระจายเดินทางไปยังเครือข่ายอื่น
                ๆ
                อีกเป็นจำนวนมากหรือแม้แต่การส่งไปรษณีย์อิเล็กทรอนิกส์ฉบับหนึ่งก็อาจจะต้องเดินทางผ่านเครือข่ายอีกหลายเครือข่ายกว่าจะถึงปลายทาง
                ดังนั้นผู้ใช้บริการต้องให้ความสำคัญและตระหนักถึงปัญหาปริมาณข้อมูลข่าวสารที่วิ่งอยู่บนเครือข่ายการใช้งานอย่างสร้างสรรค์และเกิดประโยชน์จะทำให้สังคมอินเทอร์เน็ตน่าใช้และเป็นประโยชน์ร่วมกันอย่างดี
                กิจกรรมบางอย่างที่ไม่ควรปฏิบัติจะต้องหลีกเลี่ยงเช่นการส่งกระจายข่าวไปเป็นจำนวนมากบนเครือข่าย
                การส่งเอกสารจดหมายลูกโซ่ ฯลฯ
                สิ่งเหล่านี้จะเป็นผลเสียโดยรวมต่อผู้ใช้และไม่เกิดประโยชน์ใด ๆ
                ต่อสังคมอินเทอร์เน็ต
              </p>
              <p class="rem5">
                เพื่อให้การอยู่ร่วมกันในสังคมอินเทอร์เน็ตสงบสุข Arlene H.Rinaldi
                แห่งมหาวิทยาลัย ฟอร์ริดาแอตแลนติก
                จึงรวบรวมกฎกติกามารยาทและวางเป็นจรรยาบรรณอินเทอร์เน็ตหรือที่เรียกว่า
                Netiquette ไว้ดังนี้
              </p>

              <h5 class="rem2">
                จรรยาบรรณที่ผู้ใช้อินเทอร์เน็ตยึดถือไว้เป็นบทการปฏิบัติเพื่อเตือนความจำ
              </h5>
              <p class="rem5">
                1. ต้องไม่ใช้คอมพิวเตอร์ทำร้ายหรือละเมิดผู้อื่น
              </p>
              <p class="rem5">2. ต้องไม่รบกวนการทำงานของผู้อื่น</p>
              <p class="rem5">
                3. ต้องไม่สอดแนมหรือแก้ไขเปิดดูในแฟ้มของผู้อื่น
              </p>
              <p class="rem5">
                4. ต้องไม่ใช้คอมพิวเตอร์เพื่อการโจรกรรมข้อมูลข่าวสาร
              </p>
              <p class="rem5">
                5. ต้องไม่ใช้คอมพิวเตอร์สร้างหลักฐานที่เป็นเท็จ
              </p>
              <p class="rem5">6. ต้องไม่คัดลอกโปรแกรมผู้อื่นที่มีลิขสิทธิ์</p>
              <p class="rem5">
                7. ต้องไม่ละเมิดการใช้ทรัพยากรคอมพิวเตอร์โดยที่ตนเองไม่มีสิทธิ์
              </p>
              <p class="rem5">8. ต้องไม่นำเอาผลงานของผู้อื่นมาเป็นของตน</p>
              <p class="rem5">
                9. ต้องคำนึงถึงสิ่งที่จะเกิดขึ้นกับสังคมอันติดตามมาจากการกระทำ
              </p>
              <p class="rem5">
                10.ต้องใช้คอมพิวเตอร์โดยเคารพกฎระเบียบ กติกามารยาท
              </p>
              <br />
              <p class="rem5">
                จรรยาบรรณเป็นสิ่งที่ทำให้สังคมอินเทอร์เน็ตเป็นระเบียบความรับผิดชอบต่อสังคมเป็นเรื่องที่จะต้องปลูกฝังกฎเกณฑ์ของแต่ละเครือข่ายจึงต้องมีการวางระเบียบเพื่อให้การดำเนินงานเป็นไปอย่างมีระบบและเอื้อประโยชน์ซึ่งกันและกัน
                บางเครือข่ายมีบทลงโทษและจรรยาบรรณที่ชัดเจน
                เพื่อช่วยให้สังคมสงบสุขและหากการละเมิดรุนแรงกฎหมายก็จะเข้ามามีบทบาทได้เช่นกัน
              </p>
              <p class="rem5 text-justify">
                กฎหมายและศีลธรรม (Motal)
                เป็นกฏเกณฑ์ที่เป็นลายลักษณ์อักษรของสังคมมาช้านานเราพอเข้าใจได้ง่าย
                ๆ ว่า
                รัฐเป็นผู้ตรากฏหมายขึ้นเพื่อใช้บังคับพลเมืองในอาณาเขตของรัฐ
                ขณะศีลธรรมเป็นข้อบัญญัติทางศาสนาซึ่งเป็นหลักความเชื่อของประชาชน
                จริยธรรม (Ethics) เป็นเรื่องของการกำหนดความถูกต้องดีงาม
                สิ่งที่ไม่ควรทำ มีหลักปฏิบัติในระดับที่สูงกว่ามารยาทในสังคม เช่น
                คนที่ไม่ยอมเข้าแถวเพื่อขอรับบริการตามสิทธิ์ก่อนหลังอาจถือว่าไม่มีมารยาทหรือพนักงานคอมพิวเตอร์คนหนึ่งเอาข้อมูลทางการเงินของลูกค้าที่เขาจะต้องเห็นตามหน้าที่การงานไปหาผลประโยชน์แก่ตนเอง
                เช่น ขายรายชื่อนั้นให้ธุรกิจอื่น
                หรือบอกให้แก่คู่สมรสซึ่งเป็นพนักงานขายตรงไปเสนอขายสินค้า
                การกระทำเช่นนี้ถือว่าไม่ถูกต้อง ไม่มีจริยธรรม จริงอยู่
                แม้ว่าบริษัทที่พนักงานผู้นั้นทำงานอยู่จะไม่เสียหาย
                แต่การนำเอาของบริษัทไปใช้เพื่อประโยชน์ส่วนตัวก็เป็นสิ่งที่ไม่อาจทำได้อย่างเปิดเผย
                หรือพนักงานขายสินค้าของทางบริการหนึ่งซึ่งลาออกจากบริษัทเพื่อไปทำงานกับบริษัทคู่แข่งแล้วใช้ประโยชน์จากความรู้ในเรื่องข้อมูลราคาหรือความลับทางการค้าของบริษัทแรกไปให้บริษัทหลัง
                ก็อาจเรียกได้ว่าพนักงานคนนั้นไม่มีจริยธรรม
                เมื่อสังคมสลับซับซ้อนขึ้น มีการแบ่งหน้าที่กันออกเป็นหน้าที่ต่าง
                ๆ จึงมีข้อกำหนดที่เรียกว่า “จรรยาวิชาชีพ” (Code of Conduct) ขึ้น
                เพื่อใช้เป็นหลักปฏิบัติของคนในอาชีพนั้น ๆ เราคงเคยได้ยิน
                จรรยาบรรณของแพทย์ ที่จะไม่เปิดเผยเรื่องราวส่วนตัวของคนไข้
                จรรยาบรรณของนักหนังสือพิมพ์ที่รับเงินทองสิ่งตอบแทนเพื่อเสนอข่าวหรือไม่เสนอข่าวไม่เปิดเผยแหล่งข่าวถ้าแหล่งข่าวไม่ต้องการจรรยาบรรณวิชาชีพของสถาปนิกหรือวิศวกรผู้ออกแบบที่ต้องไม่รับผลประโยชน์ใด
                ๆ จากผู้ขายอุปกรณ์ที่ใช้ในงานที่เขาออกแบบ
                ซึ่งขายให้กับผู้ว่าจ้างงานชิ้นนั้นเพราะเขาได้รับปลตอบแทนจากผู้ว่าจ้างแล้ว
                จรรยาบรรณของวิชาชีพใด ก็มักกำหนดขึ้นโดยสมาคมวิชาชีพนั้น
                โดยมีข้อกำหนด บทลงโทษที่นอกเหนือไปจากกฏหมายบ้านเมือง เช่น
                เพิกถอนสมาชิกภาพ เพิกถอนหรือพักใบประกอบวิชาชีพ
                และอาจมีกฏหมายรองรับอีกด้วย อาชีพนักคอมพิวเตอร์
                เป็นอาชีพใหม่ในสังคมสารสนเทศ การใช้คอมพิวเตอร์และระบบสารสนเทศ
                ก็เป็นสิ่งใหม่ที่มีศีลธรรม จริยธรรม
                และจรรยาบรรณเฉพาะของตนซึ่งบางครั้งก็แตกต่างจากจริยธรรมที่ยอมรับกันมาแต่ก่อน
                หลักพื้นฐานของจริยธรรมในสังคมสารสนเทศก็คือการเคารพผู้อื่น
                เคารพความเป็นส่วนตัว
                การเข้าถึงระบบคอมพิวเตอร์และข้อมูลก็จะเฉพาะสิทธิ์ที่ตนเองมีในส่วนที่เกี่ยวข้องกับงาน
              </p>

              <h5 class="rem2">
                ลินดา เฮอร์นดอน
                ได้กล่าวถึงบัญญัติสิบประการของการใช้คอมพิวเตอร์ไว้ดังนี้
              </h5>
              <p class="rem5">1. ไม่ใช้คอมพิวเตอร์ทำร้ายผู้อื่น</p>
              <p class="rem5">2. ไม่รบกวนจนงานคอมพิวเตอร์ของผู้อื่น</p>
              <p class="rem5">3. ไม่แอบดูแฟ้มข้อมูลของผู้อื่น</p>
              <p class="rem5">4. ไม่ใช้คอมพิวเตอร์เพื่อลักขโมย</p>
              <p class="rem5">5. ไม่ใช้คอมพิวเตอร์เพื่อเป็นพยานเท็จ</p>
              <p class="rem5">
                6. ไม่ใช้หรือทำสำเนาซอฟต์แวร์ที่ตนไม่ได้ซื้อสิทธิ์
              </p>
              <p class="rem5">
                7. ไม่ใช้คอมพิวเตอร์ของผู้อื่นโดยไม่มีอำนาจหน้าที่
              </p>
              <p class="rem5">
                8. ไม่ฉวยเอาทรัพย์ทางปัญญาของผู้อื่นมาเป็นของตน
              </p>
              <p class="rem5">9. คิดถึงผลต่อเนื่องทางสังคมของโปรแกรมที่เขียน</p>
              <p class="rem5">
                10. ใช้คอมพิวเตอร์ในทางที่แสดงถึงความใคร่ครวญและเคารพ
                จรรยาวิชาชีพ
              </p>

              <h4>
                สมาชิกสมาคมเครื่องจักรกลคอมพิวเตอร์ (Association of
                ComputerMachinery ACM Code of Conduct)
              </h4>
              <br />
              <h5 class="rem2">1. กฎข้อบังคับทางศีลธรรมทั่วไป</h5>
              <p class="rem5 text-justify">
                1. ทำประโยชน์ให้สังคมและความผาสุกของมนุษย์
                ข้อนี้เกี่ยวกับคุณภาพชีวิตของประชาชนทุกคนคุ้มครองหลักสิทธิมนุษยชน
                ขั้นพื้นฐาน เคารพความหลากหลายของวัฒนธรรมทั้งหมด
                ลดผลด้านลบของระบบคอมพิวเตอร์ที่มีต่อสุขภาพอนามัยและความปลอดภัยรับผิดชอบต่อสังคม
                และสิ่งแวดล้อม
              </p>
              <p class="rem5 text-justify">
                2. ไม่ทำอันตรายแก่ผู้อื่น อันตรายหมายรวมถึง
                การบาดเจ็บหรือผลต่อเนื่องด้านลบ เช่น
                การสูญเสียข้อมูลอันเป็นที่ไม่พึงปรารถนา
                ทรัพย์สินสูญหายหรือเสียหาย ผลกระทบต่อสิ่งแวดล้อมที่ไม่พึงปรารถนา
                หลักการข้อนี้ห้ามการใช้เทคโนโลยีสารสนเทศไปทำอันตรายต่อผู้ใช้สาธารณชน
                พนักงานและนายจ้างอันตรายนี้รวมถึงการจงใจทำลายหรือแก้ไขข้อมูลในแฟ้มข้อมูลและโปรแกรมที่ทำให้สูญเสีย
                หรือเสียเวลาและความพยายามของบุคลากรที่จำเป็นต้องใช้ทำลายไวรัสคอมพิวเตอร์ในสภาพแวดล้อมที่ทำงาน
                นักวิชาชีพคอมพิวเตอร์จะต้องรายงานสัญญาณอันตรายที่อาจก่อให้เกิดผลต่อความเสียหายของสังคมและบุคคล
                แม้ว่าหัวหน้างานจะไม่ลงมือแก้ไขหรือลดทอนอันตรายนั้น
                ก็อาจจำเป็นต้องแจ้งให้ผู้อื่นที่เกี่ยวข้องทราบโดยอาจอาศัยผู้ร่วมวิชาชีพเป็นผู้ให้คำปรึกษา
              </p>
              <p class="rem5">
                3. ซื่อสัตย์และไว้วางใจได้
                นักคอมพิวเตอร์ที่ซื่อสัตย์นอกจากจะไม่จงใจแอบอ้างระบบหรือการออกแบบที่หลอกลวงอันเป็นเท็จแล้ว
                ยังจะต้องเปิดเผยอย่างเต็มที่ให้เห็นข้อจำกัดและปัญหาที่เกี่ยวข้องกับระบบทั้งหมดอีกด้วย
              </p>
              <p class="rem5">
                5. ให้เกียรติสิทธิในทรัพย์สิน รวมทั้งลิขสิทธิ์และสิทธิ์บัตร
                แม้ว่าสิ่งซึ่งมีลิขสิทธิ์ สิทธิบัตร ความลับทางการค้า
                การละเมิดข้อตกลงการใช้สิทธิ จะได้รับการคุ้มครองทางกฏหมายอยู่แล้ว
                แม้แต่ซอฟต์แวร์ที่ไม่ได้รับการคุ้มครอง
                การละเมิดก็ถือว่าเป็นการขัดต่อการประพฤติทางวิชาชีพ
                การลอกหรือทำสำเนาซอฟต์แวร์จะต้องทำโดยมีอำนาจหน้าที่เท่านั้น
                การทำสำเนาวัสดุใด ๆ เป็นสิ่งที่ให้อภัยไม่ได้
              </p>
              <p class="rem5">
                4. ยุติธรรมและการกระทำที่ไม่แบ่งแยกกีดกัน
                ข้อบังคับข้อนี้ใช้คุณค่าของความเสมอภาค ความใจกว้างให้อภัย
                เคารพในผู้อื่น ความเที่ยงธรรม การแบ่งแยกกีดกันโดยเชื้อชาติ เพศ
                ศาสนา อายุ ความพิการ สัญชาติ
                หรือปัจจัยอื่นเป็นสิ่งที่ไม่อาจยอมรับได้
              </p>
              <p class="rem5">
                6. ให้เกียรติแก่ทรัพย์สินทางปัญญา
                นักวิชาชีพคอมพิวเตอร์จะต้องป้องกันหลักคุณธรรมของทรัพย์สินทางปัญญา
                แม้ว่างานนั้นจะไม่ได้รับการป้องกันอย่างเปิดเผยก็ตาม เช่น
                งานอันมีลิขสิทธิ์หรือสิทธิบัตร
              </p>
              <p class="rem5">
                7. เคารพความเป็นส่วนตัวของผู้อื่น หลักการนี้ยังหมายถึง
                การเก็บข้อมูลส่วนบุคคลไว้ในระบบเท่าที่จำเป็น
                มีระยะเวลากำหนดการเก็บรักษาและทิ้งอย่างชัดเจน
                และปฏิบัติตามอย่างเคร่งครัด
                การรวบรวมข้อมูลไว้เพื่อวัตถุประสงค์หนึ่ง ข้อมูลนั้นจะถูกนำไปใช้
                เพื่อการอื่นโดยไม่ได้รับคำยินยอมจากผู้นั้นมิได้
              </p>
              <p class="rem5">
                8. ให้เกียรติในการรักษาความลับ
                หลักแห่งความซื่อสัตย์ข้อนี้ขยายไปถึงความลับของข้อมูลที่ไม่ว่าจะแจ้งโดยเปิดเผยหรือสัญญว่าจะปกปิดเป็นความลับ
                หรือโดยนัยเมื่อข้อมูลส่วนตัวที่ไม่เกี่ยวข้องกับหน้าที่ของผู้นั้นปรากฏขึ้น
                จริยธรรมข้อนี้เกี่ยวข้องกับการเคารพข้อบังคับทั้งหลายที่เกี่ยวกับความลับของขายจ้าง
                ลูกค้า ผู้ใช้
                เว้นเสียแต่เปิดเผยโดยกฏหมายบังคับหรือตามหลักแห่งจรรยาบรรณนี้
              </p>
              <br />
              <h5 class="rem2">2. ความรับผิดชอบในวิชาชีพ</h5>
              <p class="rem5">
                1. มุ่งมั่นเพื่อให้ได้คุณภาพที่ดีที่สุด
                และให้ตระหนักถึงผลเสียหายที่สืบเนื่องจากระบบที่ด้อยคุณภาพ
              </p>
              <p class="rem5">
                2. ได้มาและรักษาไว้ซึ่งความเชี่ยวชาญแห่งวิชาชีพ
              </p>
              <p class="rem5">
                3. รับรู้และเคารพกฎหมายท้องถิ่น กฎหมายแห่งรัฐ
                และกฎหมายระหว่างประเทศ
              </p>
              <p class="rem5">
                4. ยอมรับและจัดให้มีการสอบทานทางวิชาชีพ (Professional Review)
              </p>
              <p class="rem5">
                5.
                ให้ความเห็นประเมินระบบคอมพิวเตอร์และผลกระทบอย่างละเอียดครบถ้วน
                รวมทั้งการวิเคราะห์ความเสี่ยงที่เป็นไปได้
              </p>
              <p class="rem5">
                6. ให้เกียรติ รักษาสัญญา ข้อตกลง
                และความรับผิดชอบที่ได้รับมอบหมาย
              </p>
              <p class="rem5">
                7. ปรับปรุงความเข้าใจของสาธารณชนต่อคอมพิวเตอร์และผลสืบเนื่อง
              </p>
              <p class="rem5">
                8.
                เข้าถึงทรัพยากรคอมพิวเตอร์และสื่บสารเฉพาะเมื่อได้รับมอบอำนาจตามหน้าที่เท่านั้นไม่ใช้ระบบคอมพิวเตอร์ของผู้อื่น
                ซอฟต์แวร์ แฟ้มข้อมูลใด ๆ โดยไม่ได้ขออนุญาต
              </p>
              <br />
              <h5 class="rem2">3. จริยธรรมในการใช้ไปรษณีย์อิเล็กทรอนิกส์</h5>
              <p class="rem5">1. ไม่โฆษณาหรือเสนอขายสินค้า</p>
              <p class="rem5">2. รู้ตัวว่ากำลังกล่าวอะไร</p>
              <p class="rem5">
                3. ถ้าไม่เห็นด้วยกับหลักพื้นฐานของรายชื่อกลุ่มที่ตนเป็นสมาชิก
                ก็ควรออกจากกลุ่มไม่ควรโต้แย้ง
              </p>
              <p class="rem5">4. คิดก่อนเขียน</p>
              <p class="rem5">5. อย่าใช้อารมณ์</p>
              <p class="rem5">6. พยายามอ่านคำถามที่ถามบรอย (FAQ) ก่อนเสมอ</p>
              <p class="rem5">
                7. ไม่ส่งข่าวสารที่กล่าวร้าย หลอกลวง หยาบคาย ข่มขู่
              </p>
              <p class="rem5">8. ไม่ส่งต่อจดหมายลูกโซ่ หรือเมล์ขยะ</p>
              <p class="rem5">9. ถ้าสงสัยไม่ทำดีกว่า</p>
              <p class="rem5">
                10. รู้ไว้ด้วยว่าสำหรับผู้เขียน คือ บันทึกฉันท์เพื่อน
                แต่สำหรับผู้รับ คือ ข้อความที่จารึกไว้บนศิลาจารึก
              </p>
              <p class="rem5">11. ให้ความระมัดระวังกับคำเสียดสี และอารมณ์ขัน</p>
              <p class="rem5">
                12. อ่านข้อความในอีเมล์ ให้ละเอียดก่อนส่ง ความประณีตและตัวสะกด
                การันต์ เป็นสิ่งที่ควรคำนึงถึง
              </p>
              <p class="rem5">
                13. ดูรายชื่อผู้รับให้ดีว่า เขาคือคนที่เราตั้งใจจะส่งไปถึง
              </p>
              <!-- -------------------------------- -->
              <br />
              <br />
              <br />
              <br />
              <div class="container">
                <div class="row">
                  <div class="col-auto mr-auto">
                    <router-link to="/lesson6_2" title="Lesson6_2 Page">
                      <div class="btn-wrapper">
                        <base-button
                          tag="a"
                          target="_blank"
                          rel="noopener noreferrer"
                          class="mb-3 mb-sm-0"
                          outline
                          type="info"
                          icon="fa fa-chevron-left"
                          >Previous</base-button
                        >
                      </div>
                    </router-link>
                  </div>
                  <div class="col text-center">
                         <div class="btn-wrapper">
                          <base-button
                          id="back-to-top"
                          href="#"
                          role="button"
                          tag="a"
                          rel="noopener noreferrer"
                          class="btn  back-to-top"
                          
                          outline type="info"
                        >
                          <i class="fa fa-chevron-up" aria-hidden="true"></i>
                        </base-button>
                      </div>
                  </div>
                  <div class="col-auto">
                      <router-link to="/lesson6_4" title="Lesson6_4 Page">
                    <div class="btn-wrapper">
                      <base-button
                        tag="a"
                        target="_blank"
                        rel="noopener noreferrer"
                        class="mb-3 mb-sm-0"
                        outline
                        type="info"
                      >
                        Next
                        <i class="fa fa-chevron-right" aria-hidden="true"></i>
                      </base-button>
                    </div>
                    </router-link>
                  </div>
                </div>
              </div>
              <div class="text-center mt-5">Page 3/4</div>
            </div>
          </div>
        </div>
      </section>

      <hr />
      <div class="col-lg-center">
        <div class="pt-4 text-center">
          <h5 class="title">
            <span class="d-block mb-1">Author | Dr. Piyawan Siriprasertsil</span>
            <small class="h6 text-black"
              >Lecturer in The Business Administration at Maejo University</small
            >
          </h5>
        </div>
      </div>
      <hr />
    </div>
  </div>
</template>

<script>
export default {
  name: "home",
  components: {},
};
</script>

<style></style>
