<template>
  <div>
    <div class="position-relative">
      <section class="section-shaped my-0">
        <div class="shape shape-style-1 shape-default">
          <span></span>
          <span></span>
          <span></span>
          <span></span>
          <span></span>
          <span></span>
          <span></span>
          <span></span>
          <span></span>
        </div>

        <div class="container shape-container d-flex">
          <div class="col px-0"></div>
        </div>
      </section>

      <section class="section section-shaped my-0 overflow-hidden">
        <div class="container pt-lg pb-80">
          <div class="row justify-content-center">
            <div class="fontx col-lg-10">
              <!-- -------------------------------- -->
              <h4>โซลิตสเตตไดรฟ์ (Solid State Drive)</h4>
              <p class="rem2">
                โซลิตสเตตไดรฟ์ หรือ เอสเอสดี
                เป็นอุปกรณ์บันทึกข้อมูลที่ถูกสร้างขึ้นมาจากหน่วยความจำแฟลช
                มีความจุตั้งแต่ 80GB ถึง 4TB (มีจำหน่วยในประเทศไทย ณ
                วันที่เขียน)
                เอสเอสดีถูกออกแบบให้ใช้เป็นหน่วยความจำหลักสำหรับติดตั้งถาวรในเครื่องคอมพิวเตอร์ส่วนบุคคล
                เครื่องเซอร์ฟเวอร์ หรือภายในสมาร์ทโฟน
                ส่วนควบคุมการทำงานของหน่วยความจำแฟลช
                จึงมีความซับซ้อนกว่าที่ใช้ในแฟลชไดรฟ์เป็นอย่างมาก
                เพราะต้องจัดการพื้นที่เก็บข้อมูลที่มีขนาดใหญ่
                และธรรมชาติของการอ่านและเขียนข้อมูลที่เป็นแบบเชิงสุ่ม (Random
                Read/Write) (ต่างกับแฟลชไดรฟ์ที่เป็นแบบเชิงลำดับ)
                นอกจากนั้นยังมีการเชื่อมต่อข้อมูลที่ต้องการความเร็วสูงในการรับส่งข้อมูลอีกด้วย
              </p>
              <br />
              <div class="text-center font-italic col">
                <img src="/img/lesson7/f3.png" width="70%" />
                <p>
                  <br />Figure 3 ตัวอย่างเอสเอสดีที่มีการเชื่อมต่อแบบ SATA และ
                  M.2 (https://www.samsung.com)
                </p>
              </div>
              <br />
              <p class="rem2">
                เนื่องจากการทำงานบนเอสเอสดีจะต้องมีการแก้ไขข้อมูลที่ถูกบันทึกอยู่บ่อยครั้ง
                ส่วนควบคุมจึงต้องใช้อันตอนวิธี (Algorithm)
                อันซับซ้อนเพื่อให้จำนวนของการเปลี่ยนแปลงค่าในเซลล์ข้อมูลมีการเปลี่ยนแปลงน้อยที่สุดเพื่อยืดอายุการใช้งาน
                ตัวอย่างเช่น เอสเอสดีที่ถูกสร้างขึ้นด้วยเซลล์แบบ QLC
                จะมีรอบของการแก้ไขข้อมูลอยู่เพียง 100 ครั้งต่อเซลล์
                ดังนั้นหากไม่มีการจัดการที่ดี อายุขัยของ เอสเอสดีจะสั้นมาก
                ดังนั้นส่วนควบคุมจึงต้องมีขึ้นตอนวิธีดังนี้
              </p>
              <p class="rem2">
                การแคช (Cache)
                เป็นการบันทึกข้อมูลที่ต้องการเขียนลงในหน่วยความจำชั่วคราวซึ่งมักจะสร้างจากหน่วยความจำที่มีความเร็วสูงและทนทานต่อการอ่านและเขียนซ้ำก่อน
                จากนั้นจึงสำเนาข้อมูลนี้ลงในแฟลชเซลล์
                ซึ่งวิธีการแคชนี้นอกจากจะช่วยให้การอ่านและเขียนข้อมูลทำได้เร็วแล้ว
                หากข้อมูลที่ต้องการแก้ไขอยู่ในหน่วยความจำแคชอยู่แล้ว
                ก็ทำการแก้ไขในหน่วยความจำแคชได้เลย โดยไม่ต้องกระทำกับเซลล์
                วิธีการนี้จึงช่วยลดจำนวนการเขียนข้อมูลที่ไม่จำเป็นของเซลล์ได้
              </p>
              <p class="rem2">
                การเกลี่ยความเสื่อมสภาพ (Wear leveling)
                ในการใช้งานจริงเป็นไปได้ที่แฟ้มข้อมูลบางแฟ้มอาจถูกแก้ไขบ่อยกว่าแฟ้มอื่น
                ๆ ตัวอย่างเช่นแฟ้มฐานข้อมูลการขายประจำวัน
                ที่จะต้องมีการเปลี่ยนแปลงข้อมูลอยู่ตลอดเวลา
                ซึ่งจะทำให้เซลล์ที่เก็บข้อมูลนี้อยู่เสื่อมสภาพเร็วกว่าเซลล์อื่น
                ๆ ส่วนควบคุมจึงต้องทำการเช็คความเสื่อมสภาพของเซลล์
                หากพบว่ามีความเสื่อมสภาพสูงกว่าเซลล์อื่น
                ก็จะทำการเขียนข้อมูลที่ต้องการแก้ไขลงไปในเซลล์อื่นที่ยังไม่มีข้อมูลแทน
                จากนั้นก็ทำการติดเครื่องหมายให้เซลล์เดิมที่มีข้อมูลกลายเป็นเซลล์ว่าง
                จึงสามารถช่วยให้เซลล์มีอายุการใช้งานใกล้เคียงกัน
              </p>
              <p class="rem2">
                การใช้ข้อมูลอภิพันธุ์ (metadata)
                เป็นการเพิ่มข้อมูลเสริมสำหรับแปลความหมายของข้อมูลแต่ละเซลล์
                ตัวอย่างเช่น ต้องการเปลี่ยนข้อมูลในเซลล์จาก 0000 ไปเป็น 1111
                จะใช้วิธีการแก้ไขข้อมูลอภิพันธุ์เพื่อสลับความหมายของ 0 และ 1
                เพื่อให้ข้อมูลเดิมที่บันทึกอยู่ในเซลล์
                มีความหมายเปลี่ยนไปโดยไม่ต้องทำการแก้ไขข้อมูลจริง ๆ ในเซลล์
              </p>
              <p class="rem2">
                เอสเอสดีนั้นมีการเชื่อมต่ออยู่หลัก ๆ อยู่ 2 แบบ
                คือแบบที่ติดตั้งภายในเครื่อง คือแบบ SATA กับ M.2
                และแบบที่เชื่อมต่อภายนอก จะเชื่อมต่อแบบยูเอสบี เหมือนแฟลชไดรฟ์
                เรียกว่า เอสเอสดีฮาร์ดไดรฟ์แบบภายนอก (External SSD Hard drive)
                วิธีการใช้งานเหมือนกับแฟลชไดรฟ์
                แต่เนื่องจากมีส่วนควบคุมที่ซับซ้อนกว่า
                และสามารถเข้าถึงข้อมูลแบบสุ่มได้
                จึงสามารถทำงานตัดต่อวิดิทัศน์บนเอสเอสดีได้
              </p>
              <p class="rem2">
                เอสเอสดีมีความเร็วในการอ่านและเขียนข้อมูลที่สูงกว่าฮาร์ดไดรฟ์แบบแม่เหล็ก
                (แบบเก่า) ใช้พลังงานน้อย
                และสามารถเก็บรักษาข้อมูลได้เป็นเวลานานกว่า มีขนาดเล็ก
                และนอกจากนั้นยังไม่มีเสียงรบกวนขณะใช้งานอีกด้วย แต่อย่างไรก็ตาม
                เอสเอสดีนั้นมีราคาสูง
                และหากใช้เป็นอุปกรณ์บันทึกข้อมูลหลักในการทำงาน
                ผู้ใช้ควรคำนึงถึงชนิดของเซลล์ที่ใช้ในการผลิตเอสเอสดีด้วย
                หากผู้ใช้งานต้องการความเร็วและความทนทานต่อความเสื่อมสภาพก็ควรเลือกใช้ชนิดที่สร้างด้วยเซลล์แบบ
                SLC แต่เอสเอสดีชนิดนี้ก็จะมีราคาสูงด้วย
                หากต้องการเอสเอสดีที่มีราคาถูกก็ต้องใช้งานให้ถูกวิธีเพื่อไม่ให้มีการเสื่อมสภาพเร็วเกินไป
                โดยไม่ทำการลบและบันทึกข้อมูลโดยไม่จำเป็น
                อีกวิธีที่ช่วยยืดอายุการใช้งานได้คือไม่บันทึกข้อมูลจนใกล้เต็มความจุของเอสเอสดี
                เนื่องจากจะมีเหลือพื้นที่ว่างสำหรับการเกลี่ยความเสื่อมสภาพ
                ดังนั้นหากใช้งานเอสเอสดี เป็นหน่วยความจำหลักในการทำงาน
                ก็ควรใช้งานเพียงครึ่งหนึ่งของความจุทั้งหมด
                หากหลีกเลี่ยงไม่ได้ที่ต้องเปลี่ยนแปลงข้อมูลบ่อย
                หรือต้องการพื้นที่ในการเก็บข้อมูลสูง ก็ไม่ควรใช้เอสเอสดี
                แต่ให้ใช้ฮาร์ดไดรฟ์แบบแม่เหล็กแทน
              </p>
              <p class="rem2">
                ความจุของแฟลชไดรฟ์และเอสเอสดีนั้นมีหน่วยเป็น ไบต์ (Byte)
                แทนด้วยตัวอักษร B โดยพื้นที่ 1
                ไบต์จะประกอบด้วยหน่วยบันทึกข้อมูลที่เป็นข้อมูลได้เพียง 0 หรือ 1
                เท่านั้นเรียกว่า บิต (Bit) แทนด้วยตัวอักษร b จำนวน 8 บิต
                ซึ่งระบบดิจิทัลจะเป็นเลขฐาน 2 ที่ 1 หลักจะแทนตัวเลขได้เพียง 2
                จำนวนคือ 0 และ 1 แตกต่างกับระบบเลขฐาน 10 ที่ 1 หลักจะแทนได้ถึง
                10 จำนวนคือ 0,1,2,3,4,5,6,7,8,9 การเพิ่มจำนวนหลักในฐาน 10
                จะเพิ่มจำนวนค่าที่แทนได้เป็น 10 เท่า แต่สำหรับฐาน 2
                แล้วการเพิ่มจำนวนหลักจะทำให้จำนวนค่าที่แทนได้เพิ่มขึ้นเพียง 2
                เท่า
              </p>

              <p class="rem5">
                ดังนั้นการเก็บข้อมูล 1,000 ค่า สำหรับเลขฐาน 10 จะต้องใช้ 3 หลัก
                (000 ถึง 999) หรือ 103
              </p>
              <p class="rem5">
                แต่การเก็บข้อมูล 1,000 ค่าหากใช้เลขฐาน 2 จะต้องใช้ 10 หลัก (00
                0000 0000 ถึง 11 1110 1000) หรือ 210 แต่จะเห็นว่าจำนวนบิต 10
                หลักนั้นสามารถแทนข้อมูลได้ถึง 210 = 1024 ระดับ
                และพื้นที่เก็บข้อมูลขนาด 1,000 ค่านั้นจึงไม่มีในระบบดิจิทัล
              </p>

              <p class="rem2 font-weight-bold">
                ดังนั้นเพื่อป้องกันความสับสนของหน่วยความจุของข้อมูลที่เป็นเลขฐาน
                2 และหน่วยความจุที่เป็นเลขฐาน 10
                จึงได้มีการกำหนดให้เรียกหน่วยแยกกันอย่างชัดเจน โดยฐาน 10
                จะใช้หน่วยเมตริก (Metric) และฐาน 2 ใช้หน่วยไออีซี( International
                Electrotechnical Commission : IEC)
              </p>
              <br />

              <p class="font-weight-bold rem2">
                ตาราง 1 : หน่วยเรียกในระบบเมตริก
              </p>
              <br />
              <table class="table">
                <thead>
                  <tr class="text-center">
                    <th scope="col">ค่า</th>
                    <th scope="col">ตัวย่อ</th>
                    <th scope="col">หน่วยเมตริก</th>
                    <th scope="col">คำอ่าน</th>
                  </tr>
                </thead>
                <tbody>
                  <tr>
                    <th scope="row">1000</th>
                    <td>kB</td>
                    <td>Kilobyte</td>
                    <td>กิโลไบต์</td>
                  </tr>
                  <tr>
                    <th scope="row">1000^2</th>
                    <td>MB</td>
                    <td>Megabyte</td>
                    <td>เมกะไบต์</td>
                  </tr>
                  <tr>
                    <th scope="row">1000^3</th>
                    <td>GB</td>
                    <td>Gigabyte</td>
                    <td>กิกะไบต์</td>
                  </tr>
                  <tr>
                    <th scope="row">1000^4</th>
                    <td>TB</td>
                    <td>Terabyte</td>
                    <td>เทราไบต์</td>
                  </tr>
                  <tr>
                    <th scope="row">1000^5</th>
                    <td>PB</td>
                    <td>Petabyte</td>
                    <td>เพตาไบต์</td>
                  </tr>
                  <tr>
                    <th scope="row">1000^6</th>
                    <td>EB</td>
                    <td>Exabyte</td>
                    <td>เอกสะไบต์</td>
                  </tr>
                  <tr>
                    <th scope="row">1000^7</th>
                    <td>ZB</td>
                    <td>Zettabyte</td>
                    <td>เซตะไบต์</td>
                  </tr>
                  <tr>
                    <th scope="row">1000^8</th>
                    <td>YB</td>
                    <td>Yottabyte</td>
                    <td>โยตะไบต์</td>
                  </tr>
                </tbody>
              </table>
              <br />
              <p class="font-weight-bold rem2">
                ตาราง 2 : หน่วยเรียกในระบบไออีซี
              </p>
              <br />
              <table class="table">
                <thead>
                  <tr class="text-center">
                    <th scope="col">ค่า</th>
                    <th scope="col">ตัวย่อ</th>
                    <th scope="col">หน่วยเมตริก</th>
                    <th scope="col">คำอ่าน</th>
                  </tr>
                </thead>
                <tbody>
                  <tr>
                    <th scope="row">1024</th>
                    <td>KiB</td>
                    <td>Kibibyte</td>
                    <td>คีบีไบต์</td>
                  </tr>
                  <tr>
                    <th scope="row">1024^2</th>
                    <td>MiB</td>
                    <td>Mebibyte</td>
                    <td>เมบิไบต์</td>
                  </tr>
                  <tr>
                    <th scope="row">1024^3</th>
                    <td>GiB</td>
                    <td>Gibibyte</td>
                    <td>กิบิไบต์</td>
                  </tr>
                  <tr>
                    <th scope="row">1024^4</th>
                    <td>TiB</td>
                    <td>Tebibyte</td>
                    <td>เทบิไบต์</td>
                  </tr>
                  <tr>
                    <th scope="row">1024^5</th>
                    <td>PiB</td>
                    <td>Pebibyte</td>
                    <td>เพบิไบต์</td>
                  </tr>
                  <tr>
                    <th scope="row">1024^6</th>
                    <td>EiB</td>
                    <td>Exbibyte</td>
                    <td>เอกบิไบต์</td>
                  </tr>
                  <tr>
                    <th scope="row">1024^7</th>
                    <td>ZiB</td>
                    <td>Zebibyte</td>
                    <td>เซบิไบต์</td>
                  </tr>
                  <tr>
                    <th scope="row">1024^8</th>
                    <td>YiB</td>
                    <td>Yobibyte</td>
                    <td>โยบิไบต์</td>
                  </tr>
                </tbody>
              </table>
              <br />
              <p class="rem2">
                จากตารางนี้จะสังเกตได้ว่าอุปกรณ์ที่มีหน่วยความจะเป็น 1GiB
                จะมีพื้นที่สำหรับบันทึกข้อมูลมากกว่า 1GB เสมอ
                ดังนั้นในการเลือกซื้อจึงควรพิจารณาความคุ้มค่าในส่วนนี้ด้วย
                เนื่องจากกฎหมายยังไม่ได้บังคับให้ผู้ผลิตใช้หน่วยใดในการแสดงค่าความจุของอุปกรณ์บันทึกข้อมูล
                บางผู้ผลิตหรือร้านค่าจึงแสดงค่าความจุเป็น GB
              </p>
              <br />

              <h4>ส่งออกข้อมูลจากแฟ้มดิจิทัลไปสู่เอกสารที่เป็นกระดาษ</h4>
              <p class="rem2">
                แฟ้มข้อมูลหรือเอกสารที่อยู่ในรูปแบบดิจิทัลนั้นง่ายต่อการจัดเก็บ
                การส่งต่อ และการประมวลผล
                แต่มนุษย์นั้นไม่สามารถจะเข้าใจข้อมูลดิจิทัลได้โดยตรง
                เพื่อให้มนุษย์เข้าใจได้จะต้องทำการแปลงให้อยู่ในรูปแบบแอนะล็อกก่อน
                เอกสารที่เป็นภาพก็เช่นกัน
                ภาพถ่ายที่อยู่ในรูปแบบดิจิทัลเมื่อแสดงผลจะถูกแปลงให้อยู่ในรูปแบบของสัญญาณแอนะล็อก
                และแสดงบนจอภาพในรูปแบบของชุดของจุดภาพ (pixel) เรียกว่าแผนที่บิต
                (bitmap) หรือการพิมพ์ลงสู่กระดาษเป็นภาพ
                หรือเรียกว่าการทำฮาร์ดก็อปปี้ (hard copy)
              </p>
              <p class="rem2">
                เอกสารที่เป็นข้อความ (text document) จะถูกจัดเก็บในรูปแบบของ
                สายอักขระ (string) การแปลงออกเป็นภาพ จะใช้วิธีการกวาดจุดภาพ
                หรือแรสเตอร์ไรเซชั่น (rasterization) ที่ละกลุ่มตามรูปแบบตัวอักษร
                (font) ที่กำหนด จากนั้นจุดภาพจะถูกจัดกลุ่มให้มีขนาดกลุ่มละ 8 บิต
                ในกรณีที่เป็นภาพทวิภาค (binary)ซึ่งมีเพียง 2 ระดับคือดำและขาว
                ก็จะได้ออกมาเป็นภาพแผนที่บิต
              </p>
              <br />
              <div class="text-center font-italic col">
                <img src="/img/lesson7/7.png" width="70%" />
                <p>
                  <br />รูป
                  7ตัวอย่างการแปลงข้อมูลดิจิทัลเป็นภาพด้วยวิธีแรสเตอรไรเซชั่น
                </p>
              </div>
              <br />
              <p class="rem2">
                หากข้อความหรือภาพมีความยาว ก็จะนำเอากลุ่มของจุดภาพนี้มาต่อรวมกัน
                ก็จะได้เป็นภาพหรือข้อความที่สมบูรณ์ เครื่องพิมพ์ (printer)
                คืออุปกรณ์ที่ทำหน้าที่แปลงข้อมูลแรสเตอร์นี้ให้เป็นแผนที่บิต
                และถ่ายทอดแผนที่บิตนี้เป็นภาพลงบนกระดาษ
                เครื่องพิมพ์ที่มีความละเอียดสูงจะสามารถถ่ายทอดจุดภาพที่มีขนาดเล็ก
                กว่าเครื่องพิมพ์ที่มีความละเอียดต่ำ
                โดยความละเอียดนี้จะระบุในหน่วยของ จำนวนจุดภาพต่อความยาว 1 นิ้ว
                (dot-per-inch : DPI) ยังค่านี้สูง ก็จะได้ภาพที่มีความละเอียดสูง
                ขั้นตอน วิธีการ หรือภาษาในการแปลงข้อมูลดิจิทัลให้กลายเป็นภาพ
                นั้นจะแตกต่างกันไปขึ้นอยู่กับเทคโนโลยีการพิมพ์ของเครื่องพิมพ์
                และเทคโนโลยีเฉพาะของผู้ผลิต
              </p>
              <br />
              <div class="text-center font-italic col">
                <img src="/img/lesson7/8.png" width="70%" />
                <p><br />รูป 8 ตัวอย่างแผนที่บิตของสายอักขระ “MJU”</p>
              </div>
              <br />
              <p class="rem2 font-weight-bold">
                เทคโนโลยีของเครื่องพิมพ์นั้นแบ่งออกเป็น 4 กลุ่มได้แก่
              </p>
              <p class="rem5 ">1. ใช้ผงหมึก ( Toner-based printers)</p>
              <p class="rem5 ">2. พ่นน้ำหมึก (Liquid inkjet printer)</p>
              <p class="rem5 ">3. การระเหิด (Dye-sublimation printers)</p>
              <p class="rem5 ">4. ใช้ความร้อน (Thermal printers)</p>
              <p class="rem5 ">5. เครื่องพิมพ์แบบกระแทก ( Impact printers)</p>

              <h4>การพิมพ์ด้วยผงหมึก (Toner-based printers)</h4>
              <p class="rem2">
                การพิมพ์ด้วยผงหมึก (Toner-based printers)
                เป็นเครื่องพิมพ์ที่สร้างภาพบนกระดาษโดยใช้ผงหมึก เรียกว่าโทนเนอร์
                (toner) สามารถพิมพ์ได้อย่างรวดเร็ว และมีคุณภาพการพิมพ์ที่ดี
                หลักการทำงานจะคล้ายกับเครื่องถ่ายเอกสาร
                เครื่องพิมพ์ประเภทนี้ที่ได้รับความนิยมคือ เครื่องพิมพ์แบบเลเซอร์
                (LASER printer) ซึ่งมีส่วนประกอบสำคัญอยู่ 5 ส่วนคือ
              </p>
              <p class="rem5">-	ดรัม (drum) เป็นลูกกลิ้งไวต่อประจุ ประจุและผงหมึกสามารถยึดเกาะได้ดี</p>
              <p class="rem5">-	โทนเนอร์ (toner) เป็นผงหมึกที่เกิดประจุและเกาะกับดรัมได้ดี</p>
              <p class="rem5">-	เลเซอร์ไดโอด ( later diode) ใช้สร้างแสงเลเซอร์</p>
              <p class="rem5">-	ลูกกลิ้งสำหรับอบหลอมและรีดผงหมึก (fuser)</p>
                <br />
              <div class="text-center font-italic col">
                <img src="/img/lesson7/9.png" width="70%" />
                <p><br />รูป 9 โครงสร้างตัดขวางของเครื่องพิมพ์แบบเลเซอร์</p>
              </div>
              <br />


              <!-- -------------------------------- -->
              <br />
              <br />
              <br />
              <br />
              <div class="container">
                <div class="row">
                  <div class="col-auto mr-auto">
                    <router-link to="/lesson6_1" title="Lesson6_1 Page">
                      <div class="btn-wrapper">
                        <base-button
                          tag="a"
                          target="_blank"
                          rel="noopener noreferrer"
                          class="mb-3 mb-sm-0"
                          outline
                          type="info"
                          icon="fa fa-chevron-left"
                          >Previous</base-button
                        >
                      </div>
                    </router-link>
                  </div>
                  <div class="col-auto">
                    <router-link to="/lesson6_3" title="Lesson6_3 Page">
                      <div class="btn-wrapper">
                        <base-button
                          tag="a"
                          target="_blank"
                          rel="noopener noreferrer"
                          class="mb-3 mb-sm-0"
                          outline
                          type="info"
                        >
                          Next
                          <i class="fa fa-chevron-right" aria-hidden="true"></i>
                        </base-button>
                      </div>
                    </router-link>
                  </div>
                </div>
              </div>
              <div class="text-center mt-5">Page 2/4</div>
            </div>
          </div>
        </div>
      </section>

      <hr />
      <div class="col-lg-center">
        <div class="pt-4 text-center">
          <h5 class="title">
            <span class="d-block mb-1">Author | -</span>
            <small class="h6 text-black">_</small>
          </h5>
        </div>
      </div>
      <hr />
    </div>
  </div>
</template>

<script>
export default {
  name: "home",
  components: {},
};
</script>

<style></style>
